[{},
  {
    "id": "1",
    "title": "Homemade crispy chilli oil",
    "difficulty": "Easy",
    "portion": "Makes 250ml",
    "time": "Hands-on time 30 min, plus overnight infusing ",
    "description": "This is a full-flavoured, in-your-face crispy chilli oil, with plenty of fire, spice and floral numbness from the Sichuan peppercorns. Use it as a base recipe to then tweak, amend and experiment with until you’ve found your perfect combination.",
    "ingredients": [
      "250g vegetable or sunflower oil",
      "2 slices fresh ginger",
      "3 banana shallots, finely sliced",
      "5 garlic cloves, finely sliced",
      "3 tbsp Sichuan peppercorns",
      "3 star anise",
      "1 cinnamon stick",
      "1 tsp fennel seeds",
      "50g gochugaru (Korean red pepper flakes)",
      "25g chilli flakes, or crushed dried chillies",
      "½ tbsp sweet paprika",
      "2 dried bay leaves",
      "2 tsp salt",
      "1 tsp caster sugar",
      "Thermometer",
      "Sterilised jar"
    ],
    "method": [
      {
        "Step 1": "Pour the oil into a saucepan with a spout. Add the ginger, shallots and garlic, then place over a medium heat and gradually bring to 160°C. Meanwhile, put the Sichuan peppercorns, star anise, cinnamon stick and fennel seeds in a dry frying pan and toast over a medium heat for a few minutes until fragrant. Crush the peppercorns and fennel seeds in a pestle and mortar."
      },
      {
        "Step 2": "Mix the toasted spices with the remaining ingredients in a heatproof container that holds at least a litre, as the oil will bubble up a lot when you pour it in. Mould the mixture into a pyramid, then make an indent in the tip – this is what you’ll pour your oil into."
      },
      {
        "Step 3": "As the oil heats up, the ginger, shallots and garlic will sizzle and begin to colour. As soon as they turn golden, remove them with a slotted spoon. Discard the ginger and leave the shallots and garlic to crisp up as they cool."
      },
      {
        "Step 4": "Once the oil is up to temperature, very carefully pour around a quarter of it into the chilli mixture – it will instantly bubble up and produce a lot of steam. Give everything a good mix, then continue to pour the oil slowly, until the bowl or jar is filled. Leave to cool for 10 minutes, add the fried garlic and shallots, then transfer to a sterilised jar. Seal and leave to infuse at room temperature overnight."
      },
      {
        "Step 5": "The next day, carefully remove and discard the star anise, cinnamon and bay leaves. Keep the chilli oil in the fridge for up to a month."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/1.jpg"
  },
  {
    "id": "2",
    "title": "Prawn and lemongrass hot and sour soup",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 40 min, plus cooling",
    "description": "Georgina Hayden’s fragrant hot and sour soup is packed with prawns, noodles and zingy fresh herbs. Batch cook and freeze the broth ready for busy nights.",
    "ingredients": [
      "400g raw shell-on prawns",
      "1.25 litres fish stock",
      "2 lemongrass stalks, trimmed and roughly chopped",
      "4cm knob fresh ginger, roughly chopped",
      "4 lime leaves, roughly chopped",
      "1-2 bird’s eye chillies, roughly chopped",
      "3 garlic cloves, roughly chopped",
      "4 tbsp fish sauce",
      "½ tbsp caster sugar",
      "Juice 2 limes",
      "150g oyster and/or enoki mushrooms, roughly torn",
      "300g cooked rice noodles to serve",
      "4 spring onions, trimmed and finely sliced, to serve",
      "½ bunch of coriander and/or mint, leaves picked, to serve"
    ],
    "method": [
      {
        "Step 1": "Shell the prawns, then put the shells in a large saucepan with the stock (reserve the prawns in the fridge). In a pestle and mortar crush the lemongrass, ginger, lime leaves, chillies and garlic cloves just enough tobruise them, break them up and release their flavours. Add them to the stock and put the pan over a medium heat. Gently bring to the boil, then reduce to a simmer and cook for 20 minutes."
      },
      {
        "Step 2": "Strain the flavoured stock, discarding all the solids, then return the clear broth to the pan. Add 3 tbsp of the fish sauce, the sugar and the juice of 1½ limes. Taste and add more of everything to suit your taste: you’re looking for a punchy, tangy, salty broth. Add the prawns and mushrooms to the pan and simmer for 2 minutes until just cooked through. At this point, you can freeze the broth (see Make Ahead)."
      },
      {
        "Step 3": "When you’re ready to serve, defrost and gently reheat the broth (if needed). Divide the cooked noodles among 4 bowls, then ladle over the piping hot broth. Divide the prawns and mushrooms among the bowls and scatter over the sliced spring onions. Finish with the herbs."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/2.jpg"
  },
  {
    "id": "3",
    "title": "Steamed lap cheong with five treasure fried rice",
    "difficulty": "Easy",
    "portion": "Serves 4, or 6 with other side dishes",
    "time": "Hands-on time 25 min",
    "description": "Lap cheong, Chinese sausages, are the jewel in these steaming bowls of five-treasure fried rice, packed with prawns, egg and vegetables.",
    "ingredients": [
      "2 lap cheong (Chinese wind-dried sausage; available from Asian supermarkets or souschef.co.uk)",
      "3 tbsp vegetable oil",
      "4 large free-range eggs, beaten",
      "500g cooked jasmine rice",
      "100g shiitake mushrooms, sliced",
      "1 red pepper, finely diced",
      "Bunch spring onions, finely sliced on an angle",
      "50g frozen peas",
      "180g cooked prawns",
      "1 cooked chicken breast, shredded",
      "40g cashews",
      "2 tbsp light soy sauce or tamari",
      "½ tsp ground white pepper",
      "1 tbsp crispy chilli oil or toasted sesame oil, plus extra to serve",
      "Bamboo steamer"
    ],
    "method": [
      {
        "Step 1": "Set a bamboo steamer over a pan of simmering water and a large non-stick wok (ideally carbon steel) over a high heat."
      },
      {
        "Step 2": "Put the lap cheong sausages in the steamer and steam for 15 minutes. Once the wok is smoking hot, add the oil, give it a swirl, then pour in the beaten eggs. Stir the eggs for 10-20 seconds until around half of them have solidified, then add the rice and toss vigorously to combine, using your spoon to break up clumps. The remaining egg should coat the rice grains and turn golden."
      },
      {
        "Step 3": "Add the mushrooms, pepper and spring onions, then cook for 2 minutes, constantly tossing the wok, then tip in the peas, prawns, chicken and cashews. Continue to cook, tossing and stirring vigorously, ensuring the rice is constantly moving in the pan, breaking up clumps as you go. After about 5 minutes, everything should be cooked through and the rice should be beginning to crisp up. Add the soy sauce, white pepper and chilli (or sesame) oil, toss again, then transfer to a serving bowl."
      },
      {
        "Step 4": "Remove the lap cheong from the steamer and slice into discs the thickness of a pound coin. Arrange them on top of the rice, then serve with extra chilli or sesame oil drizzled over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/3.jpg"
  },
  {
    "id": "4",
    "title": "Jeremy Pang’s General Tso’s chicken",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 40 min",
    "description": "Learn how to make General Tso’s chicken with expert chef Jeremy Pang. The popular wok-fried chicken dish is the perfect balance of sweet, sour, spicy, savoury and salty. You’re going to love it.",
    "ingredients": [
      "10 dried red chillies",
      "300g skinless, boneless chicken thighs, diced",
      "200g cornflour, seasoned with ¼ tsp salt and ¼ tsp pepper",
      "½ thumb-size piece ginger, finely sliced",
      "2 garlic cloves, finely sliced",
      "2 spring onions, finely sliced",
      "Vegetable oil for deep-frying",
      "30g caster sugar",
      "1 tsp sriracha chilli sauce",
      "1 tbsp sweet chilli sauce",
      "1 tbsp oyster sauce",
      "½ tbsp black rice vinegar (see Easy Swaps and Know How)",
      "1 tbsp light soy sauce",
      "½ tsp dark soy sauce",
      "1 tsp sesame oil",
      "½ tsp sugar",
      "1 tbsp light soy sauce",
      "1 medium free-range egg, lightly beaten",
      "Sliced red chilli",
      "Sliced spring onions",
      "Steamed rice",
      "Flash-fried green vegetables",
      "Digital thermometer"
    ],
    "method": [
      {
        "Step 1": "Soak the dried red chillies in hot water for 10 minutes, then drain. Mix the sauce ingredients with 50ml water in a small bowl."
      },
      {
        "Step 2": "Put the chicken in a mixing bowl and massage the marinade ingredients into it. Tip in the cornflour and massage in until each piece of meat separates and has a dry white coating."
      },
      {
        "Step 3": "Build your Wok Clock*: start at 12 o’clock with your coated chicken, followed by the ginger, garlic, spring onions, the soaked chillies and lastly the sauce."
      },
      {
        "Step 4": "Deep-fry the coated chicken in vegetable oil at 180°C for 4-5 minutes until golden brown. Transfer the chicken to a plate lined with kitchen paper."
      },
      {
        "Step 5": "If using your wok for deep-frying, carefully pour out the oil into a heatproof bowl to cool, then give your wok a quick wipe with kitchen paper. Put the wok back on the hob and bring 1 tbsp veg oil to a high heat. Add the ginger, garlic and spring onions and stir-fry for 30 seconds."
      },
      {
        "Step 6": "Next add the soaked chillies, followed by the sauce. Boil for 3-4 minutes until syrupy, then add the deep-fried meat, tossing the wok a few times to fully coat the chicken. Sprinkle with sliced red chilli and spring onions and serve immediately with steamed rice and flash-fried green veg."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/4.jpg"
  },
  {
    "id": "5",
    "title": "MiMi Mei Fair’s ‘Hokkien’ noodles",
    "difficulty": "Easy",
    "portion": "Serves 2-3",
    "time": "Hands-on time 30 minutes",
    "description": "These noodles are a celebration dish worth making. Whether you’re cooking up a feast for Chinese New Year or simply a Friday night, Peter Ho of London restaurant MiMi Mei Fair has created a next-level Hokkien noodle dish. The delicate balance of fish sauce, Chinese chicken powder and ground white pepper makes for an umami sensation that’ll have you coming back for seconds.",
    "ingredients": [
      "2 sustainable scallops, sliced in half horizontally (defrosted if needs be)",
      "3 sustainable raw king prawns, sliced in half horizontally (defrosted if needs be)",
      "Pinch cornflour",
      "Pinch caster sugar",
      "Vegetable oil for frying",
      "100g yellow egg noodles, cooked (or use straight-to-wok noodles)",
      "100g rice vermicelli noodles, cooked (or use straight-to-wok noodles)",
      "2 garlic cloves, chopped",
      "2 free-range medium eggs, lightly beaten",
      "20g chives, chopped into batons",
      "50g bean sprouts, rinsed",
      "15g fried shallots (we used shop-bought)",
      "Juice 1 lime",
      "2 tsp fish sauce",
      "1 tsp chicken powder (eg chicken stock cube or bouillon or see Tips)",
      "1 ½ tsp sesame oil",
      "2 tbsp sugar",
      "Pinch ground white pepper"
    ],
    "method": [
      {
        "Step 1": "In a small bowl mix together the seasoning ingredients, then set aside. Season the scallops and prawns with pinch each of salt, sugar and corn flour, lightly sear on both sides in a wok/frying pan in a little oil, then set aside with the seasoning mix until later."
      },
      {
        "Step 2": "Add a splash more oil to the wok/frying pan, add the noodles and vermicelli, then stir-fry, tossing over a medium heat for 1 minute."
      },
      {
        "Step 3": "Push the noodles to one side of the wok, pour in a little more oil, then stir-fry the chopped garlic for 30 seconds. Pour in the eggs and gently mix with the garlic and noodles, add the chicken stock and seasoning mix, then simmer for 2 minutes on a low heat."
      },
      {
        "Step 4": "Add the chives and bean sprouts along with the seared scallops and prawns. Simmer for another 1 minute, gently mixing everything together whilst it’s cooking. Once ready, squeeze over the fresh lime juice and serve straight away."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/5.jpg"
  },
  {
    "id": "6",
    "title": "Giant prawn toast",
    "difficulty": "Easy",
    "portion": "Serves 6-8 as a snack",
    "time": "Hands-on time 15 min",
    "description": "Giant prawn toast is a great sharing dish for Friday nights. Our mega prawn toast with dipping sauce is a fun riff on a takeaway favourite.",
    "ingredients": [
      "1 small (400g) loaf soft white unsliced bread",
      "12 sustainable raw Scottish langoustines (or use sustainable North Atlantic prawns)",
      "2 garlic cloves, crushed",
      "3cm piece ginger, roughly chopped",
      "1 tbsp sesame oil, plus extra",
      "1 tbsp soy sauce",
      "1 tbsp cornflour",
      "1 medium free-range egg, separated (yolk beaten)",
      "2 spring onions, finely chopped",
      "Small bunch coriander, chopped, plus extra leaves to serve",
      "4 tbsp sesame seeds, plus extra to serve",
      "5-6 tbsp light olive oil",
      "½ tsp chilli flakes",
      "4 tbsp sweet chilli sauce",
      "1 tbsp soy sauce",
      "1 tbsp sesame oil",
      "1 tsp white wine vinegar",
      "2 tsp honey"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180ºC fan/gas 6. Turn the loaf on its side and slice the crust off the top and bottom of it. With the loaf still on its side, cut 2 x 1.5cm thick slices, lengthways."
      },
      {
        "Step 2": "Peel the langoustines and roughly chop 8, then add to a food processor with the garlic and ginger. Pulse to a rough mixture, adding a splash of water to loosen if need be. Add the sesame oil, soy, cornflour and egg white, then briefly pulse. Stir in the spring onions and coriander."
      },
      {
        "Step 3": "Evenly spread the mixture over the top of the slices of bread, taking it right to the edges. Slice the remaining 4 langoustines in half lengthways and divide among the slices. Brush egg yolk over and scatter with the sesame seeds."
      },
      {
        "Step 4": "Heat a very large pan over a medium heat with half the oil. When hot, add one slice, bread side down. Cook for 2-3 minutes, then turn and repeat until turning golden and crisp. Put prawn-side down on an oven tray (so the toast doesn’t go soggy) and repeat with the second piece. Put in the oven for 5 minutes or until cooked through."
      },
      {
        "Step 5": "Whisk the dipping sauce ingredients in a small bowl. Top the toasts with coriander leaves, extra sesame seeds and the chilli flakes, then drizzle with sesame oil. Slice and serve with the dipping sauce"
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/6.jpg"
  },
  {
    "id": "7",
    "title": "Wun’s kung pao chicken",
    "difficulty": "Easy",
    "portion": "Serves 3-4 as part of a meal",
    "time": "Hands-on time 45 min, plus marinating",
    "description": "Discover how to make the perfect kung pao chicken with this step-by-step recipe from chef Arty Florea of Wun’s Tea Room in London.",
    "ingredients": [
      "500g skin-on free-range chicken thighs, boned",
      "5 tbsp cornflour",
      "5 tbsp tapioca flour (see Know How)",
      "1 litre vegetable oil for frying",
      "Toasted sesame seeds to serve",
      "1 tsp chilli flakes",
      "Grated zest and juice 1 orange",
      "40ml soy sauce",
      "2cm fresh ginger, chopped",
      "¾ tsp chinese five-spice powder",
      "½ tsp 13-spice mix (see Easy Swaps)",
      "1 tsp salt",
      "150ml sunflower oil",
      "250ml buttermilk (see Easy Swaps)",
      "1 tbsp shaoxing rice wine",
      "2½ tsp sichuan peppercorns",
      "110g doubanjiang (see Know How)",
      "65ml black rice vinegar (or use regular rice wine vinegar)",
      "1 tbsp light soy sauce",
      "140g honey",
      "175g salted butter",
      "160g natural yogurt",
      "Food processor",
      "Blender or large pestle and mortar",
      "Tongs",
      "Probe thermometer"
    ],
    "method": [
      {
        "Step 1": "Put the marinade ingredients and 75ml water in a food processor or spice grinder and whizz until smooth (or pound together in a pestle and mortar)."
      },
      {
        "Step 2": "Cut each chicken thigh into 4-6 pieces and put in a bowl. Add the marinade, toss to coat, then set aside for at least 20 minutes (see Make Ahead)."
      },
      {
        "Step 3": "For the kung pao sauce, whizz the sichuan peppercorns in a spice grinder (or pound in a pestle and mortar), then tip into a pan with the doubanjiang, black rice vinegar, soy sauce, honey and 100ml water. Add the butter, then put the pan over a medium heat to warm through and melt the butter – you don’t want it to boil. Mix in the yogurt, then keep warm until ready to serve."
      },
      {
        "Step 4": "Heat a large deep pan with the vegetable oil (no more than two-thirds full) until it reads 180°C on a probe thermometer (or a cube of bread turns brown in 15 20 seconds)."
      },
      {
        "Step 5": "Meanwhile, mix the cornflour and tapioca flour in a large bowl. Add the marinated chicken and use your hands to make sure each piece is well coated. The coating may look uneven, but this will create delicious crispy bits. Working in batches, use tongs to lower the chicken into the hot oil and fry until the pieces are crisp, lightly golden and cooked all the way through (about 3-4 minutes)."
      },
      {
        "Step 6": "Drain the fried chicken, then add to a bowl, toss with a few spoonfuls of the kung pao sauce and sprinkle with sesame seeds – enjoy!"
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/7.jpg"
  },
  {
    "id": "8",
    "title": "Crispy pork potsticker dumplings",
    "difficulty": "Easy",
    "portion": "Makes 20 dumplings (serves 2 as a meal or 3-4 as a snack)",
    "time": "Hands-on time 40 minutes",
    "description": "Some say potstickers, which originated in China and have become a worldwide favourite, came about when a chef let his dumplings boil dry, stick to the pan and crisp up. Make these beauties and they won’t stick around for long.",
    "ingredients": [
      "150g plain flour",
      "100ml boiling waterFor the filling ",
      "150g higher welfare lean pork mince",
      "60g chinese leaf /napa cabbage, shredded and chopped",
      "2 spring onions, finely sliced, plus extra to serve",
      "3 garlic cloves, finely chopped or grated",
      "2 tsp ginger, finely chopped or grated",
      "3 tbsp dark soy sauce",
      "1 tbsp sesame oil",
      "1 tbsp shaoxing rice wine vinegar (or good quality dry sherry)",
      "Toasted sesame seeds to serve (optional)",
      "3 tbsp veg oil for frying",
      "4 tsp cornflour",
      "1 tbsp plain flour",
      "150ml water",
      "2 tbsp rice wine vinegar",
      "½ tsp salt",
      "3 tbsp dark soy sauce",
      "2 tbsp rice wine vinegar or Chinese black rice vinegar",
      "1 tbsp sesame oil",
      "1 tsp brown sugar (optional)",
      "½ tsp sesame seeds"
    ],
    "method": [
      {
        "Step 1": "To make the dumpling dough, put the flour in a large mixing bowl and slowly pour in the boiling water. Use a fork or spatula to mix until dough comes together in clumps, adding more flour or water as needed."
      },
      {
        "Step 2": "Tip the dough out onto a lightly floured surface and knead briefly for about a minute (it will be quite shaggy at this point). Put the dough back into the bowl, cover and leave to rest for 10 minutes. Take the dough back out and knead again until very smooth, about 4-5 minutes. Cover and rest for a further 30 minutes."
      },
      {
        "Step 3": "Roll the rested dough into a sausage about 40cm long. With a very sharp knife, slice the dough sausage into approx 2cm long slices, you should get about 20. Roll each piece into a ball, then roll out to 8-10cm diameter discs. Pop onto a lightly floured baking tray, cover with a clean damp tea towel and set aside while you prepare the filling."
      },
      {
        "Step 4": "Put all the filling ingredients except the sesame seeds and veg oil in a large bowl, season well with salt and white pepper, then mix well to combine."
      },
      {
        "Step 5": "Working with one dumpling wrapper at a time (keeping the rest covered with the clean damp tea towel), lightly brush the edges of the dough with cold water. Put 1-2 tbsp of filling in the middle of the wrapper, then fold over as though to create a half moon shape, but don’t seal the edges. Working from one end, first pinch together the two edges, then make a small pleat in one of the edges and press it to the other side of the wrapper to seal. Keep making a small pleat in one side and pressing to the other to seal all the way along to the end. This will gather the filled wrapper like a pouch and give a row of pleats across the top. Alternatively, simply seal the two edges into a half moon, squeezing out any excess air, and make a few small pleats along the sealed edge. Arrange on the floured baking tray with the crimped edge sticking up (see Make Ahead)."
      },
      {
        "Step 6": "In a small jug, mix together the skirt ingredients, whisking until the mixture is smooth. Heat a large non-stick frying pan with a lid over medium-high heat. Add 3 tbsp vegetable oil and arrange half the dumplings in the pan spaced apart, crimped edge sticking up. Fry in the hot oil for 2-3 minutes until the bottoms are crisp and golden, then add half the skirt mixture and a splash of water. Put the lid on and simmer for 5 minutes. Making sure the dumplings and skirt are crispy and golden before removing from the heat. repeat with the remaining dumplings and skirt mixture."
      },
      {
        "Step 7": "While the dumplings are cooking, whisk all the sauce ingredients in a small bowl. Turn the crispy cooked dumplings out onto a serving plate. Scatter with extra spring onions and toasted sesame seeds. Serve with the dipping sauce alongside."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/8.jpg"
  },
  {
    "id": "9",
    "title": "Hunan-style crispy mushroom noodle salad",
    "difficulty": "Easy",
    "portion": "Serves 2-4 as part of a meal",
    "time": "Hands-on time 30 min, oven time 15 min",
    "description": "Ching-He Huang’s vegan Chinese mushroom noodle salad combines panko-fried shimeji mushrooms, rice noodles and loads of veg for a tasty, healthy meal.",
    "ingredients": [
      "500g shimeji mushrooms, separated (see Know-how)",
      "Pinch ground white pepper",
      "Pinch Chinese five-spice powder",
      "4 tbsp potato flour or cornflour",
      "6 tbsp aquafaba (see tip)",
      "100g panko breadcrumbs (vegan if need be)",
      "6 sprays light olive oil spray",
      "1 tsp rapeseed oil",
      "2.5cm piece fresh ginger, finely grated",
      "4 long dried chillies",
      "1 tbsp tamari or reduced-salt light soy sauce",
      "2 tbsp sweet chilli sauce",
      "Juice and zest 1 large orange",
      "1 romaine/cos lettuce, shredded",
      "½ cucumber, cut into half-moons",
      "1 large carrot, cut into fine matchsticks",
      "200g ready-to-eat vermicelli rice noodles",
      "1 tbsp sesame seeds, toasted",
      "Spring onion curls to serve (see tip)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/gas 6. Lay the mushrooms on a roasting tray and season with a pinch each of salt, white pepper and Chinese five-spice. Put the flour, aquafaba and breadcrumbs in three separate dishes. One at a time, dip each mushroom in the flour, coating well, then in the aquafaba. Finally dip quickly in the breadcrumbs and return to the roasting tray. Spray the mushrooms with olive oil, then roast for 15 minutes until crisp."
      },
      {
        "Step 2": "Meanwhile make the sauce: heat a wok or deep frying pan over a high heat until smoking. Add the oil, then the ginger and stir-fry for a few seconds. Add the chillies, tamari or soy sauce, sweet chilli sauce and orange zest and juice. Bring to the boil and reduce until thickened."
      },
      {
        "Step 3": "Drizzle the sauce over the crispy mushrooms and toss to coat. Arrange the salad ingredients on plates, then add the mushrooms and drizzle over more of the sauce if you like. Sprinkle over the sesame seeds, top with spring onion curls and serve immediately."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/9.jpg"
  },
  {
    "id": "10",
    "title": "Black bean tofu and baby pak choi",
    "difficulty": "Easy",
    "portion": "Serves 2 as a main or 4 as a side",
    "time": "Hands-on time 30 min",
    "description": "Ching-He Huang’s healthy vegan recipe with black bean tofu and baby pak choi is a winner for vegan Chinese New Year celebrations.",
    "ingredients": [
      "1 tbsp cornflour",
      "1 tbsp rapeseed oil",
      "5 garlic cloves, finely chopped",
      "1 tbsp grated fresh ginger",
      "1 red chilli, deseeded and chopped",
      "1 bird’s eye chilli, deseeded and chopped",
      "1 tbsp fermented salted black beans, rinsed and lightly crushed (see Know-how)",
      "1 tbsp yellow bean or miso paste (see Know-how)",
      "250g ready-fried tofu (see tip), quartered",
      "1 tbsp shaohsing rice wine or dry sherry (see Know-how)",
      "2 green peppers, deseeded and cut into 1.5cm chunks",
      "200ml vegetable stock (vegan if it needs to be)",
      "1 tbsp tamari or reduced-salt light soy sauce",
      "Cooked jasmine rice to serve",
      "200g baby pak choi, halved",
      "1 tbsp shaohsing rice wine",
      "1 tbsp tamari or reduced-salt light soy sauce",
      "1 tsp toasted sesame oil",
      "2.5cm piece fresh ginger, sliced into matchsticks",
      "Steamer"
    ],
    "method": [
      {
        "Step 1": "For the pak choi, put a heatproof plate inside a steamer with the pak choi on it. Season with salt, rice wine, tamari/light soy sauce and sesame oil, then lay the ginger slices over the top. Put the lid on the steamer, bring to the boil, then gently steam over a low heat for 3-4 minutes."
      },
      {
        "Step 2": "Meanwhile, in a small jug or cup, mix the cornflour with 2 tbsp water to create a paste. Put a wok or deep frying pan over a high heat and add the rapeseed oil. When it starts to smoke, add the garlic, ginger and chillies and stir-fry for a few seconds, then add the black beans and yellow bean or miso paste and stir quickly."
      },
      {
        "Step 3": "Add the tofu and stir-fry for 1 minute, keeping the ingredients moving in the wok, then add the rice wine or sherry and the peppers and stir-fry for a further minute."
      },
      {
        "Step 4": "Add the stock and bring to the boil. Season with the tamari or soy sauce, then add the cornflour paste and stir to thicken. Serve the tofu alongside the pak choi and jasmine rice."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/10.jpg"
  },
  {
    "id": "11",
    "title": "Hot and sour soup",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min, plus soaking",
    "description": "Ching-He Huang’s healthy vegan hot and sour soup recipe is a wonderful way to kick off Chinese New Year celebrations.",
    "ingredients": [
      "50g dried wood ear mushrooms (see Know-how)",
      "1 tbsp cornflour",
      "1 tbsp rapeseed oil",
      "2.5cm piece fresh ginger, grated",
      "1 red chilli, deseeded and finely chopped",
      "8 cherry tomatoes",
      "3 leaves chinese leaf, finely sliced",
      "1 carrot, sliced into matchsticks",
      "1 daikon, peeled and sliced into matchsticks",
      "225g tin bamboo shoots, rinsed, drained and sliced into matchsticks",
      "1 tbsp vegan bouillon powder",
      "2 tbsp tamari or reduced-salt light soy sauce",
      "2 tbsp clear rice vinegar",
      "1 tbsp toasted sesame oil",
      "200g fresh firm tofu, drained and sliced into matchsticks",
      "200g enoki mushrooms (from large supermarkets), separated into smaller bunches",
      "3 spring onions, trimmed and sliced into matchsticks (see tip)",
      "Small handful fresh coriander, stalks finely sliced and leaves set aside for garnish"
    ],
    "method": [
      {
        "Step 1": "Put the wood ear mushrooms in a bowl. Pour over boiling water and leave to soak for 20 minutes, then drain and slice into matchsticks. In a small bowl, mix the cornflour with 2 tbsp cold water to form a paste."
      },
      {
        "Step 2": "Heat a wok or deep frying pan over a high heat and add the rapeseed oil. Once hot, add the ginger and chilli and stir for a few seconds, then add the whole tomatoes and toss for a few seconds more. Add the chinese leaves, carrot, daikon, bamboo shoots and bouillon powder, then pour over 1 litre water."
      },
      {
        "Step 3": "Bring to the boil, then reduce the heat to medium and simmer for 5 minutes until the chinese leaves are translucent. Add the wood ear mushrooms and cook for 1 minute, then add the tamari/light soy sauce, rice vinegar and sesame oil."
      },
      {
        "Step 4": "Pour in the cornflour paste to thicken the sauce. Stir in the tofu and enoki mushrooms and cook for 1 minute, then add the spring onions and coriander stalks. Season with ground white pepper."
      },
      {
        "Step 5": "Spoon into serving bowls and serve garnished with coriander leaves."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/11.jpg"
  },
  {
    "id": "12",
    "title": "Vegan tofu stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "Donal Skehan’s full-flavoured vegan tofu stir-fry is covered in sweet, sticky, homemade General Tso sauce – a staple of Chinese restaurants in North America. The sauce contains hoisin sauce, which is made from soybeans and spices and is usually vegan – but do check the label for non-vegan artificial colourings if you need to.",
    "ingredients": [
      "280g block extra-firm tofu",
      "2-3 tbsp cornflour",
      "4 tbsp sunflower oil",
      "3 tbsp rice vinegar",
      "3 tbsp reduced salt soy sauce",
      "1 tbsp hoisin sauce (check it’s vegan if necessary)",
      "1 tbsp soft brown sugar",
      "1 tbsp toasted sesame oil",
      "2cm piece fresh ginger, peeled and grated",
      "2 garlic cloves, thinly sliced",
      "1 red chilli, very thinly sliced, plus extra to garnish"
    ],
    "method": [
      {
        "Step 1": "Cut the tofu into 2cm cubes and dry well on kitchen paper. Put half the cornflour in a bowl and add the tofu cubes. Toss to coat, then add the remaining cornflour and toss again. Set aside for 5 minutes to become slightly tacky."
      },
      {
        "Step 2": "Mix together the rice vinegar, soy sauce, hoisin sauce and brown sugar in a bowl, then set aside."
      },
      {
        "Step 3": "Heat the sunflower oil in a wok or frying pan over a high heat and cook the tofu for 1-2 minutes on each side until golden brown. Remove from the pan and set aside to drain on kitchen paper. Drain any excess oil from the wok."
      },
      {
        "Step 4": "Allow the wok to cool a little, then add the sesame oil, ginger, garlic and chilli, then gently fry for about 1 minute before adding the sauce mixture with 150ml water. Bubble until you have a thick, glossy sauce."
      },
      {
        "Step 5": "Return the tofu to the pan and toss to coat all over. Serve with extra chilli, steamed rice and broccoli."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/12.jpg"
  },
  {
    "id": "13",
    "title": "Vegetable and sweet chilli spring rolls",
    "difficulty": "Easy",
    "portion": "Makes 12",
    "time": "Hands-on time 30 min, cooking time 5-10 min",
    "description": "These super-simple sweet chilli spring rolls tick the ‘dirty vegan’ box – even avowed meat eaters will be reaching for more…",
    "ingredients": [
      "6 frozen spring roll pastry sheets",
      "Splash of vegetable oil, plus extra for deep frying",
      "300g bag of prepared fresh stir-fry vegetables",
      "150g firm tofu, crumbled",
      "1 tbsp sweet chilli sauce, plus extra for dipping",
      "2-3 spring onions, shredded",
      "Squeeze of lime juice"
    ],
    "method": [
      {
        "Step 1": "Defrost the pastry sheets. Heat the vegetable oil in a frying pan over a high heat, then add a the stir-fry vegetables and tofu. Fry for 4-5 minutes until the veg have just softened and the tofu is a little golden, then remove from the heat and stir in the sweet chilli sauce until lightly coated. Cool."
      },
      {
        "Step 2": "Working 1 defrosted spring roll sheet at a time, cut each pastry square in half to make 2 rectangles. Brush the pastry edges with cold water, then put a heaped tbsp of fried veg mix about 2.5cm from the long edge of the rectangle. Roll up tightly to halfway, fold in the ends, then roll the rest of the way. Brush the seams with extra water to seal, then repeat with the rest of the sheets and filling."
      },
      {
        "Step 3": "Heat 2cm veg oil in a deep frying pan, then fry the spring rolls for 1-2 minutes on each side until golden and crisp. Allow to cool slightly, then serve topped with the shredded spring onion and lime juice, with sweet chilli sauce for dipping."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/13.jpg"
  },
  {
    "id": "14",
    "title": "Stir-fried beef in black bean sauce",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min",
    "description": "Serve up this speedy beef stir-fry in just 20 minutes! It’s high in protein, bursting with crunchy veg and only requires one pan. For an extra boost of fibre, serve with brown rice if you like.",
    "ingredients": [
      "2 x 200g rump or sirloin steaks",
      "1 tbsp seasoned cornflour",
      "2 tbsp sunflower oil",
      "1 sliced large onion",
      "1 sliced red pepper",
      "200g pack of tenderstem broccoli",
      "2 tbsp fermented black bean sauce (or use roughly 100ml regular black bean sauce)",
      "1 grated thumb-size chunk of fresh ginger",
      "2 crushed fat garlic cloves",
      "1 tbsp rice wine vinegar",
      "3 chopped spring onions",
      "Finely chopped stalks from a large handful of fresh basil",
      "Steamed rice and prawn crackers, to serve"
    ],
    "method": [
      {
        "Step 1": "Trim the steaks and cut into chunky strips, then toss in the cornflour. Heat 2 tbsp sunflower oil in a wok or large frying pan, then stir-fry the strips for 3-4 minutes until browned and caramelised all over. Put on a plate."
      },
      {
        "Step 2": "Add a splash more oil to the wok, if needed, then stir-fry the onion and red pepper for 5 minutes. Add the tenderstem broccoli (cut any large spears in half), then fry for another 3 minutes. Add a splash of water if you think it needs it."
      },
      {
        "Step 3": "Meanwhile, in a bowl, mix the fermented black bean sauce and 3 tbsp water (or use roughly 100ml regular black bean sauce), the fresh ginger, garlic, rice wine vinegar, spring onions and the finely chopped basil stalks."
      },
      {
        "Step 4": "Add the fried steak back into the wok with the sauce mixture and seasoning, then stir-fry until heated through – add 2-3 tbsp water, if needed, to make it rich and saucy. Stir in the fresh basil leaves, then serve with steamed rice and prawn crackers, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/14.jpg"
  },
  {
    "id": "15",
    "title": "Leftover roast lamb stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min",
    "description": "A wonderful way to use up leftover lamb (or any roast meat), try our 20-minute leftover roast lamb stir-fry for a quick and healthy dinner.",
    "ingredients": [
      "4 tbsp chilli sauce with garlic (we used Lingham’s)",
      "4 tbsp soy sauce",
      "Juice 2 limes",
      "1 lemongrass stick, outer leaves discarded and finely chopped",
      "4cm piece fresh ginger, grated",
      "Splash vegetable oil",
      "1 head broccoli, separated into florets, stalk sliced",
      "3 nests dried rice noodles (we used Mama Instant Rice Vermicelli Noodles)",
      "150g cooked leftover roast lamb, sliced (see tip)",
      "20g fresh coriander, chopped"
    ],
    "method": [
      {
        "Step 1": "In a bowl, mix together the chilli and soy sauces, lime juice, lemongrass, ginger and a good grinding of black pepper."
      },
      {
        "Step 2": "Heat a splash of oil in a wok or large frying pan. Add the broccoli, then stir-fry over a high heat until tender and slightly charred."
      },
      {
        "Step 3": "Meanwhile, soak the noodles in a large bowl of boiling water. Drain and run under cold water to stop them sticking."
      },
      {
        "Step 4": "Add the lamb (see tip) to the wok/pan with the broccoli, then stir-fry until hot. Stir in the sauce, then heat through for 1 minute. Add the noodles and toss to coat in the sauce, adding a little water if needed. Serve garnished with chopped coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/15.jpg"
  },
  {
    "id": "16",
    "title": "Caramelised apples with sesame",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 45 min",
    "description": "Ken Hom’s caramelised apples with sesame recipe works wonderfully as part of a sharing feast, and makes the perfect sweet treat to celebrate Chinese New Year.",
    "ingredients": [
      "300ml groundnut oil",
      "2-3 large firm apples, peeled, cored and cut into wedges",
      "40g plain flour",
      "2 tbsp cornflour",
      "1 medium free-range egg,lightly beaten",
      "200g caster sugar",
      "2 tbsp groundnut oil",
      "1 tbsp black sesame seeds",
      "2 tsp white sesame seeds",
      "2 large deep woks or pans; digital probe thermometer; baking tray lined with kitchen paper"
    ],
    "method": [
      {
        "Step 1": "Mix the batter ingredients in a medium bowl until just combined. Set aside for 30 minutes (see tip)."
      },
      {
        "Step 2": "In one of the woks or pans, heat the oil to about 170°C on a digital probe thermometer (a cube of bread should turn golden in about 40 seconds). Drop the apple wedges into the batter and turn to coat. Using a slotted spoon, lift out a few pieces of apple at a time and let any excess batter drop off. Lower into the hot oil and fry for about 2 minutes until golden. Transfer to the prepared tray using a slotted spoon. Keep warm."
      },
      {
        "Step 3": "Fill a bowl with iced water. For the caramel coating, heat the sugar and 2 tablespoons oil in the other wok or pan until the sugar begins to caramelise and turn lightly golden (take care it doesn’t burn). Add the sesame seeds and, once the caramel turns light brown, stir in the apple to coat. Remove with a slotted spoon to the bowl of iced water to harden. Transfer to a platter to serve (see Make Ahead)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/16.jpg"
  },
  {
    "id": "17",
    "title": "Ken Hom’s crispy fish spring rolls",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 40 min",
    "description": "Celebrate Chinese New Year with Ken Hom’s fish spring rolls – they’re deliciously crispy and will leave you fighting for seconds.",
    "ingredients": [
      "3 tbsp sea salt flakes",
      "2 tbsp sichuan peppercorns",
      "450g sustainable skinless white fish fillets, such as cod or sea bass, cut into 2.5cm squares",
      "1 medium free-range egg white",
      "2 tbsp shaoxing rice wine or dry sherry ",
      "3 tbsp chopped spring onions",
      "2 tsp cornflour",
      "2 tsp toasted sesame oil",
      "5cm piece fresh ginger",
      "4 sheets filo pastry, about 30cm x 46cm (see Ken’s tip)",
      "Cornflour for dusting",
      "Vegetable oil for frying ",
      "1 lemon, cut into wedges",
      "Large, deep wok or pan; food processor or blender; digital probe thermometer; baking tray lined with kitchen paper"
    ],
    "method": [
      {
        "Step 1": " To make the salt and pepper dip, heat a wok or large frying pan until hot, then add the salt and sichuan peppercorns. Stir-fry for 1 minute, remove and set aside to cool, then roughly grind with a pestle and mortar for 1 minute and set aside. You won’t need it all, but it lasts for weeks and goes with many things."
      },
      {
        "Step 2": " For the fish paste, mix the fish, egg white, rice wine, spring onions, cornflour and sesame oil in a food processor with a little salt and pepper. Coarsely grate the ginger, then squeeze the juice into the food processor and whizz to a smooth paste. (Use the pulse button or the paste will turn out rubbery.)"
      },
      {
        "Step 3": "Spread out the pieces of filo on a worktop, then divide the fish paste evenly among them in a sausage-like roll, about 25cm long (see Food Team’s tip). Roll up the filo, tucking in the ends as you roll. Repeat until the filo has been used up. Dust with cornflour and shake off any excess (see Make Ahead)."
      },
      {
        "Step 4": "Set the wok or pan over a high heat. When hot, pour in the oil and heat to 180°C on a digital probe thermometer (a cube of bread should turn golden in about 30 seconds). Gently lower in 2 of the fish rolls and cook until golden brown and crisp (about 5 minutes). Carefully remove with a slotted spoon and put on the prepared tray. Fry the remaining rolls. Serve with lemon wedges and the salt and pepper dip."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/17.jpg"
  },
  {
    "id": "18",
    "title": "Stuffed bitter melon with black bean sauce",
    "difficulty": "Medium",
    "portion": "Serves 4-6 as part of a sharing menu",
    "time": "Hands-on time 20 min, steaming time 15-18 min",
    "description": "For something a little bit different, serve up Ken Hom’s pork-stuffed bitter melon with black bean sauce as a starter to celebrate Chinese New Year.",
    "ingredients": [
      "2 large bitter melons (350-450g; see Know-how, or use cucumber)",
      "225g British free-range 10% fat minced pork",
      "2 tsp finely chopped fresh ginger",
      "2 tbsp finely chopped spring onions",
      "2 tbsp shaoxing rice wine or dry sherry",
      "Pinch sugar",
      "1 tbsp light soy sauce",
      "1 tsp toasted sesame oil",
      "1 medium free-range egg,lightly beaten",
      "1 tsp cornflour, plus extrafor dusting",
      "2 tbsp groundnut or vegetable oil",
      "1 tbsp roughly chopped garlic",
      "2 tbsp fermented black bean paste (see Know-how)",
      "1 tbsp shaoxing rice wine or dry sherry",
      "1 tbsp oyster sauce",
      "200ml chicken stock",
      "1 tsp cornflour mixed with 1 tsp cold water",
      "2 tsp toasted sesame oil",
      "Steamer or wok/deep panwith a lid and a rack set inside; lipped heatproof plate that will fit inside"
    ],
    "method": [
      {
        "Step 1": "For the filling, mix all the ingredients in a bowl. Cut the bitter melon (or cucumber) into 2.5cm rounds, discarding the ends. With a small sharp knife, remove and discard the core of pulp and seeds."
      },
      {
        "Step 2": " Lightly dust the insides of the slices with cornflour. Fill each with a generous spoonful of the filling, then arrange on a heatproof plate (one that will fit inside the steamer). See Make Ahead and tip."
      },
      {
        "Step 3": "Set up a steamer (or put a rack in a wok or deep pan) and half fill with water. Bring to the boil over a high heat, then carefully lower in the plate. Turn the heat to low, then cover tightly and steam gently for 15-18 minutes (you may have to do this in two batches)."
      },
      {
        "Step 4": "Meanwhile to make the sauce, heat a wok or large frying pan over a high heat until very hot. Add the oil and, when slightly smoking, add the garlic and black bean paste, then stir-fry for 30 seconds. Add the remaining sauce ingredients, except the cornflour mixture and sesame oil. Simmer, then stir in the cornflour mixture until thickened. Bubble gently for 1 minute. Stir in the sesame oil, transfer the stuffed bitter melon to a serving plate, pour over the sauce and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/18.jpg"
  },
  {
    "id": "19",
    "title": "Ken Hom’s steamed chicken with Chinese sausage",
    "difficulty": "Easy",
    "portion": "Serves 4-6 as part of a sharing menu",
    "time": "Hands-on time 10 min, steaming time 25 min, plus marinating",
    "description": "Ken Hom’s quick and easy steamed chicken dish is designed to be served as part of a sharing menu to celebrate Chinese New Year. Try this dish with Ken’s crispy fish spring rolls and stuffed bitter melon with black bean sauce.",
    "ingredients": [
      "450g free-range skinless boneless chicken thighs, cut into bite-size pieces",
      "1 tbsp light soy sauce",
      "1½ tbsp shaoxing rice wine or dry sherry",
      "1 tsp sugar",
      "1 tsp toasted sesame oil",
      "2 tsp cornflour",
      "4 Chinese pork sausages (about 100g), cut into 1cm slices – see Know-how",
      "Shredded spring onion to garnish",
      "Steamed rice and greens to serve",
      "Steamer or large wok/pan with a lid and a rack set inside; lipped heatproof plate or bowl that will sit inside the steamer"
    ],
    "method": [
      {
        "Step 1": "Stir together the chicken, soy, rice wine, sugar, sesame oil, cornflour and some black pepper in a bowl. Leave to marinate at room temperature for 20 minutes (see Make Ahead)."
      },
      {
        "Step 2": "Transfer to the plate/bowl and mix with the sliced sausages. "
      },
      {
        "Step 3": "Set up a steamer (or put a rack in a large wok or deep pan) and add 5cm of water. Bring to the boil, lower in the dish of chicken/sausages, turn the heat to low, cover and steam for 25 minutes or until cooked through. Serve garnished with shredded spring onions, with steamed rice and greens on the side."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/19.jpg"
  },
  {
    "id": "20",
    "title": "Ken Hom’s chicken on crispy noodles",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 30 min",
    "description": "“A favourite of many dim-sum diners in Hong Kong in which thin, crisp-fried egg noodles are served with shredded chicken and sauce. The texture of the noodles contrasts with the softness of the chicken. In this recipe the chicken is velveted: that is, coated with egg white and cornflour, to keep the meat moist and tender.” Ken Hom",
    "ingredients": [
      "225g boneless, skinless free-range chicken breasts, shredded",
      "1 free-range egg white",
      "2 tsp cornflour",
      "1 tsp salt",
      "½ tsp freshly ground white pepper",
      "225g fresh thin Chinese egg noodles (you could use dried noodles cooked 2 minutes less than the pack instructions)",
      "3 tbsp groundnut or vegetable oil",
      "175g fresh bean sprouts",
      "2 tbsp shaoxing rice wine or dry sherry",
      "2 tbsp oyster sauce",
      "1 tbsp light soy sauce",
      "300ml chicken stock",
      "½ tsp freshly ground black pepper",
      "1 tbsp cornflour mixed with 1½ tbsp water",
      "3 tbsp spring onions, finely chopped, to garnish"
    ],
    "method": [
      {
        "Step 1": "Combine the chicken, egg white, cornflour, salt and white pepper in a small bowl. Mix well, cover and chill in the refrigerator for at least 20 minutes."
      },
      {
        "Step 2": "Meanwhile, blanch the noodles for 2 minutes in a large pot of salted boiling water, then drain well."
      },
      {
        "Step 3": "Heat a non-stick frying pan and, when hot, add 1½ tablespoons of the oil. Evenly spread the blanched noodles over base of the pan, turn the heat to low and allow the noodles to brown slowly (this should take about 5 minutes or so). When the noodles are brown on one side, gently flip them over using a fish slice and brown the other side, adding more oil if needed. When both sides are browned, transfer the noodles to a serving plate and keep warm."
      },
      {
        "Step 4": "When the chicken is ready, bring 300ml water to a boil in a saucepan. Remove the saucepan from the heat and immediately add the chicken pieces, stirring vigorously with a chopstick to keep them from sticking together. When the chicken pieces turn white, after about 2 minutes, quickly drain the chicken (discard the cooking water)."
      },
      {
        "Step 5": "Heat a wok over a high heat. When hot, add the bean sprouts, then the rice wine, oyster sauce, soy sauce, chicken stock, black pepper and salt to taste. Bring the mixture to a boil, add the cornflour mixture and bring it to a simmer again. Return the chicken to the sauce and give everything a few stirs. Taste, adjust the seasoning if needed, then pour the chicken and sauce over the noodles. Garnish with the spring onions and serve straightaway."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/20.jpg"
  },
  {
    "id": "21",
    "title": "Speedy chilli turkey stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min",
    "description": "A speedy one-pan which packs a punch, this turkey stir-fry is a fail-safe option for a quick, easy-to-make midweek dinner.",
    "ingredients": [
      "A splash of oil",
      "500g British free-range turkey thigh mince",
      "1 grated carrot",
      "200g tenderstem broccoli",
      "1 chopped garlic clove",
      "2cm piece fresh ginger, finely chopped",
      "½ chopped red chilli",
      "40g chilli jam/sweet chilli sauce",
      "1 tbsp soy sauce",
      "sesame seeds",
      "sliced spring onions",
      "fresh coriander",
      "lime wedges, to serve",
      "Basmati rice or baked potatoes"
    ],
    "method": [
      {
        "Step 1": "Heat a splash of oil in a large frying pan or wok over a high heat. Add 500g British free-range turkey thigh mince and cook, stirring, for 4-5 minutes until beginning to brown."
      },
      {
        "Step 2": "Add 1 grated carrot and 200g tenderstem broccoli to the pan/wok and cook for 3 minutes more."
      },
      {
        "Step 3": "Stir in 1 chopped garlic clove, 2cm piece fresh ginger, finely chopped, and ½ chopped red chilli, then cook for a minute more. Add 40g chilli jam/sweet chilli sauce to the wok/pan with 1 tbsp soy sauce, then fry for 4 minutes more until the mince is starting to brown and crisp."
      },
      {
        "Step 4": "Scatter with sesame seeds, sliced spring onions and fresh coriander. Serve with lime wedges and basmati rice or baked potatoes. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/21.jpg"
  },
  {
    "id": "22",
    "title": "Kung pao cauliflower",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 10 min, oven time 25 min",
    "description": "A spicy Chinese favourite gets a low-cal veggie makeover, with less than 250 calories per portion. The sauce also works well with tofu, or opt for sliced chicken breast for a meatier version.",
    "ingredients": [
      "A few sprays Frylight Vegetable Oil (from large supermarkets)",
      "1 small cauliflower, trimmed and cut into 1.5cm thick slices",
      "½-1 tsp sichuan peppercorns (from large supermarkets), roughly crushed in a mortar and pestle",
      "2 garlic cloves, crushed",
      "3cm piece fresh ginger ",
      "2 spring onions, white and green parts sliced separately ",
      "2-3 dried red chillies (optional)",
      "1 tbsp tamari (check it’s gluten-free, if necessary)",
      "2 tbsp sweet chilli sauce",
      "1 red chilli, sliced",
      "50g roasted unsalted peanuts ",
      "Pinch toasted sesame seeds",
      "Fresh coriander leaves to serve"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 220°C/200°C fan/gas 7. Spray a little oil on the base of a baking tray, add the cauliflower slices and spray again with oil. Roast for 20 minutes."
      },
      {
        "Step 2": "Meanwhile, mix the peppercorns, garlic, ginger, white parts of the spring onion, dried chillies (if using), tamari and chilli sauce in a small bowl (see Make Ahead)."
      },
      {
        "Step 3": "After the 20 minutes’ cooking time, pour the dressing over the cauliflower and return to the oven for 5-6 minutes. Scatter over the remaining ingredients to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/22.jpg"
  },
  {
    "id": "23",
    "title": "Spicy prawn toasts",
    "difficulty": "Easy",
    "portion": "Serves 6-8",
    "time": "Hands-on time 35 min ",
    "description": "We’ve added a spicy zing to prawn toast by adding kimchi. Serve as a starter or cut into small triangles and arrange as canapés for a party.",
    "ingredients": [
      "\u00074 spring onions",
      "1 red chilli",
      "\u0007250g sustainable peeled raw king prawns",
      "75g cabbage and carrot kimchi, or similar",
      "1 tsp soy sauce",
      "\u00071 large free-range egg white",
      "6 slices white bread (see tip)",
      "\u000760g sesame seeds",
      "Vegetable oil for frying",
      "\u0007Few sprigs fresh coriander, leaves picked (optional)"
    ],
    "method": [
      {
        "Step 1": "Trim the spring onions and slice into long thin strips. Halve, deseed and slice the chilli into similar-size strips. Put them both in iced water, then set aside."
      },
      {
        "Step 2": "Put the prawns in a food processor with the kimchi and soy sauce. Pulse to a rough paste, then pulse in the egg white (or do this by hand, chopping it all together on a board, then mixing in a bowl)."
      },
      {
        "Step 3": "Divide the mixture equally among the 6 slices of bread and spread as close to the edges as possible. Cut each piece diagonally into 4 triangles. Sprinkle over the sesame seeds and press them on with your fingers."
      },
      {
        "Step 4": "Pour enough oil into a large frying pan or wide saucepan to fill to about 2cm deep. Put on a medium heat. When the oil is hot enough to sizzle when a small cube of bread is added and turns it golden in 30-40 seconds, you’re ready to fry. Gently lower in the prawn toasts in batches, bread-side down, then fry for 3 minutes or until golden. Carefully turn over and cook prawn-side down for 2 minutes more or until brown and cooked through. Transfer to kitchen paper to drain."
      },
      {
        "Step 5": "Drain the spring onions and chilli and pat dry on kitchen paper, then toss with the coriander. Serve the hot prawn toasts sprinkled with the spring onion mixture."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/23.jpg"
  },
  {
    "id": "24",
    "title": "Bang bang tofu salad",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "This fill-you-up salad is gluten-free, vegan and jam-packed with tasty Asian flavours. The bang bang sauce is made with peanut butter, sweet chilli and sesame oil – you’ll go nutty for it.",
    "ingredients": [
      "1 thinly sliced red onion",
      "3 tbsp red wine vinegar",
      "A pinch each of caster sugar and salt",
      "170g sushi rice",
      "300g tenderstem broccoli",
      "1 tbsp vegetable oil",
      " 2 x 225g blocks of extra-firm smoked tofu (we like The Tofoo Co, from Waitrose, Tesco and Co-op)",
      " 50g smooth peanut butter",
      "25g gluten-free sweet chilli sauce",
      "1 tbsp toasted sesame oil",
      "1 tbsp tamari soy sauce",
      "2 tsp rice vinegar",
      "1 tsp mirin",
      "1 tsp black sesame seeds",
      "Pinch of chilli flakes, to serve"
    ],
    "method": [
      {
        "Step 1": "Put the red onion in a small bowl with the red wine vinegar and a pinch each of caster sugar and salt. Set aside for 30 minutes. Meanwhile, cook the sushi rice according to the pack instructions. Bring a pan of water to the boil and cook the tenderstem broccoli for 3 minutes, then drain and refresh in a bowl of iced water."
      },
      {
        "Step 2": "Heat the vegetable oil in a large frying pan over a medium-high heat. Pat dry the tofu, then fry for 3-4 minutes on each side until lightly golden and crisp. Slice into finger-thick strips."
      },
      {
        "Step 3": "Make the bang bang sauce by mixing together the peanut butter, sweet chilli sauce, sesame oil and tamari soy sauce. Taste and adjust the seasoning with a pinch of chilli flakes or some extra tamari and loosen with a splash of water, if needed."
      },
      {
        "Step 4": "Mix together the rice vinegar and mirin, then stir gently into the cooked rice along with a pinch of salt. Spread the rice over a platter, then top with the cooked broccoli and sliced fried tofu. Drain the red onion and add it to the platter. Drizzle with the peanut sauce, then sprinkle with 1 tsp black sesame seeds and a pinch of chilli flakes."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/24.jpg"
  },
  {
    "id": "25",
    "title": "Baked venison puffs",
    "difficulty": "Easy",
    "portion": "Makes 25-30",
    "time": "Hands-on time 1 hour 20 min, oven time 12-15 min, plus at least 4 hours marinating, chilling and resting ",
    "description": "These venison pastry puffs, unique to Yauatcha restaurant, are inspired by Asian culinary techniques but have a European twist – venison replaces the traditional pork filling. The meat is marinated in black pepper and char siu barbecue sauce, then wrapped in puff pastry, topped with sesame seeds and baked. The final flavour and texture are superb.",
    "ingredients": [
      "\u0007300g venison leg or shoulder, trimmed and cut into 0.5cm pieces",
      "½ tbsp caster sugar",
      "¼ tsp freshly ground black pepper",
      "Pinch white pepper",
      "90ml vegetable oil",
      "\u0007½ small onion, very finely chopped",
      "3½ tbsp vegetable oil",
      "1 shallot, finely sliced into rings",
      "Olive oil for frying",
      "Knob of butter",
      "½ small onion, finely chopped",
      "40g ginger, finely chopped",
      "1 large shallot, finely chopped",
      "6 spring onions, finely chopped",
      "½ tbsp light soy sauce",
      "½ tbsp dark soy sauce",
      "4 tbsp oyster sauce",
      "115g caster sugar",
      "25g cornflour",
      "25g potato starch",
      "325g strong white bread flour, plus extra for dusting",
      "30g unsweetened custard powder (see tips)",
      "15g caster sugar",
      "3½ tbsp vegetable oil",
      "315g strong white bread flour, plus extra for dusting",
      "250g salted butter at room temperature (but not soft)",
      "\u0007250g unsalted butter at room temperature (but not soft)",
      "½ tsp vanilla essence",
      "2 medium free-range egg yolks",
      "75ml golden syrup",
      "1-2 tbsp sesame seeds",
      "8cm plain or fluted round pastry cutter"
    ],
    "method": [
      {
        "Step 1": "For the shallot oil, heat the 3½ tbsp vegetable oil in a wok or a saucepan over a low-medium heat. Add the shallot and cook for 5-6 minutes until golden. Strain through a sieve into a jug, discarding the shallot (or see Chef Tong’s tips, below), then set aside to cool."
      },
      {
        "Step 2": "Put the venison in a bowl with the sugar, 1 tbsp of the shallot oil, the black pepper, white pepper and a generous pinch of salt. Cover with cling film and leave to marinate in the fridge for at least 4 hours (12 hours is best if you have time)."
      },
      {
        "Step 3": "Heat the 90ml vegetable oil in a frying pan over a high heat, add the onion and cook for 3 minutes until just starting to soften, then add the marinated venison and cook for 5-6 minutes more. Remove from the heat, scoop out the venison and onion using a slotted spoon, then put in a bowl lined with kitchen paper."
      },
      {
        "Step 4": "For the barbecue sauce, heat a drizzle of olive oil and a knob of butter in a large frying pan over a medium-high heat. Add the onion, ginger, shallot and spring onions, then cook for 4-5 minutes until golden. Remove from the heat. Mix both soy sauces, oyster sauce and 250ml water in a jug, then pour into the pan, return to the heat and bring to the boil. Bubble to reduce by about a third, then stir in the 115g sugar."
      },
      {
        "Step 5": "Add the venison to the sauce and simmer for 4-5 minutes. Meanwhile, mix the cornflour and potato starch with 65ml cold water to form a paste. Slowly pour the starch mixture into the sauce, stirring all the time, until thick and glossy, then remove from the heat, season with salt and pepper and set aside to cool (see Make Ahead).<img decoding=\"async\" class=\"alignnone size-full wp-image-35534\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/A-glossy-venison-stew.jpg\" alt=\"glossy venison stew\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/A-glossy-venison-stew.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/A-glossy-venison-stew-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/A-glossy-venison-stew-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/A-glossy-venison-stew-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/A-glossy-venison-stew-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/A-glossy-venison-stew-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 6": "To make the basic dough, mix the 325g flour, custard powder (see food team’s tips), caster sugar and vegetable oil in a large bowl, then pour in 125ml cold water. Mix to form a soft dough, adding a little extra water if needed. Wrap in cling film and chill for 30 minutes."
      },
      {
        "Step 7": "Once the dough has rested, turn out onto a lightly floured surface, knead gently, then shape into a thick 15cm x 25cm rectangle and set aside to come to room temperature while you make the butter dough (see Chef Tong’s tips)."
      },
      {
        "Step 8": "To make the butter dough, put the 315g flour in large bowl, add the butters and rub them in using your fingers to make a ragged dough.<img decoding=\"async\" class=\"alignnone size-full wp-image-35529\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/B-ragged-dough.jpg\" alt=\"ragged dough \" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/B-ragged-dough.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/B-ragged-dough-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/B-ragged-dough-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/B-ragged-dough-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/B-ragged-dough-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/B-ragged-dough-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 9": "Add the vanilla and rub in, then bring the dough together into a ball."
      },
      {
        "Step 10": "Turn out the butter dough onto a lightly floured surface and roll to make a fat sausage shape. Fold the right-hand side into the centre, then fold in the left side.<img decoding=\"async\" class=\"alignnone size-full wp-image-35540\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/C-sausage-pastry.jpg\" alt=\"sausage of pastry\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/C-sausage-pastry.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/C-sausage-pastry-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/C-sausage-pastry-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/C-sausage-pastry-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/C-sausage-pastry-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/C-sausage-pastry-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 11": "Roll into a rectangle about 30cm x 35cm.<img decoding=\"async\" class=\"alignnone size-full wp-image-35539\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/D-rolling-pastry.jpg\" alt=\"Rolling pastry\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/D-rolling-pastry.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/D-rolling-pastry-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/D-rolling-pastry-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/D-rolling-pastry-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/D-rolling-pastry-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/D-rolling-pastry-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 12": "Put the basic dough on one half of the butter dough rectangle.<img decoding=\"async\" class=\"alignnone size-full wp-image-35538\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/E-butter-dough-.jpg\" alt=\"butter dough\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/E-butter-dough-.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/E-butter-dough--150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/E-butter-dough--300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/E-butter-dough--100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/E-butter-dough--25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/E-butter-dough--54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 13": "Then fold the butter dough over to encase the basic dough. Press down and seal the edges around the dough, keeping them straight and even. Cover with cling film and chill for 20 minutes.<img decoding=\"async\" class=\"alignnone size-full wp-image-35537\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/F-press-down-dough.jpg\" alt=\"press down dough\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/F-press-down-dough.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/F-press-down-dough-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/F-press-down-dough-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/F-press-down-dough-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/F-press-down-dough-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/F-press-down-dough-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 14": "Lightly flour the work surface and gently bash the dough with a rolling pin to soften it. Roll out to about 20cm x 50cm (with the long edge nearest you) and fold the left third to the centre, then the right third over that. Give the dough a quarter-turn (to the left or right) and roll out again, away from you, to three times the length.<img decoding=\"async\" class=\"alignnone size-full wp-image-35536\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/G-roll-pastry.jpg\" alt=\"Roll pastry\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/G-roll-pastry.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/G-roll-pastry-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/G-roll-pastry-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/G-roll-pastry-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/G-roll-pastry-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/G-roll-pastry-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 15": "Give the dough a quarter turn (same direction) and fold as before.<img decoding=\"async\" class=\"alignnone size-full wp-image-35535\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/H-book-fold-pastry.jpg\" alt=\"book fold pastry\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/H-book-fold-pastry.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/H-book-fold-pastry-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/H-book-fold-pastry-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/H-book-fold-pastry-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/H-book-fold-pastry-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/H-book-fold-pastry-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 16": "Cover with cling film and chill for at least 20 minutes. Repeat the rolling, folding and chilling twice more, then chill again."
      },
      {
        "Step 17": "Heat the oven to 220°C/200°C fan/gas 7. Once rested, roll out the dough to 0.5mm thick (you may need to halve the dough and work in batches, depending on the size of your work surface). Stamp out 25-30 x 8cm discs with the cutter.<img decoding=\"async\" class=\"alignnone size-full wp-image-35533\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/I-pastry-discs.jpg\" alt=\"pastry discs\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/I-pastry-discs.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/I-pastry-discs-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/I-pastry-discs-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/I-pastry-discs-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/I-pastry-discs-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/I-pastry-discs-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 18": "Take a disc and gently stretch it a little, keeping the round shape. Hold it in your palm and put 1-2 tsp filling in the centre. Use both hands to bring the edges together to make a 3-cornered star.<img decoding=\"async\" class=\"alignnone size-full wp-image-35532\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/J-3-cornered-star-pastry.jpg\" alt=\"three cornered star pastry\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/J-3-cornered-star-pastry.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/J-3-cornered-star-pastry-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/J-3-cornered-star-pastry-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/J-3-cornered-star-pastry-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/J-3-cornered-star-pastry-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/J-3-cornered-star-pastry-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 19": "Then pinch the edges together to seal. Fold each point back on itself towards the centre, then pinch to seal again and turn the ends of each point clockwise to give a rounded shape. Turn upside-down and push down gently to tidy. Repeat with the rest of the dough and filling. Put the puffs, folds underneath, on a baking tray lined with nonstick baking paper.<img decoding=\"async\" class=\"alignnone size-full wp-image-35531\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/K-seal-pastry.jpg\" alt=\"seal pastry\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/K-seal-pastry.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/K-seal-pastry-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/K-seal-pastry-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/K-seal-pastry-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/K-seal-pastry-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/K-seal-pastry-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 20": "Whisk the egg yolks and brush over the puffs.<img decoding=\"async\" class=\"alignnone size-full wp-image-35530\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/L-glaze-pastry.jpg\" alt=\"egg wash pastry\" width=\"600\" height=\"600\" srcset=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/L-glaze-pastry.jpg 600w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/L-glaze-pastry-150x150.jpg 150w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/L-glaze-pastry-300x300.jpg 300w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/L-glaze-pastry-100x100.jpg 100w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/L-glaze-pastry-25x25.jpg 25w, https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/06/L-glaze-pastry-54x54.jpg 54w\" sizes=\"(max-width: 600px) 100vw, 600px\" />"
      },
      {
        "Step 21": "Set aside for 5 minutes, then brush again. Bake for 12-15 minutes until golden and puffed. While still hot, brush each with a little golden syrup, sprinkle over the sesame seeds and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/25.jpg"
  },
  {
    "id": "26",
    "title": "Fragrant maple pineapple with coconut ice cream",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min",
    "description": "Ching-He Huang’s quick and easy Chinese-inspired dessert recipe, made with pineapple and ginger biscuits, is ready in just 15 minutes.",
    "ingredients": [
      "1 small pineapple, peeled, cored and sliced into 1cm rounds, then cut into fan-shaped thirds",
      "Pinch ground cinnamon",
      "3 tbsp good-quality Canadian maple syrup",
      "½ lemongrass stick, finely grated",
      "8 ginger biscuits",
      "1 large pink grapefruit or pink pomelo, cut into segments",
      "250g-300g coconut ice cream (we like The Coconut Collaborative Coconut & Vanilla Snowconut frozen yogurt, from Ocado)",
      "Edible gold leaf to garnish (available from large supermarkets)",
      "Handful edible flowers (optional)"
    ],
    "method": [
      {
        "Step 1": "Put the ginger biscuits in a food processor and whizz to make crumbs (or put in a food bag and bash with a rolling pin)."
      },
      {
        "Step 2": "Set a wok over a medium heat. When hot, add the pineapple pieces, cinnamon and maple syrup, then cook, tossing, for 2-3 minutesuntil caramelised and tender.Add the lemongrass at the end and keep warm over a very low heat."
      },
      {
        "Step 3": "Divide the ginger biscuit crumb equally among four bowls, then arrange the pineapple and grapefruit or pomelo slices on top. Add a scoop of ice cream to each, then garnish with the gold leaf and edible flowers, if using."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/26.jpg"
  },
  {
    "id": "27",
    "title": "Sweet and smoky red-cooked cod (hong sao yu)",
    "difficulty": "Easy",
    "portion": "Serves 4, as part of a feast",
    "time": "Hands-on time 20 min ",
    "description": "Ching-He Huang‘s quick Chinese fish recipe, made with cinnamon, star anise, sichuan peppercorns and soy, is best served with jasmine rice.",
    "ingredients": [
      "500g sustainably sourced skinless cod loin fillet, cut into 2-3 inch chunks (look for Norwegian MSC-certified fish)",
      "1 tbsp shaoxing rice wine or dry sherry",
      "3 tbsp rapeseed oil",
      "2-3 tbsp potato flour (or plain flour)",
      "2.5cm piece fresh ginger, sliced into rounds",
      "1 cinnamon stick",
      "1 star anise",
      "1 tsp sichuan peppercorns",
      "3 tbsp premium reduced-sodium light soy sauce",
      "2 tsp premium dark soy sauce",
      "1 tbsp chinkiang black rice vinegar or balsamic vinegar (see know how)",
      "3 tbsp soft brown sugar",
      "Micro shiso leaves (from Asian supermarkets) or micro herb Asian salad mix (we used Growing Underground, available from Ocado)",
      "Steamed jasmine rice",
      "Steamed pak choi"
    ],
    "method": [
      {
        "Step 1": "Mix the sauce ingredients in a jug with 300ml water, whisking well to dissolve the sugar. Pour into a small pan, then simmer over a medium-high heat until reduced by half."
      },
      {
        "Step 2": "Put the fish in a bowl with the shaoxing rice wine or sherry. Set aside for a few minutes."
      },
      {
        "Step 3": "Drain the fish, then season with a pinch each of salt and ground white pepper. Heat the rapeseed oil in a wok over a high heat. Put the potato flour on a large plate, then coat the fish pieces in the flour. Carefully drop the coated fish into the oil and fry for a few minutes until the flesh has turned an opaque white colour."
      },
      {
        "Step 4": "Meanwhile, strain the sauce into a separate small pan and bring back to a simmer, but don’t discard what’s left in the sieve."
      },
      {
        "Step 5": "Warm a serving bowl and gently transfer the fish to it. Pour over the hot strained sauce, then sprinkle over some of the remaining spices from the sieve. Serve topped with shiso leaves or herbs, with rice and pak choi alongside."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/27.jpg"
  },
  {
    "id": "28",
    "title": "Noodles in a spinach and garlic sauce",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min ",
    "description": "Ching-He Huang‘s gorgeous noodle recipe is ready in just 20 minutes but packs a punch of flavour.",
    "ingredients": [
      "400g dried longevity noodles or egg noodles (see tip)",
      "3 tbsp toasted sesame oil",
      "2 spring onions, finely chopped",
      "1 tbsp sesame seeds",
      "2 tbsp rapeseed oil",
      "3 garlic cloves, crushed",
      "2 red chillies, deseeded and finely chopped",
      "1 large bunch fresh coriander, roughly chopped",
      "2 large handfuls spinach",
      "200ml vegetable stock",
      "3 tbsp premium reduced-sodium light soy sauce",
      "Ground white pepper",
      "1 tsp cornflour mixed with",
      "1 tbsp water"
    ],
    "method": [
      {
        "Step 1": "For the sauce, heat the rapeseed oil in a wok or pan over a high heat. Add the garlic and chillies, then fry for a few seconds to release their aroma. Add the coriander and spinach, then cook for a few minutes to wilt. Pour in the stock and soy sauce, then bring to the boil. Add a large pinch of ground white pepper and the cornflour mixture to the pan, then cook for a further minute to thicken slightly. Pour the sauce into a blender or food processor and blend until smooth. Return it to the pan, season to taste, then keep warm over a low heat."
      },
      {
        "Step 2": "Bring a large pan of water to the boil, add the noodles and cook for 2-3 minutes until al dente. Quickly drain and refresh under cold water, then drain well. Put back in the pan and season with the toasted sesame oil, tossing to coat the noodles well."
      },
      {
        "Step 3": "Divide the noodles among 4 bowls or put in the middle of a large platter. Pour the sauce around them and sprinkle over chopped spring onions and sesame seeds to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/28.jpg"
  },
  {
    "id": "29",
    "title": "Pork, celery and water chestnut wontons with ma la chilli oil",
    "difficulty": "Medium",
    "portion": "Makes about 36 (you’ll need 16 to serve 4)",
    "time": "Hands-on time 1 hour",
    "description": "This recipe was created by Ching-He Huang as part of a traditional Chinese New Year menu. She’s filled wonton wrappers with a fabulously tasty pork and water chestnut filling and drizzled them in a homemade ma la chilli oil. Divine.",
    "ingredients": [
      "1 medium free-range egg, beaten (plus another, beaten, to seal)",
      "300g minced British free-range pork belly (if you’re buying pre-packed, look for mince with a higher fat content)",
      "50g celery, finely chopped",
      "50g tinned water chestnuts, drained and finely chopped",
      "2 spring onions, finely chopped",
      "2 tbsp freshly grated ginger",
      "2 tbsp premium reduced-sodium light soy sauce",
      "2 tsp shaoxing rice wine or dry sherry",
      "2 tsp cornflour",
      "2 tsp toasted sesame oil",
      "Pinch ground white pepper",
      "36 wonton egg wrappers (7.5cm squares; available from Asian supermarkets or online at theasiancookshop.co.uk)",
      "5 tbsp rapeseed oil",
      "1 tbsp chilli flakes",
      "1 tsp sichuan peppercorns, toasted in a dry pan and ground",
      "1 tbsp chinkiang black rice vinegar",
      "1 tbsp premium reduced-sodium light soy sauce",
      "1 tsp toasted sesame oil",
      "1 spring onion, finely sliced",
      "1 small handful of coriander, roughly chopped"
    ],
    "method": [
      {
        "Step 1": "For the chilli oil, heat the rapeseed oil in a wok or small pan over a medium heat. Add the chilli flakes and the sichuan pepper and stir to combine. Cook over a medium heat for 1-2 minutes, being careful not to let the chilli flakes burn. Pour into a heatproof bowl. Stir in the black rice vinegar, soy sauce, sesame oil and a pinch of fine salt, then set aside to cool (see Make Ahead)."
      },
      {
        "Step 2": "In a large bowl, mix together all the ingredients for the dumpling filling except the wrappers and the beaten egg to seal (see food team’s tips)."
      },
      {
        "Step 3": "To make the wontons, lay out the wrappers in batches on a clean work surface. Put roughly 1½ tsp filling in the middle of each. Brush the edges of the wrapper with a little beaten egg, then gather them up and mould around the filling into a ball shape, twisting at the top to secure the dumpling. Repeat with the remaining wrappers. Set aside 4 wontons per person and freeze any unused dumplings (see Make Ahead)."
      },
      {
        "Step 4": "Bring a large, wide pan of water to the boil, then turn the heat down to a simmer. Using a slotted spoon, gently lower in the dumplings in batches and simmer gently for 4-5 minutes or until they float to the surface and turn a translucent yellow (see Ching’s tip). Cut a dumpling open to check the fillingis cooked. Using the slotted spoon, transfer the dumplings to a serving platter or 4 individual bowls. Spoon over a little dumpling cooking water to stop them drying out, then drizzle over a little chilli oil (see food team’s tips). Garnish with the spring onions and coriander and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/29.jpg"
  },
  {
    "id": "30",
    "title": "Wok-fried fragrant scallops",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min",
    "description": "Ching-He Huang created this dish for a traditional Chinese New Year menu. It’s an elegant starter of pan-fried scallops dressed in sesame, soy and chilli served with crisp watercress. If you like, serve the scallops in their pretty shells to add extra wow-factor.",
    "ingredients": [
      "1 tbsp rapeseed oil, plus extra for frying",
      "A few sichuan peppercorns, toasted in a dry pan and ground in a pestle and mortar, to taste",
      "1 small cayenne chilli, deseeded and finely chopped (see tip)",
      "1 tbsp shaoxing rice wine or dry sherry",
      "Ground white pepper",
      "8 hand-dived king scallops",
      "200g watercress, trimmed",
      "Squeeze lemon juice",
      "Drizzle olive oil",
      "2 garlic cloves, crushed",
      "2.5cm piece fresh ginger, finely grated",
      "4 tbsp premium dark soy sauce",
      "4 tbsp rice vinegar (available from supermarkets)",
      "2 tbsp toasted sesame oil",
      "1 spring onion, finely sliced",
      "1 red chilli, deseeded and finely chopped",
      "Small handful fresh coriander, finely chopped"
    ],
    "method": [
      {
        "Step 1": " Mix all the dressing ingredients together in a small bowl (see Make Ahead), then taste and adjust the seasoning as needed. Set aside."
      },
      {
        "Step 2": "In another small bowl, mix the oil, ground sichuan pepper, cayenne and rice wine with 4 pinches each of salt and ground white pepper."
      },
      {
        "Step 3": "Heat a drizzle of rapeseed oil in a large frying pan over a medium-high heat, then add the scallops and cook for 2 minutes. Carefully turn them over (in the order in which you put them in the pan), then pour in the sichuan mixture and continue frying until just cooked through (about 2 more minutes, or to your liking)."
      },
      {
        "Step 4": "In a medium bowl, toss together the watercress, lemon juice and olive oil. Divide among 4 plates, top with the scallops and cooking juices from the pan, then drizzle with the dressing. Serve straightaway."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/30.jpg"
  },
  {
    "id": "31",
    "title": "Ginger chicken congee (rice porridge) with kimchi",
    "difficulty": "Medium",
    "portion": "Serves 6-8",
    "time": "Hands-on time 25 min, simmering time 1 hour 45 min, plus up to 2 days pickling",
    "description": "Congee is a type of rice porridge enjoyed, often for breakfast, in many Asian countries. Here, Georgina Hayden has created a savoury version and topped it with chicken, kimchi, pickled ginger and greens. It’s a really nourishing dish that could be served as a starter or main at a dinner party.",
    "ingredients": [
      "1.4kg free-range whole chicken",
      "2 onions, roughly chopped",
      "2 carrots, roughly chopped",
      "2 celery sticks, roughly chopped",
      "A few peppercorns",
      "350g long grain rice",
      "150g cavolo nero or kale, sliced",
      "2 tbsp rice vinegar",
      "80g kimchi (from Tesco, Ocado and online), chopped",
      "4 spring onions, finely sliced",
      "2 tbsp toasted sesame seeds",
      "Chilli oil (optional)",
      "125g fresh ginger",
      "120ml rice vinegar",
      "80g granulated sugar",
      "1 tsp fine sea salt",
      "Mandoline or vegetable peeler; small, clean glass jar"
    ],
    "method": [
      {
        "Step 1": "Get a 3cm piece of ginger aside for the chicken poaching stock. For the pickled ginger, peel and finely slice the rest lengthways with a mandoline or veg peeler. Pack the slices into the jar. Pour the vinegar into a small pan, then add the sugar, salt and 2 tbsp cold water. Bring to the boil, then immediately pour over the ginger. Seal, leave to cool, then chill (see Make Ahead)."
      },
      {
        "Step 2": "Put the chicken in a large pan or flameproof casserole with a lid. Finely slice the 3cm piece of ginger and add to the pan with the onions, carrots, celery and peppercorns, then add cold water to cover. Put on a high heat and bring to the boil, then turn the heat to low. Cover with the lid and simmer gently for 1 hour, topping up the water if needed so the chicken is always covered."
      },
      {
        "Step 3": "Remove the chicken from the pan, put on a tray and cover with foil. (Check it’s ready by pushing a skewer into the thickest part of the thigh. If the juices run clear it’s cooked, if not, return it to the pan until cooked.) Strain the stock, then put it back into the pan (discard the veg). You’ll need around 3 litres of stock, so top up with boiling water if need be."
      },
      {
        "Step 4": "Rinse the rice in a sieve or colander until the water runs clear. Stir into the stock and bring to the boil over a high heat. As soon as it boils, reduce to a simmer and cook slowly for 45-60 minutes. Stir often until the rice is creamy, adding a splash more water if needed. It should be oozy. Put the cavolo nero/kale on top of the congee (don’t stir it in) for the final 10 minutes of the cooking time so it steams gently."
      },
      {
        "Step 5": "While the congee is cooking, strip all the chicken meat from the carcass and shred."
      },
      {
        "Step 6": "Transfer the steamed greens to a warm bowl. Season the congee with salt to taste, then stir in the 2 tbsp vinegar. Serve topped with the shredded chicken, kimchi, spring onions, sesame seeds, pickled ginger, steamed greens and a little chilli oil, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/31.jpg"
  },
  {
    "id": "32",
    "title": "Chicken, ginger and oyster sauce stir fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min",
    "description": "This tasty chicken stir-fry with ginger and oyster sauce is easy to make and can be on the table in just 15 minutes – a great quick midweek fix.",
    "ingredients": [
      "Splash vegetable oil for frying",
      "4 free-range skinless boneless chicken thighs, cut into chunks",
      "Thumb-size piece fresh ginger, grated",
      "2 garlic cloves, crushed",
      "2 tbsp soy sauce",
      "2 tbsp oyster sauce",
      "Juice 1 lemon",
      "1 tbsp toasted sesame oil",
      "2 x 200g packs rainbow stir fry (see tip) ",
      "50g cashews, lightly toasted in a dry pan",
      "Cooked rice to serve"
    ],
    "method": [
      {
        "Step 1": " Heat a splash of oil in a large wok or large, deep frying pan. Stir-fry the chicken for 3-4 minutes or until cooked through. "
      },
      {
        "Step 2": " Meanwhile, in a small bowl, whisk together the ginger, garlic, soy and oyster sauces, the lemon juice and sesame oil. "
      },
      {
        "Step 3": " Add the stir-fry packs to the wok and stir-fry over a medium-high heat for a few minutes until wilted. Add the sauce and a splash of water and toss to warm through. Add the cashews, then serve with the rice."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/32.jpg"
  },
  {
    "id": "33",
    "title": "Sticky sesame and soy chicken traybake",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min, oven time 35-40 min",
    "description": "None of the fuss but all of the flavour is what you get from this sticky sesame and soy chicken traybake. Just combine all the ingredients, pour over the chicken and pop in the oven until caramelised.",
    "ingredients": [
      "4 chicken legs, skin-on",
      "3 tbsp dark soy sauce",
      "1 large star anise, crushed",
      "3cm piece fresh ginger, grated",
      "1 tbsp toasted sesame oil",
      "2 tsp honey",
      "2 oranges, 1 sliced, 1 juiced",
      "200g basmati rice",
      "200g spring greens, sliced",
      "4 spring onions, sliced"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C/160°C fan/gas 4. Heat a shallow flameproof casserole over a medium heat, add the chicken legs and brown all over. Mix the soy sauce, star anise, ginger, sesame oil, honey and orange juice in a small bowl, then pour over the chicken in the casserole. Add the orange slices and roast for 35-40 minutes or until golden and cooked through, basting with the juices halfway through."
      },
      {
        "Step 2": "Meanwhile, cook the rice in boiling salted water for 12 minutes or according to the packet instructions. Once the chicken legs are cooked, stir the spring greens into the sauce and return to the oven for another 2 minutes to wilt."
      },
      {
        "Step 3": "Serve the chicken legs with the rice and greens, sprinkled with the spring onions."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/33.jpg"
  },
  {
    "id": "34",
    "title": "Singapore pork and prawn noodles",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min",
    "description": "Swap the pork and prawns for tofu to make this dish vegetarian. Noodles are always a great choice for when you need a meal in minutes – 15 to be precise.",
    "ingredients": [
      "2 tsp light olive oil",
      "300g free-range pork mince",
      "¾ tsp chinese five-spice powder ",
      "2½ tsp curry powder ",
      "180g sustainable raw king prawns, peeled",
      "250g carrots, thinly sliced ",
      "1-2 red chillies, deseeded (optional – leave in if you like spicy food) and roughly chopped ",
      "300g ready-cooked or straight-to-wok egg noodles ",
      "250g pak choi, roughly chopped",
      "4 spring onions, thinly sliced",
      "1½ tbsp light soy sauce"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large heavy-based frying pan or wok over a high heat. Fry the mince for 2 minutes, stirring, to brown."
      },
      {
        "Step 2": "Turn the heat down to medium-high, add the spices and stir-fry for 3 minutes, then add the prawns, carrots and chillies. Cook for 3 more minutes, then add the noodles, pak choi and 2 tbsp water."
      },
      {
        "Step 3": "Stir-fry, scraping the bottom of the pan to loosen any crispy bits, for another 1-2 minutes until the prawns and mince are cooked through, the vegetables are just tender and the noodles are heated through. Serve straightaway sprinkled with the spring onions and soy sauce."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/34.jpg"
  },
  {
    "id": "35",
    "title": "Prawn toast scotch eggs",
    "difficulty": "Medium",
    "portion": "Makes 12",
    "time": "Hands-on time 45 min, cooking time 15 min",
    "description": "Two of your favourite nibbles are combined in one crunchy, crispy, gooey-in-the-middle snack with Ravinder Bhogal’s prawn toast scotch eggs.",
    "ingredients": [
      "3 tbsp white wine vinegar",
      "12 quail eggs",
      "400g raw sustainably sourced king prawns, peeled",
      "3 fat garlic cloves, finely chopped",
      "1 tbsp grated fresh ginger",
      "1 tsp caster sugar",
      "1 tsp toasted sesame oil",
      "1 tsp chilli flakes, toasted for a few minutes in a dry pan",
      "1 tsp light soy sauce",
      "5 spring onions, finely chopped",
      "125g uncooked Thai or Chinese prawn crackers",
      "100g panko breadcrumbs",
      "150g plain flour for coating",
      "3 medium free-range eggs, beaten",
      "Groundnut or vegetable oil for deep frying",
      "Bowl of iced water; food processor; a digital probe thermometer would be useful, too"
    ],
    "method": [
      {
        "Step 1": "Bring a small pan of water to the boil. Meanwhile mix the vinegar into the bowl of iced water and have it on standby. Lower the quail eggs into the boiling water and simmer for 2 minutes. Using a slotted spoon, scoop out the eggs and put them in the iced vinegar water. Leave to cool for 5 minutes, then peel the eggs and set aside."
      },
      {
        "Step 2": "Put the prawns, garlic, ginger, sugar, sesame oil, toasted chilli flakes and soy sauce in a food processor and whizz until you have a coarse, sticky paste. Mix in the spring onions, then divide the prawn mixture into 12 equal portions."
      },
      {
        "Step 3": "Put the prawn crackers in a clean food processor bowl and whizz to a breadcrumb consistency. Mix with the panko breadcrumbs and put in a shallow bowl or tray. Put the plain flour and beaten eggs into 2 more separate shallow bowls."
      },
      {
        "Step 4": "Wrap each quail egg in a portion of the prawn mixture. The easiest way to do this is by rolling it into a ball, then flattening it into a disc large enough to wrap around the egg. Gently press the edges together over the top of each egg to seal, being careful not to squash the delicate egg inside."
      },
      {
        "Step 5": "Once all the eggs have been wrapped in the prawn mixture, roll them first in flour, then coat in the beaten egg, then roll in the cracker/breadcrumb mix. For extra crunch, roll in egg and breadcrumbs again."
      },
      {
        "Step 6": "Heat the oil a deep, heavy-based saucepan (no more than half-full) to 180°C. (If you don’t have a digital probe thermometer a cube of bread added to the pan will turn golden in 30-40 seconds at this temperature.) Line a baking tray with kitchen paper. Use a slotted spoon or frying basket to lower the scotch eggs into the hot oil, then fry, in batches, for 3 minutes. Lift out carefully using the slotted spoon/frying basket and set on the lined tray to drain. Serve warm as a nibble."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/35.jpg"
  },
  {
    "id": "36",
    "title": "Tofu with caramel and sichuan pepper",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min",
    "description": "”Tofu has been misunderstood by some as a bland rubbery filler food, but when cooked well it’s surprisingly addictive. Take the time to really dry out the tofu and crisp up the edges.” – Ravinder Bhogal",
    "ingredients": [
      "396g block firm tofu (we used Cauldron, from large supermakets)",
      "Olive oil for frying",
      "1 tbsp sesame seeds, toasted briefly in a dry pan until fragrant",
      "Crispy fried shallots (from a tub) and micro coriander to serve",
      "125g soft brown sugar",
      "1 tbsp red wine vinegar",
      "½ tbsp Chinese black rice vinegar",
      "25ml light soy sauce",
      "½ tbsp chilli bean paste",
      "1 tsp grated fresh ginger",
      "1 garlic clove, crushed",
      "¼ tsp sichuan pepper",
      "½ bird’s eye chilli, finely sliced"
    ],
    "method": [
      {
        "Step 1": "Put the tofu block on a plate between 2 thick wads of kitchen paper. Press down firmly to squeeze out as much moisture as possible, then use more kitchen paper to pat the surface of the tofu block dry."
      },
      {
        "Step 2": "Heat a glug of oil in a non-stick frying pan and fry the tofu on both sides for 4-5 minutes in total until crisp and golden. Remove from the pan (reserve the pan) and set aside."
      },
      {
        "Step 3": "To make the caramel sauce, put the sugar and 3 tbsp cold water in the pan and heat gently until the sugar dissolves and turns into an amber caramel. Add the remaining caramel sauce ingredients and stir to combine."
      },
      {
        "Step 4": "Return the tofu to the pan and baste in caramel sauce. Slice thickly, then serve on a platter, drizzled with the remaining caramel sauce and topped with the toasted sesame seeds, crispy shallots and micro coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/36.jpg"
  },
  {
    "id": "37",
    "title": "Prawn, cabbage and sichuan pepper stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min",
    "description": "You can play around with the ingredients in this stir-fry, swapping prawns for chicken or egg noodles for rice noodles, to really make it your own.",
    "ingredients": [
      "Rapeseed oil for frying",
      "1 red pepper, finely sliced",
      "1 onion, finely sliced",
      "½ broccoli head, cut into florets",
      "¼ savoy cabbage, shredded",
      "200g chestnut mushrooms, sliced",
      "300g fresh (or cooked) medium egg noodles",
      "350g sustainable raw peeled king prawns",
      "200g firm tofu, cut into 1cm slices",
      "200g beansprouts, soaked in cold water for a few minutes to refres",
      "Lime wedges to serve",
      "1 garlic clove, crushed",
      "1 tsp sichuan pepper, finely ground in a pestle and mortar",
      "1 red chilli, finely chopped",
      "3 tbsp shaoxing rice wine (from the world food section of large supermarkets)",
      "4 tbsp soy sauce, plus extra",
      "1 tbsp honey",
      "2cm piece fresh ginger, grated"
    ],
    "method": [
      {
        "Step 1": "Mix all the dressing ingredients in a small bowl and set aside. Heat a large wok with a good glug of oil, add the pepper and onion and stir-fry for 2-3 minutes until softening."
      },
      {
        "Step 2": "Add the broccoli, cabbage and mushrooms, then stir-fry for a few more minutes until starting to soften. Add the dressing, noodles, prawns and tofu and stir-fry for a final 4-5 minutes until everything is steaming hot, crunchy but cooked through. "
      },
      {
        "Step 3": "Stir in the beansprouts and serve with extra soy sauce and lime wedges for squeezing. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/37.jpg"
  },
  {
    "id": "38",
    "title": "Bao buns with orange and pomegranate glazed lamb",
    "difficulty": "Medium",
    "portion": "Makes 8 buns",
    "time": "Hands-on time 1 hour 40 min, oven time 3 hours 20 min, plus pickling",
    "description": "These buns are sticky, meaty and moreish; another great recipe by Dan Doherty.",
    "ingredients": [
      "200g white wine vinegar",
      "80g caster sugar",
      "10g salt",
      "1 red onion, finely sliced",
      "1.2kg lamb shanks",
      "Olive oil for frying",
      "1 onion, chopped into 2cm pieces",
      "1 carrot, chopped into 2cm pieces",
      "1 celery stick, chopped into 2cm pieces",
      "2 garlic cloves, crushed",
      "1 bay leaf",
      "175ml red wine",
      "500ml fresh chicken stock",
      "1 fresh rosemary sprig",
      "1 fresh thyme sprig",
      "50g brown sugar",
      "Zest and juice 2 oranges",
      "100ml pomegranate molasses",
      "100g shelled pistachios",
      "8 Asian steamed buns",
      "1 cucumber, finely sliced",
      "Fresh coriander sprigs and mint leaves"
    ],
    "method": [
      {
        "Step 1": "The day before you want to serve the bao buns, make the quick-pickled onion. Put the vinegar, sugar and salt in a small saucepan with 100ml water and bring to the boil. Turn off the heat and allow to cool. Put the sliced onion in a bowl, then pour over the pickling liquid. Cover and chill in the fridge overnight."
      },
      {
        "Step 2": "Heat the oven to 150°C/130°C fan/gas 2. Lightly rub the lamb shanks with oil and heat a drizzle more oil in a large frying pan. Fry the shanks for around 15 minutes or until browned all over. Transfer to a casserole that has a lid."
      },
      {
        "Step 3": "In the same frying pan over a medium heat, cook the chopped onion, carrot, celery, garlic and bay leaf for about 20 minutes or until tender with a little colour. Add the wine and reduce the mixture by three quarters, then pour it all over the shanks. Cover with the chicken stock, then add the rosemary and thyme. Put the lid on the casserole and cook in the oven for about 3 hours or until the shanks give way when pressed with a spoon and the meat comes off the bone easily. Remove the casserole from the oven, then turn up the temperature to 180°C/160°C fan/gas 4."
      },
      {
        "Step 4": "Allow the shanks to cool in the stock. When cool enough to handle, transfer to a baking tray. Gently pull the meat from the bones (discard the bones) and leave the meat in the tray."
      },
      {
        "Step 5": "Strain the stock into a heavy-based pan and add the glaze ingredients. Reduce it over a medium heat to form a glaze with a runny honey-like consistency, taking care not to let it burn (around 10 minutes)."
      },
      {
        "Step 6": "Put the tray of lamb onto the middle rack of the oven, then cook for 10 minutes. Meanwhile, spread the pistachios over the base of a large oven tray. Remove the lamb from the oven and pour over half the glaze, then return to the oven for a further 10 minutes. Position the oven tray with the pistachios just beneath the lamb."
      },
      {
        "Step 7": "Remove the lamb and nuts from the oven. Let the nuts cool, then lightly crush in a pestle and mortar. Pour the remaining glaze over the lamb, then sprinkle with the nuts."
      },
      {
        "Step 8": "Steam the buns according to the pack instructions. To serve, further shred the lamb with forks and pile into the buns. Top with sliced cucumber, pickled red onion and fresh coriander and mint."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/38.jpg"
  },
  {
    "id": "39",
    "title": "Sticky beef and charred brussels sprouts fried rice",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 25 min",
    "description": "A speedy weeknight stir-fry that packs in maximum flavour in under 30 minutes. Not a fan of beef? Try using chicken breast instead.",
    "ingredients": [
      "1 tsp olive oil",
      "150g sliced brussels sprouts",
      "300g minute steak, cut into thin strips",
      "1 tbsp cornflour",
      "1 tsp five-spice powder",
      "2 tbsp olive oil",
      "4 sliced spring onions",
      "1 crushed garlic clove",
      "1 tsp grated fresh ginger",
      "250g pouch of steamed basmati rice",
      "3 tbsp rice wine vinegar",
      "1 tbsp soy sauce",
      "2 tbsp sweet chilli sauce"
    ],
    "method": [
      {
        "Step 1": "Heat the first tsp olive oil in a frying pan over a high heat, then add the sliced brussels sprouts and cook until softened and charred. Transfer to a chopping board. Toss the steak in a bowl with the cornflour and five-spice powder."
      },
      {
        "Step 2": "Heat the remaining 2 tbsp olive oil in the frying pan until smoking hot, then add the beef and fry, stirring all the time, until golden and crisp. Remove with a slotted spoon, then add the spring onions, garlic and ginger. Stir-fry for 2-3 minutes, without letting the garlic and ginger burn."
      },
      {
        "Step 3": "Stir in the basmati rice and stir-fry for another 5 minutes until the rice is warmed through. Pour in the rice wine vinegar, soy sauce, sweet chilli sauce, stir, then bubble for 2 minutes. Return the beef and charred sprouts to the pan and toss well to coat. Divide between 2 bowls and drizzle with a little chilli oil to serve, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/39.jpg"
  },
  {
    "id": "40",
    "title": "Beef and spring onion skewers with sticky rice",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 20 min, plus marinating",
    "description": "Sweet and sticky beef skewers marinated in a soy and mirin dressing and served with Thai sticky rice. This is 20-minute meal perfection.",
    "ingredients": [
      "¼ bunch fresh coriander, stems chopped, leaves picked",
      "1-2 sirloin or rump steaks (about 300g total), cut into 3-4cm chunks",
      "½ bunch spring onions",
      "1 tbsp toasted sesame oil",
      "Vegetable oil for brushing",
      "Sesame seeds to sprinkle",
      "Cooked rice to serve (we used Waitrose Asian Thai sticky rice)",
      "4 tbsp mirin",
      "4 tbsp tamari or soy sauce",
      "4 tbsp chicken stock or rice wine",
      "2 tsp freshly grated ginger or 2 tsp ginger paste",
      "1 fat garlic clove, crushed",
      "1 tsp frozen chopped jalapeños or ½ tsp chilli flakes",
      "2 tsp sugar",
      "Juice 1 lime",
      "4 bamboo skewers soaked in warm water (or use metal ones)"
    ],
    "method": [
      {
        "Step 1": "Put all the marinade ingredients and the coriander stems in a glass or ceramic mixing bowl and stir to dissolve the sugar. Add the beef and mix to coat, then set aside for at least 1 hour."
      },
      {
        "Step 2": "Cut the spring onions in half, then slice in half lengthways. Brush with the sesame oil and set aside. When ready to cook, heat a ridged griddle pan (or heat the grill to high). Divide the beef among the skewers and nestle spring onions between the chunks (keep the marinade). Brush the meat with vegetable oil and grill/ griddle for 2-3 minutes on each side, turning, until cooked to your liking."
      },
      {
        "Step 3": "Meanwhile, put the reserved marinade in a small pan and bubble for 5 minutes over a high heat until reduced and syrupy. Heat the rice according to the pack instructions. Serve the skewers with the sticky rice, drizzled with the reduced marinade and sprinkled with sesame seeds and coriander leaves."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/40.jpg"
  },
  {
    "id": "41",
    "title": "Home-smoked salmon with green herb lettuce salad",
    "difficulty": "Easy",
    "portion": "Serves 8",
    "time": "Hands-on time 40 min, plus marinating",
    "description": "”This recipe is light and bursting with Asian flavours. It makes a wonderful starter” – Thomasina Miers. And you can receive all the glory for going to the trouble of home-smoking your own salmon.",
    "ingredients": [
      " 3 tbsp light brown soft sugar",
      "3 tbsp light soy sauce",
      "Juice 1 lime",
      "Large thumb-size piece fresh ginger, finely grated",
      "750g organic salmon fillets, skin on",
      "125g white rice (uncooked)",
      "1 cinnamon stick",
      "2 star anise",
      "1 tsp peppercorns",
      "Bunch coriander, stems separated, leaves reserved for the salad",
      "Small bunch fresh mint, leaves picked",
      "1 baby shallot, finely sliced",
      "2 soft round lettuces, leaves picked",
      "2 handfuls radishes (about 150g), finely sliced",
      "½ cucumber, sliced into thin half-moons",
      "1 small garlic clove, crushed",
      "1 red bird’s eye chilli, chopped",
      "1 tbsp toasted sesame seeds, ground in a pestle and mortar",
      "3 tbsp brown sugar",
      "4 tbsp toasted sesame oil",
      "2 tbsp fish sauce",
      "Juice 3 limes",
      "Wok or deep frying/sauté pan with a wire rack that will fit the salmon"
    ],
    "method": [
      {
        "Step 1": "Make a marinade by mixing the sugar, soy, lime and ginger in a small bowl. Lay the salmon fillets in a single layer in a shallow glass or ceramic bowl, pour over the marinade, turn to coat, then cover and chill for at least 20 minutes."
      },
      {
        "Step 2": "Line the base of the wok/pan with 2 layers of foil. Put the rice, cinnamon, star anise, peppercorns and coriander stems (reserve the leaves for the salad) in the bottom of the wok/pan on the foil. When the salmon has marinated, drain it and sprinkle the drained marinade over the rice. Set the wire rack over the rice mixture and lay the salmon on top; wrap the wok/pan in 2 layers of foil to seal tightly."
      },
      {
        "Step 3": "Put the wok/pan on the hob over a high heat. After a few minutes you’ll see the beginnings of smoke. Turn down the heat to medium and smoke the fish for 12-15 minutes (depending on the thickness of your fish), turning once. The flesh will turn opaque when it’s just cooked. Set aside to cool."
      },
      {
        "Step 4": "Put the salad ingredients with the coriander leaves in a mixing bowl. To make the dressing, bash the garlic to a paste in a pestle and mortar with the chilli, sesame seeds and sugar. Whisk in the other dressing ingredients, taste and season. (Or whizz the dressing ingredients in a mini food processor.)"
      },
      {
        "Step 5": "Flake the salmon into large chunks (discard the skin). Dress the salad with half the dressing, arrange on plates with salmon chunks on top, then drizzle with the rest of the dressing to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/41.jpg"
  },
  {
    "id": "42",
    "title": "Griddled scallops with oriental dressing",
    "difficulty": "Easy",
    "portion": "Serves 2 as a starter",
    "time": "Hands-on time 15-20 min",
    "description": "A speedy dish of scallops with an oriental dressing by The Cookery School at Little Portland Street, London. This recipe delivers the wow factor, but only takes 20 minutes to make.",
    "ingredients": [
      "6 fresh sustainable scallops, shelled",
      "Toasted sesame oil for drizzling",
      "2 handfuls salad leaves to serve",
      "2 tsp sesame seeds, lightly toasted in a dry frying pan",
      "1 garlic clove, crushed",
      "1.5cm piece ginger, grated",
      "½ tbsp toasted sesame oil",
      "1 tbsp olive oil",
      "1 tsp lemon juice",
      "1 tsp rice vinegar",
      "½ tbsp teriyaki sauce",
      " Squeeze orange juice",
      "1 tsp apple concentrate"
    ],
    "method": [
      {
        "Step 1": "For the dressing, in a small bowl, whisk together all the ingredients until thickened, then set aside."
      },
      {
        "Step 2": "Clean the scallops by slicing off any muscle fibres (discard) and the orange and white roes, if you want. Pat the scallops dry with kitchen paper, then lightly drizzle with the sesame oil."
      },
      {
        "Step 3": "Heat a ridged griddle pan (or frying pan) until smoking hot, add the scallops and cook for 2-3 minutes until starting to turn golden brown on one side. Turn (in the same order as you added them to the pan) and cook for another 2-3 minutes. They should be lightly golden on top and still feel quite springy when touched. Don’t overcrowd the pan or the scallops will steam. Transfer to a plate and season with salt and pepper."
      },
      {
        "Step 4": "Toss the salad leaves in a small bowl with a little of the oriental dressing, then divide between 2 plates. Arrange the scallops on top, drizzle with more dressing and sprinkle with the sesame seeds."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/42.jpg"
  },
  {
    "id": "43",
    "title": "Lemongrass and coconut chicken stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 25 min",
    "description": "You can easily make the coconut and lemongrass curry paste in advance to halve the cooking time of this recipe, making it a speedy midweek meal.",
    "ingredients": [
      "40g unsweetened coconut flakes or desiccated coconut",
      "4cm piece fresh ginger, grated",
      "2 lemongrass sticks, trimmed and finely chopped",
      "½-1 red chilli, deseeded and chopped",
      "160g dried udon or egg noodles",
      "Rapeseed oil for frying",
      "2 large free-range skinless chicken breasts, sliced widthways into 1cm strips",
      "450g greens (we used purple sprouting broccoli and brussels sprouts), chopped",
      "2½ tbsp kecap manis (from the world food section of large supermarkets; or use soy sauce and a pinch of sugar)",
      " Grated zest and juice 1 lime",
      "2 tbsp chopped fresh coriander (optional) to serve"
    ],
    "method": [
      {
        "Step 1": "Heat a large frying pan or wok over a medium-high heat and, when hot, briefly toast the coconut flakes, then set aside."
      },
      {
        "Step 2": "In a food processor (or using a pestle and mortar), whizz/grind two thirds of the coconut flakes with the ginger, lemongrass, chilli and a splash of water to make a thick paste."
      },
      {
        "Step 3": "Boil a pan of water and cook the noodles accordingto the pack instructions (about 5 minutes). Rinse under cold water, drain, then set aside."
      },
      {
        "Step 4": "Heat 1½ tbsp rapeseed oil in a frying pan or wok overa medium-high heat. Add the chicken and fry for 1-2 minutes on each side to brown, then turn the heat down to medium. Add the curry paste and mix well, then fry for 1 minute before adding the greens. Cook the broccoli for 1 minute, then add the sprouts and noodles, toss well and stir-fry until heated through. Stir in the kecap manis, lime zest and juice, then serve with the remaining toasted coconut and the coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/43.jpg"
  },
  {
    "id": "44",
    "title": "Hoisin duck on cucumber",
    "difficulty": "Easy",
    "portion": "Makes 40",
    "time": "Hands-on time 10 min",
    "description": "A lovely light canapé that takes just ten minutes to prepare and requires a few simple ingredients – tasty finger food in a flash.",
    "ingredients": [
      "2 Gressingham Foods Duck Confit legs (from Waitrose and Ocado)",
      "4 tbsp hoisin sauce",
      "Juice of 1 ½ limes",
      "1 cucumber",
      "1 finely shredded spring onion",
      " ½ finely sliced chilli (optional)",
      "Sprinkle of sesame seeds"
    ],
    "method": [
      {
        "Step 1": "Shred the meat from the two duck legs into a bowl and mix with 3tbsp hoisin sauce and the juice from one lime."
      },
      {
        "Step 2": "Heat a large non-stick frying pan with a splash of oil and stir-fry the duck. Set aside. Slice the cucumber into 40 rounds and top each with a spoonful of the duck. Mix 1 tbsp of hoisin sauce with the juice of ½ lime and drizzle over the duck."
      },
      {
        "Step 3": "Add the finely shredded spring onion (first put it in cold water so it curls up) and, if you like, finely sliced chilli. Sprinkle with sesame seeds."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/44.jpg"
  },
  {
    "id": "45",
    "title": "Pork and hoisin stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min",
    "description": "Ready on the table in 20 minutes, this pork and hoisin stir-fry really is a flash in the pan.",
    "ingredients": [
      "Vegetable oil for frying",
      "250g pork tenderloin, sliced into 2cm pieces",
      "2 x 350g packs stir-fry vegetables",
      "300g pack straight-to-wok stir-fry egg noodles",
      "Large bunch fresh coriander, roughly chopped",
      "3 tbsp hoisin sauce",
      "1 tbsp clear honey",
      "1 tbsp soy sauce",
      "4cm piece fresh ginger, grated",
      "1 red chilli, finely chopped",
      "Lime wedges"
    ],
    "method": [
      {
        "Step 1": "Mix all the dressing ingredients in a small bowl. Heat a large frying pan or wok and add a glug of oil. When it’s very hot, add the pork and stir fry for 3-4 minutes until turning golden and starting to cook through."
      },
      {
        "Step 2": "Add the stir-fry vegetables and cook for a few minutes, then add the noodles and dressing. Cook for a further 3-4 minutes, stirring all the time, then serve straightaway with the coriander and lime (if you like)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/45.jpg"
  },
  {
    "id": "46",
    "title": "Spicy lemon rice",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 10 min, simmering time 12 min",
    "description": "This lemon rice is light, fresh and it’s quick to make. Enjoy it as part of a thali (a platter made up of various dishes) or alongside a fragrant curry.",
    "ingredients": [
      "1 tbsp sunflower oil",
      "1½ tsp black mustard seeds",
      "1½ tsp split black lentils (urad dhal)",
      "1½ tsp split chickpeas (chana dhal)",
      "4 dried red chillies",
      "1 tsp salt",
      "1 tsp ground turmeric",
      "400g white basmati rice",
      "1 litre boiling water",
      "3 tbsp lemon juice"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a wide saucepan over a medium heat. Add the mustard seeds, split lentils, split chickpeas and dried chillies, then cook for about 1 minute or until they begin to sizzle. Stir in the salt and turmeric, then add the rice and mix well to coat."
      },
      {
        "Step 2": "Slowly stir in the measured boiling water. Cover the pan with a lid, then cook over a low heat for 12 minutes or until the rice is cooked. Stir in the lemon juice. Serve hot with sambhar (see right) or chutney, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/46.jpg"
  },
  {
    "id": "47",
    "title": "Spicy chicken chow mein noodles",
    "difficulty": "Medium",
    "portion": "Serves 4-6",
    "time": "Hands-on time 40 min",
    "description": "On a hot day in Beijing, Ning Ma would eat these spicy chicken noodles cold. Now served in her restaurants Mama Lan, this traditional recipe is a favourite during summer.",
    "ingredients": [
      "1 spring onion, halved",
      "Small thumb-size piece fresh ginger, cut in half and bashed",
      "1 tsp salt",
      "1 tbsp shaoxing wine (from the world food section of large supermarkets or from Asian grocers)",
      "6 British free-range bone-in chicken thighs, skin removed",
      "2 tbsp red vinegar (from Asian grocers) or red wine vinegar",
      "1 tsp salt",
      "1 tsp caster sugar",
      "3 tbsp chilli oil (we used Cooks & Co Olive Oil with Chillies, from Ocado)",
      "120g tahini",
      "½ tsp salt",
      "½ tbsp caster sugar",
      "½ tbsp rice wine vinegar",
      "100ml boiling water",
      "½ tbsp light soy sauce",
      "225g dried vermicelli rice noodles",
      "300g beansprouts, blanched in boiling water for 2 seconds",
      "1 cucumber, deseeded and cut into thin 6cm-long strips",
      "4 tbsp salted dry roasted peanuts, roughly chopped",
      "Chilli oil to taste",
      "Handful fresh coriander leaves",
      "1 red chilli, thinly sliced diagonally",
      "½ tbsp sesame seeds, lightly toasted in a dry pan"
    ],
    "method": [
      {
        "Step 1": "Put all the chicken ingredients, apart from the chicken, in a large pan with 1 litre water. Bring to the boil, add the chicken, then simmer for 20-25 minutes or until the chicken is cooked. The meat should come off the bone with little effort. Lift the chicken onto a plate and leave to cool, then shred into strips. Discard the skin, bones and cooking liquid."
      },
      {
        "Step 2": "Mix the marinade ingredients in a medium mixing bowl, add the shredded chicken and marinate for 1 hour or longer."
      },
      {
        "Step 3": "Mix the sesame paste ingredients in a small mixing bowl and set aside."
      },
      {
        "Step 4": "Soak and cook the noodles according to the packet instructions, run under cold water for 2-3 minutes to remove the starch, then keep chilled until ready to serve. To assemble the ban mein, put the cold noodles in a bowl or on a platter and arrange the marinated chicken on top. Spoon over some of the sesame paste followed by the beansprouts and cucumber in a mound in the middle of the bowl. Sprinkle the peanuts around the outside, spoon over as much of the chilli oil as you want, then decorate with the coriander leaves, sliced chilli and sesame seeds. Serve cold."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/47.jpg"
  },
  {
    "id": "48",
    "title": "Egg-fried rice and veg stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 15 min",
    "description": "This egg-fried rice recipe is a quick and easy midweek meal for two. Stir-fry strips of lean pork or steak for a meaty version, or add a chopped pack of marinated tofu for a more filling meal.",
    "ingredients": [
      "400g pack mixed vegetable stir-fry",
      "250g pack ready-to-heat brown or white rice",
      "4 medium free-range eggs, beaten",
      "1 tbsp soy sauce, plus extra to serve",
      "Juice 1 lime, plus wedges to serve",
      "Olive oil for frying"
    ],
    "method": [
      {
        "Step 1": "Heat a large frying pan or wok with a glug of olive oil. Add the mixed vegetables and cook for 1 minute, then add the rice. Stir-fry for 2-3 minutes more, then move the rice and vegetables to one side of the pan."
      },
      {
        "Step 2": "Pour in the eggs and leave to set, then very softly scramble. Once the eggs are partly cooked but still runny, use a spatula to combine with the vegetables and rice, along with the soy sauce."
      },
      {
        "Step 3": "Serve straightaway with an extra dash of soy sauce and lime wedges to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/48.jpg"
  },
  {
    "id": "49",
    "title": "Asian braised beef with pak choi",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands on time 10 minutes, cooking time 1 hour 45 minutes",
    "description": "Beef is slow-cooked with bold Asian flavours until it’s fall-apart-tender, then served with pak choi and noodles for an incredible dinner that’s worth the wait.",
    "ingredients": [
      "2 tsp vegetable oil",
      "1kg braising steak, cut into chunks",
      "1 garlic clove, crushed",
      "1 large shallot, sliced",
      "2.5cm fresh ginger, grated ",
      "750ml beef stock",
      "125ml shaoxing (Chinese rice wine, from Waitrose or Asian shops)",
      "125ml hoisin sauce",
      "¼ tsp ground cumin",
      "1 star anise",
      "1 red chilli, sliced",
      "Freshly squeezed juice of 1 tangerine or ½ orange",
      "1 tsp clear honey",
      "4-6 pak choi"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large pan. Add the steak and brown all over. Transfer to a plate, season and set aside."
      },
      {
        "Step 2": "Add the garlic, shallot and ginger to the pan and cook, stirring, for 1 minute. Add the stock, shaoxing, hoisin sauce, cumin, star anise, chilli, tangerine (or orange) juice and honey. Stir to combine, then bring to the boil. Return the steak to the pan, reduce the heat and simmer very gently, uncovered, for 1-1½ hours until the meat is tender. Taste and adjust the seasoning."
      },
      {
        "Step 3": "Separate the pak choi leaves. Cut the white parts into 1cm slices; keep the green parts large or cut in half. Add the white parts to the pan, turn up the heat and cook for 3-4 minutes until just tender. Add the greens and cook for 2-3 minutes more until just wilted. Serve immediately with cooked noodles of your choice."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/49.jpg"
  },
  {
    "id": "50",
    "title": "Barbecued Asian lamb",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Takes 20 mins to make, 35 mins to cook, plus marinating and resting",
    "description": "Lamb works particularly well with the smokiness created by the barbecue coals and, in this recipe from Donal Skehan, the addition of a marinade full of wonderful Asian ingredients heightens those flavours. This barbecued lamb recipe is the taste of summer.",
    "ingredients": [
      "6 garlic cloves, crushed",
      "1 thumb-size piece of fresh ginger, finely grated",
      "1 red chilli, finely chopped",
      "3 tbsp honey",
      "2 tbsp sunflower oil",
      "3 tbsp rice wine vinegar",
      "4 tbsp dark soy sauce",
      "1 tbsp toasted sesame oil",
      "2kg leg of lamb, butterflied",
      "1 tsp toasted sesame oil",
      "1 tbsp soy sauce",
      "1 tbsp fish sauce",
      "1 tbsp rice wine vinegar",
      "1 tbsp honey",
      "3 tbsp sesame seeds, toasted",
      "1 chinese cabbage, halved and finely shredded",
      "4 carrots, grated or julienned",
      "1 cucumber, sliced into long ribbons using a mandoline or peeler",
      "3 spring onions, finely sliced"
    ],
    "method": [
      {
        "Step 1": "Mix all the ingredients for the lamb (except the lamb itself) in a large baking dish or large resealable plastic bag. Mix or shake well so everything is combined, then add the lamb and rub well to cover in the marinade. Transfer to the fridge to marinate for at least 2 hours or overnight."
      },
      {
        "Step 2": "Make the slaw dressing: in a bowl, whisk the oil, soy sauce, fish sauce, vinegar, honey and most of the sesame seeds. When ready to serve, put the cabbage, carrots, cucumber and spring onions in a serving bowl and toss with the dressing."
      },
      {
        "Step 3": "Remove the lamb from the fridge about 40 minutes before you’re ready to cook it. Thread 2 large metal skewers crossways through the lamb so it’s easy to transfer to the barbecue and turn during cooking."
      },
      {
        "Step 4": "To cook the lamb on a gas barbecue, bring the barbecue to a high heat, then sear the lamb on each side for 3-4 minutes. Turn the heat down low, then cover with the lid or foil. Cook for about 30 minutes until a meat thermometer registers 53°C (for medium rare), turning the meat every 10 minutes. If the lamb blackens too much, place it on a sheet of aluminium foil to prevent it blackening further."
      },
      {
        "Step 5": "To cook on a charcoal barbecue, start with the lamb on the hotter part of the barbecue (the one with the double layer of coals  and sear for 3-4 minutes, then move it to the cooler part of the barbecue (with a single layer of coals), following the same cooking times and technique, and cooking it to the same temperature as in step 4."
      },
      {
        "Step 6": "When the lamb is cooked, transfer to a grooved chopping board (to catch the juices), cover with foil and rest for 10 minutes. Slice thinly and serve with the slaw and a sprinkle of the remaining sesame seeds."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/50.jpg"
  },
  {
    "id": "51",
    "title": "Sticky Asian pork with sesame greens",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 mins, cook time 5 mins",
    "description": "Donal Skehan’s one-pan recipe, from his book Eat. Live. Go: Fresh Food Fast, is best served straight to the table – removing the lid at the table to reveal the delicious steaming meal underneath.",
    "ingredients": [
      "500g whole pork fillet, trimmed",
      "1 tbsp Chinese five-spice powder",
      "1 tbsp sunflower oil",
      "1 large thumb-sized piece of fresh ginger, finely minced",
      "3 garlic cloves, finely minced",
      "1 red chilli, finely chopped",
      "3 tbsp rice wine",
      "3 tbsp oyster sauce",
      "1 tbsp dark brown sugar",
      "2 large bok choy, cut into quarters",
      "200g sugar snap peas",
      "1 tbsp sesame seeds"
    ],
    "method": [
      {
        "Step 1": "Slice the fillet in half and roll both halves in the five-spice powder until completely coated."
      },
      {
        "Step 2": "Place a large frying pan over a medium heat and add the oil. Fry the pork fillets for 16-18 minutes or until it has a good colour on all sides (if you have a meat thermometer the internal temperature should be 65°C). Remove the pork and place on a plate to rest."
      },
      {
        "Step 3": "Using the oil left in the pan, fry the ginger, garlic and the chilli for 2 minutes. Add in the rice wine, oyster sauce, sugar and 150ml boiling water. Simmer gently for 3-4 minutes until slightly reduced."
      },
      {
        "Step 4": "Return the pork to the pan, place the pak choy and sugar snap peas around it and cover with a lid. Cook over a medium heat for 4 minutes until the vegetables are tender."
      },
      {
        "Step 5": "Before serving, remove the pork from the pan, slice it into medallions and nudge it back into the centre of the pan, spooning over the sauce to coat. Serve the whole pan straight to the table with a sprinkle of toasted sesame seeds."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/51.jpg"
  },
  {
    "id": "52",
    "title": "Ginger, chilli and lime steamed cod with stir-fried red cabbage and coriander rice",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min, oven time 10-12 minutes",
    "description": "This Asian-inspired cod recipe is perfect for a quick and easy midweek dinner. The best part? After cooking, there will be minimal washing up.",
    "ingredients": [
      "4 x 150g pieces line-caught cod loin",
      "50g fresh ginger, thinly sliced (no need to peel)",
      "2 red chillies, deseeded and sliced",
      "Finely grated zest and juice 2 limes, plus lime wedges ",
      "1 tbsp coconut oil (or sunflower oil)",
      "1 large garlic clove, sliced",
      "½ red cabbage, shredded",
      "2 tbsp soy sauce",
      "2 x 250g packets cooked brown rice (we like Tilda)",
      "Large bunch fresh coriander, roughly chopped",
      "4 x 30cm circles of non-stick baking paper"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 190°C/170°C fan/gas 5. Slice each fish loin in half and put 2 pieces in the centre of each piece of baking paper. Add a few slices of ginger and chilli, a splash of lime juice and a lime wedge, then bring the baking paper edges together to make parcels. Seal by either stapling the edges or twisting, folding and pleating them. Put on a baking tray and bake for 10-12 minutes until the fish flakes easily."
      },
      {
        "Step 2": "Meanwhile, heat the oil in a large pan. Add the rest of the ginger and chilli, the garlic and red cabbage. Stir-fry for 4-5 minutes to soften. Add the soy sauce, the cooked rice and the rest of the lime juice and zest, then stir-fry for 5 minutes until hot through. Add a splash of water if it sticks. Stir in the coriander, season and serve with the fish. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/52.jpg"
  },
  {
    "id": "53",
    "title": "Battered prawns with spiced herb relish",
    "difficulty": "Easy",
    "portion": "Serves 6-8",
    "time": "Hands-on time 40 min",
    "description": "Serve this crispy prawn recipe with fresh herb relish at your next dinner party as an everyone-dig-in starter. It’s sure to leave your guests wanting more.",
    "ingredients": [
      "1 litre sunflower oil for frying",
      "24 sustainable king prawns, heads removed, peeled and deveined, tails left on",
      "1 large free-range egg",
      "200ml coconut milk",
      "100g plain flour",
      "25g cornflour",
      "½ tsp salt",
      "Juice 1 lime, plus wedges to serve",
      "1 tbsp cumin seeds",
      "1 tbsp coriander seeds",
      "120ml olive oil",
      "Large bunch fresh coriander",
      "Large bunch fresh mint",
      "Large bunch fresh Thai basil (or regular basil)",
      "1 garlic clove",
      "Juice 2 limes",
      "3-4cm piece fresh ginger, grated",
      "2 bird’s eye chillies, or 1 deseeded if you prefer less heat",
      "½ tsp salt",
      "Digital probe thermometer"
    ],
    "method": [
      {
        "Step 1": "To make the batter, mix together the egg and coconut milk in a large mixing bowl using a balloon whisk. Gradually whisk in the flour, cornflour, salt and lime juice. Set aside while you prepare the relish. "
      },
      {
        "Step 2": "Heat a small frying pan over a low-medium heat. Toast the cumin and coriander seeds for 2 minutes or until fragrant. Tip into a food processor and allow to cool. "
      },
      {
        "Step 3": "Add the remaining relish ingredients to the food processor, reserving a few coriander leaves, then whizz to a paste (or pound in a mortar and pestle). Taste and season. "
      },
      {
        "Step 4": "Heat the sunflower oil in a medium heavy-based, deep frying pan to 190°C when tested with a digital probe thermometer. Lay kitchen paper in a roasting tray. Add the prawns to the batter and coat well. Carefully lower 4 prawns at a time into the hot oil using a slotted spoon and fry for 3-4 minutes until the batter is golden and crisp and the prawns are cooked. Remove and drain on the kitchen paper (keep warm) while you cook the next batch of 4. Check occasionally that the oil is hot enough, using the thermometer. "
      },
      {
        "Step 5": "Once all the prawns are ready, transfer them to a serving plate, then sprinkle with salt and the reserved coriander leaves. Serve with the relish and lime wedges to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/53.jpg"
  },
  {
    "id": "54",
    "title": "Chicken fried rice",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 25 min",
    "description": "Perfect for using up leftover rice and ready in just 25 minutes, this stir fry recipe is a midweek dinner winner.",
    "ingredients": [
      "Groundnut oil for frying",
      "3 banana shallots, finely chopped",
      "4 British free-range chicken thigh fillets, cut into 2cm chunks",
      "1 tbsp clear honey",
      "2 garlic cloves, crushed",
      "Large thumb-size piece fresh ginger, finely grated",
      "1 small red chilli, deseeded and finely chopped",
      "2 large free-range eggs, lightly beaten",
      "250g cooked basmati rice",
      "1 tbsp soy sauce",
      "1 tbsp fish sauce",
      "150g frozen peas, defrosted",
      "4 spring onions, finely sliced",
      "Bunch fresh coriander, chopped",
      "Toasted cashews and lime wedges to serve"
    ],
    "method": [
      {
        "Step 1": "Heat a glug of oil in a large wok over a high heat and cook the shallots until soft. Meanwhile put the chicken in a medium mixing bowl and coat it in the honey."
      },
      {
        "Step 2": "Add the garlic, ginger and chilli to the shallot pan and cook for another minute, stirring constantly, then add the chicken and fry for 5-8 minutes or until cooked through. Tip out onto a plate and keep it to hand."
      },
      {
        "Step 3": "Tip the eggs into the pan, let them set slightly, then stir until completely cooked. Return everything to the pan, add the rice and fry, stirring, for 2 minutes. Add the soy sauce, fish sauce, peas and spring onions with a pinch of black pepper, then fry for 2 minutes. Stir in the coriander, scatter over some cashews and serve with lime wedges."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/54.jpg"
  },
  {
    "id": "55",
    "title": "Tofu stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 25 min",
    "description": "An easy, flavour packed recipe that’ll have you passing on a Friday night Chinese takeaway.",
    "ingredients": [
      "200g fine egg noodles",
      "2½ tbsp vegetable oil",
      "Thumb-size piece fresh ginger, coarsely grated",
      "2 garlic cloves, finely chopped",
      "1 large red onion, sliced",
      "Large head broccoli, cut into small florets",
      "250g shiitake mushrooms, halved",
      "160g marinated tofu pieces (we used Cauldron)",
      "1 tbsp soy sauce",
      "2 tbsp fish sauce (you may wish to avoid using  if vegetarian)",
      "Chilli flakes"
    ],
    "method": [
      {
        "Step 1": "Put the noodles into a large pan of boiling water and cook for 3-4 minutes, then drain and refresh with running cold water."
      },
      {
        "Step 2": "Heat 2 tbsp oil in a large wok or frying pan over a high heat, then fry the ginger, garlic and onion, stirring often, until the onion has softened. Add the broccoli florets and shiitake mushrooms and continue to stir-fry until all the vegetables are tender."
      },
      {
        "Step 3": "Meanwhile, heat the rest of the oil in a medium frying pan and cook the tofu for 5 minutes or until crisp. Add the noodles, soy sauce, fish sauce and tofu to the wok, then cook, stirring, until the noodles have warmed through. Serve with a scattering of chilli flakes."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/55.jpg"
  },
  {
    "id": "56",
    "title": "Natasha Corrett’s grilled aubergine miso salad",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 20 min",
    "description": "The umami flavour of miso takes this dressing to another level. Natasha Corrett uses it to coat grilled aubergine, spinach and gluten-free quinoa to make a filling meat-free meal.",
    "ingredients": [
      "280g aubergine, sliced into 0.5cm discs",
      "1 tbsp sunflower oil",
      "190g cooked quinoa (100g uncooked weight)",
      "70g spinach",
      "Finely grated zest ½ lime",
      "1 tsp sesame seeds",
      "25g chopped fresh coriander",
      "1 large or 2 small spring onions, finely chopped",
      "½ red chilli, finely chopped",
      "1½ tbsp brown rice miso (from Waitrose and health food shops)",
      "1½ tsp toasted sesame oil",
      "Juice 1 lime"
    ],
    "method": [
      {
        "Step 1": "Heat a griddle or frying pan over a medium heat. Put the aubergine slices into a bowl with the sunflower oil and salt and toss with your hands so each slice is lightly coated."
      },
      {
        "Step 2": "Cover the pan in a layer of aubergine (you may need to do this in 2 batches), then cook for about 2 minutes on each side or until they start to get char marks. Transfer to a bowl, then stir in the quinoa."
      },
      {
        "Step 3": "Whisk all the dressing ingredients in a small bowl with 3 tbsp water until smooth. Boil the kettle and put the spinach in a colander in the sink."
      },
      {
        "Step 4": "Pour the boiling water over the spinach, then press out any excess water with a spoon. Stir the dressing into the aubergine mixture, then add the spinach, lime zest, sesame seeds, coriander, onion and chilli."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/56.jpg"
  },
  {
    "id": "57",
    "title": "Green noodle and tofu salad with ginger and tamari dressing",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "Change up your salad game with this Asian-inspired recipe. On the table and ready to eat in 30 minutes – a great addition to your midweek dinner repertoire.",
    "ingredients": [
      "300g buckwheat noodles",
      "350g broccoli florets, halved",
      "160g marinated tofu (we used Cauldron), crumbled",
      "200g baby leaf spinach",
      "2 ripe avocados, sliced",
      "2 limes",
      "1 garlic clove, crushed",
      "10g fresh ginger, finely grated",
      "1 tbsp tamari",
      "3 tbsp toasted sesame oil",
      "Chopped fresh coriander (optional)"
    ],
    "method": [
      {
        "Step 1": "Bring a large pan of water to the boil and cook the noodles according to the packet instructions (about 5 minutes). Add the broccoli to the pan for the last 3 minutes. Drain and run under cold water for 5-6 minutes to rinse off any starch and to cool everything down."
      },
      {
        "Step 2": "Heat a non-stick frying pan over a medium heat. Add the tofu and dry fry (without oil) for 4-5 minutes, stirring occasionally, then set aside."
      },
      {
        "Step 3": "For the dressing, whisk all the ingredients in a small bowl. Taste and season the dressing (tamari is quite salty so you may not need to add any extra salt). Combine the cooked ingredients with the spinach, avocados and dressing in a large bowl, then serve straightaway, sprinkled with chopped coriander, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/57.jpg"
  },
  {
    "id": "58",
    "title": "Singapore style stir fried noodles",
    "difficulty": "Medium",
    "portion": "Serves 4",
    "time": "Hands-on time 1 hour 35 min, plus marinating",
    "description": "Debbie Major combines roasted pork and stir fried veg with curry powder in this Singapore inspired recipe.",
    "ingredients": [
      "25g dried sliced Chinese mushrooms, such as shiitake",
      "200ml hot chicken stock",
      "200g dried rice vermicelli noodles",
      "1 tbsp toasted sesame oil",
      "2 tbsp sunflower oil",
      "175g British free-range streaky bacon rashers, cut across into thin strips",
      "1 medium onion, finely chopped",
      "3 garlic cloves, finely chopped",
      "5cm piece fresh ginger, finely chopped",
      "1 medium-hot red chilli, seeded and thinly sliced",
      "4 tsp mild curry powder",
      "150g cooked peeled North Atlantic prawns",
      "2 tbsp dark soy sauce",
      "1 bunch (about 6) spring onions, thinly sliced",
      "1cm piece fresh ginger, finely grated",
      "1 garlic clove, crushed",
      "1 tsp hoisin sauce",
      "1 tsp tamari or dark soy sauce",
      "1 tsp light soft brown sugar",
      "½ tsp five-spice powder",
      "1 tsp sunflower oil",
      "Few drops red food colouring (optional)",
      "1 tsp clear honey",
      "1 medium-size (350g) British free-range pork fillet, trimmed "
    ],
    "method": [
      {
        "Step 1": "For the red roast pork, put all the ingredients except the pork into a shallow dish large enough to hold the pork fillet and stir to combine. Add the pork fillet and turn it over several times to coat. Cover and leave to marinate for at least 1 hour, overnight in the fridge if possible. "
      },
      {
        "Step 2": "Heat the oven to 220°C/200°C fan/gas 7. Lift the pork onto a rack set over a small, foil-lined roasting tin. Roast for 10 minutes, then lowerthe oven to 180°C/160°C fan/gas 4 and roast for 25 minutes. "
      },
      {
        "Step 3": "Meanwhile, put the dried mushrooms in a heatproof bowl. Pour over the hot chicken stock and leave them to soak for 30 minutes. "
      },
      {
        "Step 4": "Remove the pork from the oven and, when cool enough to handle, cut in half lengthways, then across into thin slices. Cover and set aside. Drain the mushrooms, squeeze out the excess liquid and set both aside. "
      },
      {
        "Step 5": "Drop the noodles into a pan of boiling water, take off the heat and leave them to soak for 2 minutes. Drain well, then toss in a bowl with the toasted sesame oil. "
      },
      {
        "Step 6": "Heat the sunflower oil in a wok or a large, deep frying pan. Add the bacon and fry for a few minutes until crisp and golden. Remove with a slotted spoon onto a plate. Add the onion and fry for 5 minutes until golden. Add the mushrooms, garlic, ginger and chilli, then stir-fry for 2 minutes. Add the curry powder and fry for 1 minute more. Add the pork, prawns, noodles, reserved mushroom liquid and soy sauce, then toss together gently over a high heat using two forks for about 2 minutes until everything has heated through. Add the spring onions, toss again, then serve. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/58.jpg"
  },
  {
    "id": "59",
    "title": "Brown sugar and chilli chicken wings",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 10 min, barbecuing time 20-25 min (or grilling and oven time 35-46 min), plus marinating",
    "description": "Lightly charred on the grill or barbecue, these sticky, sweet and spicy chicken wings make the perfect hands-on starter that will have happy dinner guests licking their fingers clean.",
    "ingredients": [
      "16 British free-range chicken wings",
      "2 tbsp brown sugar",
      "150ml chilli sauce (we used Lingham’s)",
      "1 tbsp celery salt",
      "Finely grated zest 2 limes, juice 1, plus wedges to serve",
      "Charred sweetcorn cobs and a salad made with iceberg lettuce and blue cheese to serve"
    ],
    "method": [
      {
        "Step 1": "Put the chicken wings in a large non-metallic bowl along with the sugar, chilli sauce, celery salt, lime zest and juice. Mix thoroughly to coat the wings, then cover and set aside to marinate for at least 1 hour or up to 24. (Transfer to the fridge if marinating for 2 hours or more.)"
      },
      {
        "Step 2": "When ready to cook, light the barbecue or heat the oven to 200°C/ 180°C fan/gas 6. Shake any excess marinade off the wings (discard any leftover marinade), then barbecue for 20-25 minutes, just to the side of the hottest part of the grill, turning occasionally, until sticky and cooked through. (Alternatively, if cooking in the oven, first heat a griddle pan on the hob until hot, then cook the wings, turning, for 5-6 minutes until charred all over. Transfer the wings to a large baking tray double-lined with foil, then finish in the oven for 30-40 minutes until cooked through.)"
      },
      {
        "Step 3": "Serve immediately with lime wedges and accompaniments."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/59.jpg"
  },
  {
    "id": "60",
    "title": "Chinese-style sticky pork ribs",
    "difficulty": "Medium",
    "portion": "Serves 6-8",
    "time": "Hands-on time 20 min, oven time 2½-3 hours, barbecuing/grilling time 15 min",
    "description": "Coated in a glaze – made from Chinese five-spice, honey and soy – then charred on the barbecue or grill, serve these stickiest-ever pork ribs for an eat-with-your-hands kind of dinner party.",
    "ingredients": [
      "2 x 8-rib racks British free-range pork belly ribs (sometimes known as baby back ribs)",
      "Glug sunflower oil",
      "1 onion, finely sliced",
      "1 tsp Chinese five-spice",
      "1 large thumb-size piece fresh ginger, grated",
      "3 garlic cloves, crushed",
      "2 tbsp hoisin sauce",
      "1½ tbsp rice vinegar",
      "1½ tbsp soy sauce",
      "1 tbsp clear honey",
      "1 tbsp tomato ketchup",
      "Toasted sesame oil, sesame seeds and thinly sliced red chilli and spring onion to serve"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C/140°C fan/gas 3. Put the racks in a large roasting tin, bone-side up, then cover with just-boiled water from the kettle and season well with salt. Place a sheet of baking paper on top of the ribs to keep the meat submerged in the liquid, then cover the tin tightly with foil. Put in the oven and cook for 2½-3 hours until the meat is very tender when pressed with a spoon. Lift the racks out of the water, pat dry with kitchen paper, then put on a board to cool a little."
      },
      {
        "Step 2": "Meanwhile, to make the glaze, heat the sunflower oil in a large frying pan. Add the onion and cook over a medium-high heat for 10 minutes, stirring often, until very soft and slightly caramelised. Add the five-spice, ginger and garlic, then cook for 3-4 minutes more until fragrant. Stir in the hoisin sauce, rice vinegar, soy, honey and ketchup, then transfer to a blender (or tip into a bowl and use a stick blender) and whizz until you have a smooth glaze. Reserve a ladleful for dipping."
      },
      {
        "Step 3": "Light a barbecue or heat a grill to high. Thickly brush the glaze all over the ribs, then cook for 15 minutes, turning twice and brushing on more glaze as you go, until the meat is caramelised and lightly charred. If you’re using the grill, put the ribs meat-side up in a baking tray and cook for the same amount of time without turning (brush with more glaze halfway through cooking)."
      },
      {
        "Step 4": "Serve the ribs drizzled with toasted sesame oil and scattered with sesame seeds, sliced chilli and spring onion, with the reserved glaze on the side for dipping."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/60.jpg"
  },
  {
    "id": "61",
    "title": "Pork, prawn and shiitake bean curd wraps",
    "difficulty": "Easy",
    "portion": "Serves 4 as a snack, 2 as a meal",
    "time": "Hands-on time 35 min",
    "description": "A dim sum inspired dish, without all the calories – Sophie Michell’s recipe makes for a light and tasty meal.",
    "ingredients": [
      "4 dried shiitake mushrooms (or dried wild mushrooms)",
      "150g British free-range pork mince",
      "100g peeled sustainable raw king prawns, finely chopped",
      "5cm piece fresh ginger, finely grated",
      "2 spring onions, finely chopped",
      "1 tbsp Chinese rice wine (or sherry)",
      "2 tbsp light soy sauce",
      "1 tsp cornflour",
      "2 bean curd sheets (about 40cm x 30cm each)",
      "50ml sweet sherry",
      "2 tbsp light soy sauce",
      "1 tsp cornflour"
    ],
    "method": [
      {
        "Step 1": "Begin by making the filling. Soak the shiitake mushrooms in a bowl of freshly boiled water for 10 minutes, then drain and reserve 100ml of the soaking water. Chop the mushrooms and put in a large mixing bowl. Add the pork mince and chopped prawns and mix together. Stir in the ginger, spring onions, Chinese rice wine (or sherry) and soy sauce, and sprinkle over the cornflour. Season with ground black pepper and mix well."
      },
      {
        "Step 2": "Boil the kettle and put the bean curd sheets on a baking tray. Pour the boiled water over and soak for 1 minute, then carefully drain off the water. Spread out the sheets separately on a clean work surface. Divide the filling in half, then form into 2 sausage shapes about 2.5cm wide and place them lengthways in the middle of each sheet. Roll the wrappers tightly around the fillings to make 2 large sausage shapes. Chop each into 4 equal pieces."
      },
      {
        "Step 3": "You can either bake or steam the wraps. To bake, heat the oven to 200°C/180°C fan/gas 6. Put the wraps on a baking tray, cover with foil and bake for 15 minutes. To steam, put them in a double-layer bamboo steamer over a pan of boiling water for 10 minutes."
      },
      {
        "Step 4": "Meanwhile, make the sauce. Put the reserved mushroom soaking water in a small saucepan with the sweet sherry and soy sauce. Stir, then simmer over a low heat for"
      },
      {
        "Step 5": "10 minutes. In a small bowl, mix the cornflour with a touch of cold water, then whisk into the sauce to thicken."
      },
      {
        "Step 6": "Put the wraps on a serving plate, drizzle over some sauce, then serve the rest in a small bowl. Eat with steamed Chinese greens, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/61.jpg"
  },
  {
    "id": "62",
    "title": "Quick sesame prawn, spring onion and radish stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min",
    "description": "Pull out your wok and rustle up this quick and easy Asian supper. Peanuts and fresh coriander give authentic finishing touches.",
    "ingredients": [
      "300g udon noodles",
      "1 tbsp vegetable oil",
      "2 large bunches spring onions, halved lengthways and cut into thirds",
      "3 garlic cloves, crushed",
      "20g fresh ginger, grated",
      "200g sustainable raw king prawns",
      "2 tbsp soy sauce",
      "1½ tbsp fish sauce",
      "300g radishes, quartered",
      "2 tbsp sesame seeds"
    ],
    "method": [
      {
        "Step 1": "In a large pan of simmering water, cook the noodles according to the packet instructions, then refresh under cold running water."
      },
      {
        "Step 2": "Heat the oil in a large wok over a high heat and fry the spring onions for 2-3 minutes, then add the garlic and ginger and fry for 1 minute more, stirring constantly. Add the prawns, soy sauce, fish sauce, radishes and sesame seeds, then fry for 3 minutes or until the prawns are all pink."
      },
      {
        "Step 3": "Add the noodles and cook until warmed through and coated in sauce. Serve with a handful of chopped coriander, a scattering of peanuts and lime wedges to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/62.jpg"
  },
  {
    "id": "63",
    "title": "Quick beef stir-fry with cabbage and coconut",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 25 min",
    "description": "If stir-fry is your midweek saviour, try this one-pan Asian wonder that combines steak with coconut and cabbage.",
    "ingredients": [
      "Sunflower oil",
      "2 British beef rump steaks (about 200g each)",
      "1 red onion, sliced",
      "½ red cabbage, shredded",
      "½ savoy cabbage, shredded",
      "Juice 2 limes, plus wedges to serve ",
      "3 tbsp soy sauce",
      "2 tbsp sriracha (or other chilli sauce)",
      "90g fresh coconut, in chunks",
      "Bunch fresh coriander",
      "Drizzle toasted sesame oil"
    ],
    "method": [
      {
        "Step 1": "Heat a large frying pan or wok over a high heat with a splash of oil. When the pan is searing hot, fry the steaks for 2½ minutes on each side, then slice and set aside. "
      },
      {
        "Step 2": "Add more oil to the pan and fry the onion for 2 minutes, then add the cabbages and stir-fry for 5 minutes. Add the lime juice, soy sauce, chilli sauce, half the coconut and half the coriander to the pan. Add the beef and any juices, then stir in the remaining coriander and sprinkle with the remaining coconut."
      },
      {
        "Step 3": "Serve with lime wedges, the remaining coriander and a drizzle of sesame oil, if you like. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/63.jpg"
  },
  {
    "id": "64",
    "title": "Duck pancakes with quick-pickled spring onions",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 30 min, oven time 8 min",
    "description": "These savoury pancakes, filled with crunchy pickled spring onions, perfectly cooked duck and hoisin sauce, are all the right levels of sweet, salty, tangy and crunchy.",
    "ingredients": [
      "2 x 180g free-range duck breasts",
      "4 large Chinese lettuce leaves",
      "Hoisin sauce to serve",
      "75ml rice vinegar (or cider vinegar)",
      "50g caster sugar",
      "4 spring onions, finely shredded",
      "¼ cucumber, finely shredded",
      "50g beansprouts",
      "160ml milk",
      "2 large free-range eggs",
      "80g rice flour",
      "4 spring onions, very finely chopped",
      "½ tsp toasted sesame oil",
      "Sunflower oil for frying"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C/160°C fan/gas 4. For the quick-pickled spring onions, put the vinegar and sugar in a small pan over a low heat, then stir to dissolve the sugar. Add the shredded spring onions and cucumber and the beansprouts, then take off the heat and leave to cool."
      },
      {
        "Step 2": "Meanwhile, pat the duck skin dry with kitchen paper and season well with salt and pepper. Put a dry frying pan over a high heat and, when hot, fry the duck breast, skin-side down, for 5 minutes or until the skin crisps. Turn and fry on the other side for 30 seconds."
      },
      {
        "Step 3": "Transfer the duck breasts to a baking tray, skin-side up, and cover loosely with foil. Roast for 8 minutes for medium-rare (11 if you prefer well done). Take out of the oven and put the duck on a board to rest."
      },
      {
        "Step 4": "For the pancakes, whisk all the ingredients (except the sunflower oil) in a mixing bowl, then season with salt and pepper."
      },
      {
        "Step 5": "Heat a drizzle of sunflower oil in a large frying pan over a medium heat. Ladle in quarter of the batter and fry for 1 minute on each side until golden. Transfer to a plate. Repeat with the remaining batter to make 4 pancakes."
      },
      {
        "Step 6": "Slice the rested duck breasts. Lay one large Chinese lettuce leaf in the centre of each of the pancakes, then top with the quick-pickled spring onions and duck, pouring over any resting juices. Serve with hoisin sauce and the leftover pickle juice to spoon over, then wrap up to eat."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/64.jpg"
  },
  {
    "id": "65",
    "title": "Chinese chicken with noodles",
    "difficulty": "Medium",
    "portion": "Serves 6",
    "time": "Hands-on time 50 min, oven time 1 hour 30 min",
    "description": "A restorative and soul-warming broth recipe made with fresh ginger, spring onions and the juiciest chicken.",
    "ingredients": [
      "1 whole free-range chicken (around 1.8kg)",
      "100ml kecap manis (from the world food aisle of large supermarkets)",
      "100ml light soy sauce (use a reduced-salt version if you prefer)",
      "100ml dark soy sauce (see above)",
      "80g brown sugar",
      "3 star anise",
      "80ml dry sherry such as fino",
      "80g fresh ginger, thickly sliced",
      "500ml fresh chicken stock",
      "Flavourless oil for frying",
      "1 large onion, finely chopped",
      "3 garlic cloves, sliced",
      "180g dried fine egg noodles (we like Blue Dragon)",
      "150g shredded kale",
      "4 spring onions, finely sliced",
      "Large bunch fresh coriander, roughly chopped, plus extra to garnish",
      "Lime wedges to serve"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 150°C/130°C fan/gas 2. Put all the ingredients for the chicken stock into a deep ovenproof lidded casserole that will comfortably fit the chicken. Add 350ml water and bring to the boil, stirring to dissolve the sugar. Put the chicken into the casserole breast-side down."
      },
      {
        "Step 2": "Bring back to the boil, cover with the lid, then transfer to the oven and cook for 45 minutes. Carefully flip the chicken over and cook for another 45 minutes, then remove and leave to rest on a lipped chopping board. Strain the stock (discard what’s left behind in the sieve), then return the liquid to the pan and bubble over a high heat for 5 minutes to reduce slightly. Taste the stock: it might need a splash more sherry to balance the sweet and salty flavours. Leave on a gentle simmer while you make the noodles."
      },
      {
        "Step 3": "Heat a large glug of oil in a large frying pan over a medium heat. Add the onion and garlic, then cook for 7 minutes until translucent and turning a little golden at the edges."
      },
      {
        "Step 4": "Meanwhile, boil the noodles for about 4 minutes or according to the packet instructions, then drain and rinse under warm running water to prevent them sticking."
      },
      {
        "Step 5": "Add the kale to the frying onions with a small splash of water and cook for 3 minutes, then add the noodles, spring onions and coriander and cook for a minute or two until everything is hot and combined. Strip the chicken meat from the carcass, then divide among bowls. Add the noodles, pour over the stock and serve with extra coriander leaves and lime wedges."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/65.jpg"
  },
  {
    "id": "66",
    "title": "Seared Asian-style beef and stir-fried savoy cabbage",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 30 min",
    "description": "Mix savoy cabbage with seared steak and Asian ingredients for a quick, easy dinner that’s full of flavour.",
    "ingredients": [
      "400g British onglet (also called hanger or skirt) or sirloin steak",
      "2 tbsp soy sauce",
      "½ tbsp sunflower oil, plus extra",
      "1 onion, sliced",
      "2 garlic cloves, sliced",
      "½ star anise",
      "Thumb-size piece fresh ginger, coarsely grated",
      "1 red chilli, finely sliced",
      "30g unsalted roasted peanuts, roughly chopped",
      "1 small or ½ medium savoy cabbage (outer leaves discarded), shredded, wilted in a colander with a kettle of boiling water and left to steam",
      "1 tbsp fish sauce",
      "Juice 1 lime, plus extra wedges to serve",
      "Small bunch each fresh coriander and thai basil (or mint), roughly chopped, plus extra to serve"
    ],
    "method": [
      {
        "Step 1": "Put the steak in a shallow dish and pour over the soy sauce. Heat a large frying pan or wok over a high heat. Pour in the oil and swirl the pan to coat. Add the onion and stir-fry for 2-3 minutes until softened. Turn the heat to medium and add the garlic, then stir-fry for 1 minute until the raw smell fades – keep it moving or it will burn. Remove the pan from the heat and set aside."
      },
      {
        "Step 2": "Heat a heavy-based frying pan over a high heat. Remove the steak from the dish (reserve the soy sauce) and rub with oil. When the pan is smoking hot, add the steak and cook for 2 minutes on each side for medium-rare, pressing down to flatten so it crisps and caramelises. Once cooked to your liking, remove to a plate and set aside to rest."
      },
      {
        "Step 3": "Return the first pan/wok to a high heat and, once the onions sizzle again, add the star anise and ginger, then stir-fry for 2 minutes. Once fragrant, add the chilli and peanuts, then stir-fry until the peanuts start to colour. Add the wilted cabbage and stir-fry for 5 minutes or until the cabbage has coloured a little."
      },
      {
        "Step 4": "Pour in half the soy sauce from the steaks (discard the rest) and the fish sauce, then squeeze in the lime and cook for 2 minutes. Scatter over the herbs and stir. Taste and season. Divide between 2 plates. Slice the steak and put on top of the stir-fry, pouring any resting juices on top. Serve immediately with lime wedges."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/66.jpg"
  },
  {
    "id": "67",
    "title": "Poached wontons in chilli-garlic sauce",
    "difficulty": "Easy",
    "portion": "Serves 4-6 as a starter",
    "time": "Hands-on time 1 hour 15 min",
    "description": "Chef Bing Luo from London’s Shard shares his recipe for these winter-warming wontons in chilli-garlic sauce.",
    "ingredients": [
      "250g plain flour, plus extra to dust",
      "1 medium free-range egg, beaten",
      "75ml cold water",
      "½ tsp fine sea salt",
      "100g free-range pork mince (see Chef’s Tips For Success)",
      "3g fine sea salt",
      "Pinch ground white pepper",
      "10g grated fresh ginger",
      "1 tsp light soy sauce",
      "1 tsp toasted sesame oil",
      "2 medium free-range eggs",
      "2 tbsp light soy sauce",
      "1 tbsp toasted sesame oil",
      "1 garlic clove, finely chopped",
      "1 tbsp chilli oil",
      "1½ tsp chinkiang vinegar (see Know-how)",
      "2 tbsp fresh chicken stock or water",
      "Sliced red chilli and fresh coriander to serve (optional)",
      "A pasta machine for rolling"
    ],
    "method": [
      {
        "Step 1": "For the wonton dough, sift the flour into a large mixing bowl. Add the egg and cold water and bring it together with your hands. It will take a while as there isn’t much water in the recipe – the drier the dough, the better (see Chef’s Tips for Success). If the dough really won’t come together, add 1 tbsp water – it should be quite dry and ragged."
      },
      {
        "Step 2": "Knead the dough for 5-10 minutes until smooth. Using a rolling pin, roll out the dough into a rough rectangle, then fold it up several times and roll into a rectangle again. Do this 4 times to give a smooth dough, then roll it thin enough to go through a pasta machine – about 5mm thick."
      },
      {
        "Step 3": "Cut the dough into 3 equal pieces to fit through the pasta machine. Roll the dough through the machine several times. Run twice through on the widest setting, then twice through on the next setting down and so on, to the second thinnest setting (1-2mm). Cut the dough in half if it gets too long and unmanageable."
      },
      {
        "Step 4": "Dust the work surface with flour, then use a palette knife or ruler as a guide (Bing uses a thin rolling pin here) and cut the dough into 10cm squares using a sharp knife. Discard any leftover pastry. Cover the squares in cling film."
      },
      {
        "Step 5": "Put all the filling ingredients into a medium bowl and whizz to a thick pulp using a stick blender. To make the sauce, combine all the ingredients in a bowl and mix well."
      },
      {
        "Step 6": "Hold a wonton with a corner pointing at your body. Use a teaspoon (Bing uses a Chinese spatula here) to put a marble-size dollop of filling onto the centre of the wonton. Fold roughly in half towards you to make a triangle – don’t line the edges up perfectly. Wet the top of one of the narrow corners. In one move, use your finger to gently push in the centre of the filling [J] as you bring the narrow corners together, making sure the wide corner pointing at you flips up. Press the dry narrow corner onto the wet narrow corner to form a dumpling. Set aside while you make the rest (see tips)."
      },
      {
        "Step 7": "Cook the dumplings in batches= in a pan of boiling water for 6 minutes (see Tips for Success), then carefully remove with a slotted spoon."
      },
      {
        "Step 8": "Put 4-5 dumplings in each bowl, splash with a little of the dressing and top with sliced red chilli and fresh coriander, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/67.jpg"
  },
  {
    "id": "68",
    "title": "Bao buns with braised shortrib and pickled daikon",
    "difficulty": "Easy",
    "portion": "Makes about 32 buns",
    "time": "Hands-on time 1 hour, oven time 3-3½ hours, plus resting, rising and proving",
    "description": "Rich, tender beef shortrib is balanced by sharp pickles in this authentic bao bun recipe by Erchen Chang, co-founder of London restaurant Bao. Try preparing them for a special occasion, such as Chinese New Year.",
    "ingredients": [
      "300g plain flour, plus extra to dust",
      "4g fast-action dried yeast",
      "140ml lukewarm milk or water",
      "500g plain flour",
      "60g caster sugar",
      "½ tsp salt",
      "10g fast-action dried yeast",
      "½ tsp baking powder",
      "20ml sunflower oil, plus extra to grease and for brushing",
      "290ml lukewarm milk or water",
      "Sunflower oil for frying",
      "1.5kg British beef shortribs, ribs separated",
      "6 garlic cloves",
      "1 large onion, quartered",
      "5 tbsp soy sauce",
      "1½ tbsp Chinese rice wine vinegar",
      "240ml shaoxing wine",
      "Few pinches caster sugar (to taste)",
      "1 small daikon, peeled",
      "2 medium carrots, peeled",
      "100ml Chinese rice wine vinegar",
      "50g caster sugar",
      "1 tsp salt",
      "Mayo and chopped coriander leaves",
      "Bamboo or metal steamer"
    ],
    "method": [
      {
        "Step 1": "To make the old dough, combine the dry ingredients in a bowl with a tiny pinch of salt, make a well in the centre and mix in the milk/water. Put on a lightly floured work surface and knead for 3-4 minutes until soft. Return to the cleaned bowl, cover with a clean tea towel or cling film and leave to rise in a warm place for at least 3 hours."
      },
      {
        "Step 2": "When the old dough has risen, make the new dough in the same way, adding the oil and milk/water to the dry ingredients. As the dough comes together it will look much drier than the old dough, but keep pushing it around the bowl to pick up any loose flour. Tip out onto a lightly floured surface and knead until fairly smooth. Tip the old dough on top of the new one and knead together for 3-4 minutes until combined and soft. Put the dough in a large oiled mixing bowl. Lightly grease a piece of cling film and cover the bowl. Leave in a warm place to rise while you make the filling and quick- pickled veg (see tips)."
      },
      {
        "Step 3": "Meanwhile, put a large frying pan over a high heat. When hot, add a good glug of sunflower oil. Fry the shortribs for 1-2 minutes, turning, until browned. Put in a deep roasting tin that fits the ribs snugly. Quickly brown the garlic and onion for 2-3 minutes in the frying pan, tossing regularly, then tip over the ribs."
      },
      {
        "Step 4": "Heat the oven to 170°C/150°C fan/gas 3½. Mix the soy sauce, vinegar and shaoxing, then pour into the roasting tin. Add enough water to come a quarter of the way up the ribs. Cover the tin tightly with foil, then roast for 3-3½ hours until tender."
      },
      {
        "Step 5": "While the beef is cooking, grate/shred the daikon and carrots using a food processor or box grater. Combine the vinegar, sugar, salt and 50ml cold water in a bowl. Mix the daikon and carrot with the pickling juice, then cover and leave for at least an hour at room temperature. Drain off the liquid, squeeze out any excess, then return to the bowl and chill until needed."
      },
      {
        "Step 6": "Once the ribs are cooked, remove the foil and set the ribs aside. Pour the liquid into a pan and reduce over a high heat for 10 minutes until syrupy and strongly flavoured (add a couple of pinches of sugar if you think it needs it). Carve the meat from the ribs (discard the bones), then toss with some sauce and keep covered with foil somewhere warm."
      },
      {
        "Step 7": "Roll the dough into a sausage shape on a lightly floured work surface. Cut into lengths and shape into 32 balls, roughly the size of golf balls. Flatten into ovals with a rolling pin, brush with oil, then fold in half over the thick end of a chopstick to give a small gap. Remove the chopstick, twirling it round as you go to increase the size of the hole a little, then leave to prove in a warm place, loosely covered with a tea towel, for 15 minutes or so. The buns will swell."
      },
      {
        "Step 8": "Put a steamer over a large pan containing 5cm water (make sure the water doesn’t touch the steamer). Put over a medium heat and bring to the boil. Put in a batch of buns, put the lid on and steam for 15 minutes. Keep the cooked ones warm under foil while you steam the others."
      },
      {
        "Step 9": "To assemble, open each bun and spread mayo on the bottom half. Put some meat on top, then spoon over more sauce. Top with the pickle and a sprinkle of chopped coriander leaves, then eat immediately."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/68.jpg"
  },
  {
    "id": "69",
    "title": "Hainanese chicken rice",
    "difficulty": "Medium",
    "portion": "Serves 4-6",
    "time": "hands-on time 45 min, simmering time 1 hour 45 min, plus cooling",
    "description": "Goz Lee shares his Grandma’s recipe of this Hainan and Singapore-inspired chicken rice – it’s full of flavour with chillies, ginger and garlic.",
    "ingredients": [
      "1 free-range chicken, around 1.5kg",
      " 2 tbsp toasted sesame oil, plus extra to drizzle",
      "10cm fresh ginger, thinly sliced",
      "1 garlic bulb, bashed to separate",
      "4 spring onions",
      "Sliced cherry tomatoes, cucumber and fresh coriander to garnish",
      "2 tbsp vegetable oil",
      "1 tsp toasted sesame oil",
      "5cm fresh ginger, finely chopped",
      "½ garlic bulb, cloves finely chopped",
      "300g jasmine rice",
      "8 red chillies, stems removed",
      "2 bird’s eye chillies, stems removed",
      "1⁄2 garlic bulb, cloves halved",
      "5cm fresh ginger",
      "Juice 1 lime, plus extra to taste",
      "1 tbsp vegetable oil",
      "Soy sauce and sugar to taste"
    ],
    "method": [
      {
        "Step 1": "Rub salt into the chicken skin and cavity. Drizzle 1 tbsp sesame oil into the cavity and rub 1 tbsp on the skin. Put the ginger, garlic and spring onions in the cavity of the chicken."
      },
      {
        "Step 2": "Put the chicken in a large pot and cover with cold water. Bring to the boil, then simmer for 15 minutes. Turn off the heat, cover the pot and let the chicken poach for 35-40 minutes."
      },
      {
        "Step 3": "Remove the chicken and pierce with a sharp knife in the thigh – the fibres should be set and visible, not gelatinous. If they’re not, poach for 10-15 minutes more. Remove (reserve the poaching liquid), take the solids out of the cavity and put them in the poaching liquid. Set the chicken on a plate to cool slightly. Discard the skin and remove the meat (set aside), then put the bones into the poaching liquid and simmer until reduced by half to a stock. Taste, season, strain, then return to the pan and keep warm."
      },
      {
        "Step 4": "For the rice, heat the oils in a wok or large pan, then fry the ginger and garlic for 3 minutes. Add the rice and stir-fry for 5-7 minutes to coat."
      },
      {
        "Step 5": "Put the rice in a pan and cover with 600ml of the stock (keep the rest hot). Bring to the boil, then cover and cook gently for 15 minutes until the rice is tender and the liquid is absorbed."
      },
      {
        "Step 6": "For the chilli sauce, pound the chillies, garlic, ginger, lime juice and oil in a pestle and mortar or whizz in a mini food processor to a paste. Add 175ml hot chicken stock, a dash of soy sauce and 1 tsp sugar, then taste. Add more soy, sugar or lime juice if needed."
      },
      {
        "Step 7": "To serve, chop the reserved chicken meat and arrange on a plate with the rice and salad garnish. Drizzle soy sauce and sesame oil over the chicken. Serve with the chilli sauce and remaining stock (in bowls as a chicken broth)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/69.jpg"
  },
  {
    "id": "70",
    "title": "Five-spice chicken skewers with speedy chow mein",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Ready in 20 minutes",
    "description": "This quick Chinese chicken recipe packs a lot of flavour, and it’s ready in under 30 minutes.",
    "ingredients": [
      "2 tsp Chinese five-spice powder",
      "3 tbsp hoisin sauce",
      "2 tbsp tomato ketchup",
      "400g free-range chicken breast, cut into chunks",
      "Bunch of spring onions",
      "1 tbsp sunflower oil",
      "300g fresh egg noodles",
      "300g beansprouts",
      "2 tbsp light soy sauce"
    ],
    "method": [
      {
        "Step 1": "Preheat the grill. In a bowl, mix the five-spice powder, 2 tbsp hoisin sauce, the ketchup and chicken. Thread the chicken onto 8 skewers and grill for 15 minutes until cooked through, turning once or twice."
      },
      {
        "Step 2": "Meanwhile, thinly slice the spring onions and heat the oil in a wok."
      },
      {
        "Step 3": "Put the spring onions, noodles and beansprouts into the hot wok and stir-fry over a high heat for 4-5 minutes until heated through. Season with soy sauce and the remaining hoisin sauce and divide among 4 bowls. Serve each bowl with 2 chicken skewers."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/70.jpg"
  },
  {
    "id": "71",
    "title": "Asian-style marinated pork neck with pickled carrots",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min, plus marinating",
    "description": "Our Asian-style recipe with a sharp carrot pickle really elevates this cheap cut of pork to a new level.",
    "ingredients": [
      "2 crushed garlic cloves",
      "2 tbsp soft brown sugar",
      "2 tbsp fish sauce",
      "Juice of 1½ limes",
      "2 tbsp shaoxing rice wine",
      "800g British free-range pork neck (or leg)",
      "4 carrots",
      "80ml white wine vinegar",
      "50g caster sugar",
      "1 star anise",
      "Steamed rice to serve"
    ],
    "method": [
      {
        "Step 1": "Put the garlic in a bowl with the sugar, fish sauce, lime juice rice wine. Stir to combine. "
      },
      {
        "Step 2": "Cut the pork neck into large chunks and put in a plastic bag or bowl. Cover with the marinade, toss to coat, then tie (or cover) and leave for 45 minutes – or overnight in the fridge."
      },
      {
        "Step 3": "Peel the into ribbons. Gently heat 150ml water, the vinegar and sugar with the star anise until the sugar dissolves. Put the carrots in a bowl and pour over the pickling liquid. Cover and chill."
      },
      {
        "Step 4": "Heat a griddle pan on a high heat until smoking, then griddle the pork, in batches, for 4-5 minutes until cooked through (see tips). Serve with the drained, squeezed carrots and steamed rice (stir in toasted cashew nuts and fresh coriander, if you like)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/71.jpg"
  },
  {
    "id": "72",
    "title": "Stir-fried red rice",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 40",
    "description": "A healthy vegetarian stir-fried rice recipe inspired by the staple Asian dish.",
    "ingredients": [
      "200g red, brown or other wholegrain rice",
      "1 tbsp coconut oil or extra-virgin olive oil, or ghee (clarified butter)",
      "Large handful chestnut, button or oyster mushrooms, halved",
      "1 large carrot, cut into matchsticks",
      "2 spring onions, sliced",
      "½ bok choy or large handful spinach, thinly sliced",
      "2 medium free-range eggs, beaten",
      "60g raw cashew nuts, toasted in a dry pan until fragrant, to serve",
      "Large handful fresh Thai basil (or regular basil) to serve"
    ],
    "method": [
      {
        "Step 1": "Rinse the rice and put in a pan with 500ml water. Bring to the boil, turn the heat to low-medium, cover and cook gently for 25-30 minutes. Drain thoroughly, then set aside for 10 minutes, uncovered, to steam dry (see recipe introduction)."
      },
      {
        "Step 2": "Heat the oil or ghee in a frying pan, then add the mushrooms and vegetables. Stir-fry for 2 minutes (see recipe introduction), season with salt and pepper, then add the rice and fry for another minute. Add the eggs and stir until scrambled. Scatter with cashew nuts and Thai basil, then serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/72.jpg"
  },
  {
    "id": "73",
    "title": "Spiced brisket with chilli, lime, peanut and coriander",
    "difficulty": "Easy",
    "portion": "Serves 6-8",
    "time": "Hands-on time 30 min,oven time 5 hours 50 min",
    "description": "Try our slow-cooked beef brisket recipe made with a fresh ginger, chilli and Chinese five-spice sauce. An impressive main served with roast potatoes or steamed rice and greens.",
    "ingredients": [
      "2 tbsp vegetable oil",
      "400g shallots, quartered",
      "5 garlic cloves, crushed",
      "500ml good quality beef stock",
      "200ml clear honey",
      "2kg British beef brisket",
      "Steamed jasmine rice to serve",
      "250ml shaoxing rice wine (from the world food section of large supermarkets)",
      "70ml light soy sauce",
      "70ml dark soy sauce",
      "100g fresh ginger, finely chopped",
      "1 tbsp chinese five-spice powder",
      "2 large red chillies, halved",
      "Vegetable oil for frying",
      "150g unsalted peanuts",
      "2 red chillies, sliced",
      "Large handful fresh coriander, roughly chopped",
      "3 limes, cut into wedges"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 140°C/fan120°C/gas 1. Heat the oil in a large, deep frying pan. Add the shallots and fry for 5 minutes or until beginning to colour. Stir in the garlic and cook for 1 minute, then add the beef stock and spoon in 100ml of the honey. Heat for a further minute."
      },
      {
        "Step 2": "Mix all the sauce ingredients in a jug. Untie the brisket and put it in a deep roasting tin, then pour over the sauce along with the stock mixture. Cover the meat with a layer of baking paper, then cover the tin with 2 layers of foil, folding the edges around. Put on the oven’s middle shelf."
      },
      {
        "Step 3": "After 2½ hours, lift the foil and paper, turn over the brisket and baste with the juices. Return to the oven, resealed inside the paper and foil, for another 2½ hours."
      },
      {
        "Step 4": "Once the brisket has had its full cooking time and is tender (see tips), remove from the oven and turn the heat up to 220°C/fan200°C/gas 7. Carefully pour all the juices from the roasting tin into a deep frying pan. Set the frying pan over a high heat and bubble for 20 minutes or until the juices are reduced. Taste and season with salt and pepper."
      },
      {
        "Step 5": "Spoon 2 ladlefuls of the reduced sauce over the brisket, then drizzle over the remaining honey. Return to the oven for 15 minutes or until the outside of the brisket has caramelised and turned crisp."
      },
      {
        "Step 6": "For the topping, heat a little vegetable oil in a large frying pan and lightly toast the peanuts. Leave to cool slightly, then roughly chop and mix with the chillies and coriander. Serve the brisket with a good squeeze of lime juice, topped with the peanuts, chillies, coriander and lime wedges, and some steamed jasmine rice."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/73.jpg"
  },
  {
    "id": "74",
    "title": "Duck pancakes with pickled carrot salad",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 20 min",
    "description": "Pick up duck breasts, hoisin sauce and Chinese pancakes for this shortcut supper recipe. A simple take on a popular Chinese dish.",
    "ingredients": [
      "175g Gressingham duck mini fillets, from Waitrose, or similar",
      "2 tbsp hoisin sauce",
      "10 Waitrose Wafer Thin Soft Chinese Pancakes, or similar",
      "4 small or 2 medium carrots",
      "Bunch fresh coriander",
      "1 red chilli",
      "3 tbsp rice vinegar",
      "1 tbsp caster sugar",
      "1 tbsp toasted sesame oil",
      "Spring onions and cucumber"
    ],
    "method": [
      {
        "Step 1": "Use a vegetable peeler to peel the carrots into ribbons; put them in a large bowl. Finely chop most of the coriander, keeping a few leaves to garnish. Deseed and finely chop the chilli. Mix the coriander, chilli, rice vinegar and caster sugar together in a bowl or jug, then pour over the carrots and toss."
      },
      {
        "Step 2": "Heat the sesame oil in a frying pan, then add the duck and fry for 3-4 minutes until the meat has some colour but is still pink in the middle. Add the hoisin sauce, then take off the heat."
      },
      {
        "Step 3": "Heat the pancakes according to the pack instructions. Shred the spring onions and cucumber."
      },
      {
        "Step 4": "Taste and season the carrots and sprinkle over the reserved coriander leaves, then serve with the pancakes, duck, spring onions and cucumber, with extra hoisin sauce on the side, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/74.jpg"
  },
  {
    "id": "75",
    "title": "Chinese noodles with mushrooms",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min",
    "description": "This aromatic Chinese noodle recipe is made with fresh garlic, chilli, ginger and mixed mushrooms – an easy autumnal dinner.",
    "ingredients": [
      "75ml vegetable stock",
      "3 tbsp shaoxing rice wine",
      "3 tbsp soy sauce",
      "1 tsp caster sugar",
      "2 garlic cloves",
      "1 red chilli",
      "2cm fresh ginger",
      "450g mixed mushrooms, such as oyster, shiitake and enoki",
      "300g egg noodles, or use ready- cooked",
      "Sliced spring onions, to serve, optional",
      "Toasted sesame oil to serve, optional"
    ],
    "method": [
      {
        "Step 1": "Combine the vegetable stock, shaoxing rice wine, soy sauce and caster sugar in a small bowl and set aside. Slice the garlic cloves and red chilli and grate the ginger."
      },
      {
        "Step 2": "Heat a wok or large frying pan over a high heat with a splash of vegetable oil, then add the sliced garlic and chilli, and the grated ginger. Stir-fry for 30 seconds, then add the mushrooms. Stir-fry until they start to take on a little colour, then add the vegetable stock mixture and cook for 1 minute."
      },
      {
        "Step 3": "Meanwhile, cook the noodles in boiling water according to the packet instructions. Drain and toss through the mushroom mixture. Serve immediately, sprinkled with spring onions and a drizzle of toasted sesame oil, if using."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/75.jpg"
  },
  {
    "id": "76",
    "title": "Peanut, sesame and ginger noodles with wild Alaskan salmon",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 25 min",
    "description": "A quick and easy salmon recipe, served with peanut and sesame noodles is big on fresh flavours.",
    "ingredients": [
      "2 frozen skinless salmon fillets (we like wild Alaskan salmon, widely available)",
      "2 tsp toasted sesame oil",
      "1 tsp peanut butter",
      "2 tbsp ginger paste (or grated fresh ginger)",
      "Juice 1 lime, plus wedges to serve",
      "2 tbsp dark soy sauce",
      "300g ready-cooked egg noodles",
      "1 red chilli",
      "4 spring onions",
      "Bunch fresh coriander"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C/fan160°C/gas 4. Put the frozen salmon fillets on a baking tray, cover tightly with foil, then bake for 15 minutes or until cooked through, turning over after 8 minutes."
      },
      {
        "Step 2": "Meanwhile, whisk half the sesame oil with the peanut butter, ginger paste, lime juice and soy sauce in a bowl."
      },
      {
        "Step 3": "Heat the remaining oil in a large wok, then add the noodles with a splash of water. When the noodles are heated through, take the wok off the heat and dress the noodles in the sauce."
      },
      {
        "Step 4": "Deseed the chilli and slice into strips. Slice the spring onions and coarsely chop the coriander."
      },
      {
        "Step 5": "Remove the salmon from the oven, then flake it through the hot noodles with the chilli, spring onions and coriander. Serve with lime wedges for squeezing over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/76.jpg"
  },
  {
    "id": "77",
    "title": "Prawn and herb lettuce cups with ginger dressing",
    "difficulty": "Easy",
    "portion": "6-8",
    "time": "Hands-on time 30 min, plus chilling",
    "description": "These delicate Chinese-inspired prawn and herb lettuce cups make an elegant starter or nibble with drinks.",
    "ingredients": [
      "2 little gem lettuce hearts",
      "2 tbsp rapeseed oil",
      "1 tsp finely chopped garlic",
      "1 tsp finely chopped fresh ginger",
      "50ml shaoxing rice wine (from the world food aisle of large supermarkets and Asian food shops)",
      "8 water chestnuts from a tin, drained and very finely chopped",
      "400g sustainably sourced peeled king prawns, chopped into small pieces",
      "3 spring onions, sliced",
      "15 fresh mint leaves, roughly chopped",
      "Handful fresh coriander, roughly chopped",
      "4cm fresh ginger, cut into thin sticks",
      "1 tbsp Chinese black vinegar (also sold as chinkiang vinegar, from the world food aisle of large supermarkets and Asian food shops)",
      "2 tbsp soy sauce"
    ],
    "method": [
      {
        "Step 1": "Pull the little gem lettuce hearts apart to give 12-16 cupped leaves that are large enough to fill. Cut off the roots to make it easier to separate the leaves neatly, if you like. Put on a plate, then chill in the fridge while you prepare the prawn filling (see tip)"
      },
      {
        "Step 2": "Mix all the dressing ingredients in a bowl with 1 tbsp water. Set aside at room temperature until ready to serve (see tip)"
      },
      {
        "Step 3": "Heat a large heavy-based, non-stick frying pan. Add the oil, then fry the garlic and ginger over a medium heat for 2-3 minutes or until fragrant – don’t let them burn or they’ll taste bitter. Add the rice wine and chopped water chestnuts to the pan, then bubble until almost all the liquid has evaporated. Add the chopped prawns, stir well and cook over a high heat for 1-2 minutes until completely pink and cooked through."
      },
      {
        "Step 4": "Transfer the prawn mixture to a medium bowl, then sprinkle over the spring onions and herbs and briefly mix."
      },
      {
        "Step 5": "Remove the lettuce leaves from the fridge and fill each with a heaped tablespoon of the prawn mixture. Arrange on a large serving platter, then serve straightaway while still crisp, with the ginger dressing to spoon over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/77.jpg"
  },
  {
    "id": "78",
    "title": "Chicken and egg fried rice",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "Chicken and eggs, along with a handful of store cupboard staples, make this budget-friendly fried rice recipe as satisfying as it is easy.",
    "ingredients": [
      "300g basmati rice",
      "2-3 free-range chicken thighs (depending on size)",
      "2 onions",
      "3 garlic cloves",
      "3 large free-range eggs",
      "3 tbsp olive oil",
      "2 tbsp soy sauce",
      "1 tbsp rice vinegar",
      "2 tsp fish sauce",
      "Handful fresh coriander"
    ],
    "method": [
      {
        "Step 1": "Cook the rice according to the pack instructions until al dente (10-15 minutes). Drain, rinse to cool, then tip onto kitchen paper and pat dry. Meanwhile, cut the skin and bone from the chicken (and discard), then slice the meat. Slice the onions, crush the garlic and lightly beat the eggs."
      },
      {
        "Step 2": "Heat the oil in a wok or big frying pan, then stir-fry the chicken over a high heat for 3-4 minutes until just browned. Add the onions and garlic, then reduce the heat to low-medium. Cook, stirring, for 5-6 minutes, then add the eggs. Leave for a few seconds to set a little, then stir with a spatula to break up the egg."
      },
      {
        "Step 3": "Add the rice and stir-fry over a high heat for 5 minutes or until the rice is piping hot, the chicken is cooked and everything is lightly browned. Stir in the soy sauce, vinegar and fish sauce, then check the seasoning. Divide among bowls and serve straightaway, topped with leaves picked from the coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/78.jpg"
  },
  {
    "id": "79",
    "title": "Sticky spiced soy meatballs with spinach rice",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Takes 10 min to make, 35 min to cook",
    "description": "An easy and cheap pork recipe for four people that tastes great and costs less than a fiver.",
    "ingredients": [
      "3 tbsp olive oil",
      "1 red onion, finely chopped",
      "2 garlic cloves, finely chopped",
      "2cm fresh ginger, grated",
      "1 red chilli, finely chopped",
      "2 tsp Chinese five-spice powder",
      "400g free-range British sausagemeat or pork mince",
      "300g basmati rice",
      "2 large handfuls of frozen spinach (about 250g), defrosted, as much water squeezed out as possible",
      "1 tbsp honey",
      "3 tbsp soy sauce"
    ],
    "method": [
      {
        "Step 1": "Heat 2 tbsp of the oil in a frying pan over a medium heat and gently fry the onion for 10 minutes until soft and translucent. Add the garlic, ginger, chilli and five-spice powder, then fry for 2 minutes. Allow to cool."
      },
      {
        "Step 2": "Put the meat in a bowl and add the cooled onion mixture. (If using pork mince, season well.) Mix with your hands, then shape into 16 small, evenly sized meatballs."
      },
      {
        "Step 3": "Cook the rice according to the pack instructions, adding the spinach just before the end of the cooking time. Drain and set aside, then stir the spinach into the rice."
      },
      {
        "Step 4": "Meanwhile, heat the remaining oil in the pan over a medium heat and fry the meatballs for 10 minutes, turning occasionally, until golden on all sides and cooked through. Add the honey, soy sauce and a splash of water, then cook for 2 minutes until sticky. Serve the meatballs on the spinach rice with the juices spooned over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/79.jpg"
  },
  {
    "id": "80",
    "title": "Soy-glazed chicken salad",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Ready in 20 minutes",
    "description": "This vibrant healthy chicken recipe is quick to make and a true crowd-pleaser. The recipe also works well with duck.",
    "ingredients": [
      "3 free-range skinless chicken breasts",
      "3 tbsp soy sauce",
      "2 tbsp honey",
      "2 tbsp toasted sesame oil",
      "1 cucumber, deseeded and sliced into half-moons",
      "4 carrots, sliced into fine strips",
      "Large handful each of fresh coriander and fresh mint, leaves picked",
      "4 little gem lettuces, torn",
      "1 tbsp groundnut or vegetable oil",
      "Juice of 2 limes",
      "1 tbsp fish sauce",
      "Sesame seeds to serve"
    ],
    "method": [
      {
        "Step 1": "Put the chicken between two pieces of cling film, then flatten with a meat mallet or rolling pin until 1-1.5cm thick. Put the chicken in a shallow dish with the soy, honey and 1 tbsp of the sesame oil. Leave for 10 minutes. "
      },
      {
        "Step 2": "Meanwhile, prepare the salad. Put the cucumber, carrots, herbs and lettuces in a large serving bowl or on a platter, then set aside."
      },
      {
        "Step 3": "Heat the groundnut/vegetable oil in a frying pan over a high heat, then fry the marinated chicken for 2 minutes on each side until cooked through and glazed. Remove from the heat, cool a little, then slice into strips."
      },
      {
        "Step 4": "In a small bowl or jug, mix the lime juice, fish sauce and remaining sesame oil. Add the chicken and dressing to the salad and toss to combine, then sprinkle with sesame seeds and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/80.jpg"
  },
  {
    "id": "81",
    "title": "Crispy pork with coriander rice",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Ready in 20 minutes",
    "description": "This pork and rice recipe is cheap, quick and tasty – perfect for busy mid-week evenings.",
    "ingredients": [
      "250g mix of basmati and wild rice",
      "5 tbsp plain flour, seasoned",
      "1 heaped tbsp Chinese five-spice",
      "2 medium free-range eggs, beaten",
      "100g panko breadcrumbs (see tip)",
      "500g pork shoulder or leg steaks, cut into 1cm strips",
      "100ml groundnut or vegetable oil",
      "Large handful of fresh coriander",
      "4 spring onions, sliced",
      "2 tbsp rice wine vinegar",
      "2 tbsp soy sauce",
      "1 red chilli, finely sliced"
    ],
    "method": [
      {
        "Step 1": "Cook the rice in a medium pan of boiling salted water for 15 minutes or until tender. Drain well."
      },
      {
        "Step 2": "Meanwhile, mix the seasoned flour and five-spice in a shallow dish. Put the beaten eggs in one small bowl and the panko in another. Toss the pork strips in the flour mix, then dip them in the egg, then the panko."
      },
      {
        "Step 3": "Heat the oil in a frying pan, then add the coated pork and fry over a medium heat for 2-3 minutes on each side until golden and crisp. Don’t let the oil get too hot – the pork needs to be cooked in the middle before the breadcrumbs turn too dark."
      },
      {
        "Step 4": "Toss the coriander and spring onions through the drained rice. In a small bowl or jug, mix the rice wine vinegar with the soy sauce, then add the chilli. Serve the rice in bowls, topped with the crispy pork strips and drizzled with the dressing."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/81.jpg"
  },
  {
    "id": "82",
    "title": "Sticky ginger beef and sprouting broccoli stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Takes 25 minutes to make. 5 minutes to cook",
    "description": "The classic Asian flavours in this lip-smacking beef stir-fry work well as a takeaway-style dish or as part of a Chinese New Year spread.",
    "ingredients": [
      "500g purple sprouting broccoli (prepared weight)",
      "2 x 250g sirloin steaks, each about 2.5cm thick",
      "2 tsp soy sauce",
      "2 pieces stem ginger in syrup, cut into fine shreds, plus 2 tsp stem ginger syrup",
      "¾ tsp Chinese five-spice powder",
      "2 tsp cornflour",
      "½ tsp each salt and freshly ground black pepper",
      "4 tbsp hoisin sauce",
      "1 tsp sambal oelek (Indonesian chilli paste) or minced red chilli from a jar",
      "4 tsp Chinese rice wine vinegar or white wine vinegar",
      "1 large bunch of spring onions",
      "2 tbsp sunflower oil",
      "1 medium-hot, long red chilli, deseeded and thinly sliced",
      "4 large garlic cloves, thinly sliced",
      "75g fresh ginger, finely shredded",
      "2 tbsp shaoxing or Chinese rice wine (see Know-how)",
      "1 tbsp toasted sesame oil"
    ],
    "method": [
      {
        "Step 1": "Steam the sprouting broccoli spears for 3-6 minutes or until just tender, then remove and set aside."
      },
      {
        "Step 2": "Trim away the fat from the sirloin steaks and cut the meat across the grain into long, very thin strips. Mix the soy sauce, stem ginger syrup, five-spice powder, cornflour, salt and black pepper in a medium-size bowl. Stir in the beef and set aside."
      },
      {
        "Step 3": "Mix the hoisin sauce, sambal oelek, wine vinegar and shredded stem ginger in a small bowl. Set aside. Trim the spring onions, then separate the green part from the white. Cut the white part lengthways in half, then across into two. Shred the green parts lengthways, then set them aside in a bowl of cold water to make them curl."
      },
      {
        "Step 4": "Heat a wok or large deep frying pan until hot, then add the sunflower oil and swirl it around to coat the sides. Add the chilli, garlic and shredded fresh ginger and stir-fry for 15 seconds. Add the beef and stir-fry over as high a heat as you can for 1-2 minutes until it is only just cooked and no longer pink. Add the shaoxing wine and stir-fry for 15 seconds more, then add the hoisin sauce mixture and toss together well. Add the sprouting broccoli and the white part of the spring onions and stir-fry for a minute until heated through. Sprinkle over the sesame oil and spoon onto a warmed serving plate. Lift the curled spring onions out of the water, dry briefly on kitchen paper and sprinkle over the top. Serve with steamed rice."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/82.jpg"
  },
  {
    "id": "83",
    "title": "Prawn egg-fried rice",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands on time 15 mins, cooking time 20 mins",
    "description": "This easy egg-fried rice recipe with prawns is far tastier than a take-away and costs a fraction of the price.",
    "ingredients": [
      "200g basmati rice",
      "3 tbsp olive oil",
      "200g frozen raw prawns, defrosted",
      "1 onion, finely sliced",
      "2 garlic cloves, finely sliced",
      "Pinch of chilli flakes",
      "3 medium free-range eggs, beaten",
      "200g frozen peas, defrosted",
      "Lemon wedges to serve"
    ],
    "method": [
      {
        "Step 1": "Cook the rice in boiling salted water for 10 minutes, then drain and set aside. Heat 1 tbsp of the olive oil in a wok. When hot, add the prawns, then toss for 1 minute until just pink all over. Remove and set aside."
      },
      {
        "Step 2": "Add the remaining 2 tbsp olive oil to the wok, add the onion, then fry for 5 minutes until soft. Add the garlic and chilli flakes, then cook for another couple of minutes."
      },
      {
        "Step 3": "Add the eggs to the wok. Let them start to set, then stir a little to break them up. Add the rice to the pan and quickly toss together. Finish with the peas and cooked prawns, then serve immediately with the lemon wedges for squeezing."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/83.jpg"
  },
  {
    "id": "84",
    "title": "Sticky beef stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Ready in 12 min",
    "description": "Quick to cook and full of zingy far-eastern flavours, this is the perfect meal if you’re short on time.",
    "ingredients": [
      "150g tenderstem broccoli",
      "2 tbsp groundnut oil",
      "2 x 300g sirloin steaks, sliced",
      "1 banana shallot, sliced",
      "3cm fresh ginger, cut into thin sticks",
      "1 garlic clove, sliced",
      "1 red chilli, sliced",
      "1 red pepper, sliced",
      "100g mangetout",
      "1 tbsp toasted sesame oil",
      "1 tbsp clear honey",
      "2 tsp soy sauce",
      "Good squeeze of lime juice",
      "Handful of fresh coriander leaves"
    ],
    "method": [
      {
        "Step 1": "Blanch the broccoli in boiling water for a couple of minutes, then drain and refresh under cold water."
      },
      {
        "Step 2": "In a wok or frying pan, heat half the groundnut oil over a high heat, then fry the steak until just done. Remove from the pan and set aside."
      },
      {
        "Step 3": "Heat the remaining oil and fry the shallot, ginger, garlic and chilli for 2-3 minutes. Add the broccoli, pepper and mangetout and cook for 1-2 minutes. Return the steaks to the pan with the sesame oil, honey, soy sauce and lime juice. Toss together, scatter with coriander, then serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/84.jpg"
  },
  {
    "id": "85",
    "title": "Sticky pork stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Ready in about 15 minutes",
    "description": "This sweet and sticky pork stir fry recipe, made with sugar snap peas and pak choi, is perfect served with fluffy steamed rice.",
    "ingredients": [
      "2 pork chops",
      "3 tbsp sweet chilli sauce",
      "A squeeze of lime juice",
      "2cm fresh ginger, grated",
      "1 garlic clove, crushed",
      "1 tbsp groundnut oil",
      "2 pak choi, leaves separated",
      "A handful of sugar snap peas",
      "5 spring onions, sliced",
      "1 small red chilli, finely chopped"
    ],
    "method": [
      {
        "Step 1": "Slice the pork chops into thin strips, removing the bone and excess fat."
      },
      {
        "Step 2": "Mix the sweet chilli sauce, lime juice, ginger and garlic together in a bowl. Heat the groundnut oil in a pan, season the pork and add to the pan. Fry over a high heat for a few minutes to brown, then drain away any excess fat."
      },
      {
        "Step 3": "Pour over the marinade and continue to cook for a couple of minutes more. Add the pak choi, sugar snap peas, spring onions and chilli. Continue to fry until tender. Serve with a bowl of steamed rice."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/85.jpg"
  },
  {
    "id": "86",
    "title": "Sweet chilli chicken, peanut and noodle salad",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Takes 15 minutes to make, 15 minutes to cook",
    "description": "This spicy noodle salad is a speedy, zingy midweek supper.",
    "ingredients": [
      "300g rice noodles",
      "1 tbsp groundnut oil",
      "150g sugar snap peas",
      "8 boneless, skinless free-range chicken thighs, cut into pieces",
      "3 tbsp sweet chilli sauce",
      "1 tbsp toasted sesame oil",
      "2 tbsp soy sauce",
      "2 limes",
      "1 tbsp fish sauce",
      "1 garlic clove, crushed",
      "1 red chilli, deseeded and thinly sliced",
      "6 spring onions, thinly sliced",
      "½ cucumber, halved lengthways and thinly sliced",
      "75g natural peanuts, toasted in the oven for 8 minutes and chopped",
      "Small bunch each of fresh mint and fresh coriander, leaves picked"
    ],
    "method": [
      {
        "Step 1": "Put the rice noodles in a large bowl and cover generously with boiling water, then leave for 15 minutes until tender, stirring occasionally to separate the noodles (or cook according to pack instructions). Drain and rinse under cold running water."
      },
      {
        "Step 2": "Meanwhile, in a wok or frying pan, heat the groundnut oil until very hot, then fry the sugar snap peas for 2 minutes. Remove and set aside."
      },
      {
        "Step 3": "Season the chicken, add to the wok or pan and fry for 3 minutes until golden, draining off any fat. Add the sweet chilli sauce and continue to fry until the chicken is cooked and the sauce is thickened and sticky."
      },
      {
        "Step 4": "In a large bowl, whisk the toasted sesame oil, soy sauce, juice from 1½ of the limes, the fish sauce, garlic and chilli to make a dressing. Add the noodles to the bowl with the sugar snaps, spring onions, cucumber, peanuts and herbs, then toss to coat. Add to the wok or pan and stir through the sticky chicken. Set aside a third for lunch the next day and serve the rest on a platter with the remaining ½ lime cut into wedges."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/86.jpg"
  },
  {
    "id": "87",
    "title": "Five-spice chicken noodle stir-fry",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "description": "This clever chicken noodle stir-fry recipe uses time-saving products to make midweek cooking quick and easy. Try our five-spice roast pork, too!",
    "ingredients": [
      "2 tsp Chinese five-spice powder",
      "1 tbsp honey",
      "1 tbsp Very Lazy Ginger (from supermarkets) or similar, roughly chopped",
      "2 tbsp soy sauce, plus extra to serve",
      "2 free-range chicken breasts, thinly sliced",
      "2 tbsp toasted sesame oil",
      "2 nests Blue Dragon Wholewheat Noodles (from Tesco and other supermarkets)",
      "220g pack Tesco Stir-fry Medley, or similar",
      "Lime wedges to serve"
    ],
    "method": [
      {
        "Step 1": "Mix the five-spice, honey, ginger and soy sauce in a bowl. Add the chicken and coat it in the marinade."
      },
      {
        "Step 2": "Heat 1 tbsp of he oil in a wok over a high heat and fry the chicken for 5 minutes until cooked, sticky and golden. Remove and set aside, then wipe the wok."
      },
      {
        "Step 3": "Meanwhile cook the noodles according to the packet instructions. Drain and run under cold water to prevent them sticking, then set aside. Slice the stir-fry veg into matchsticks."
      },
      {
        "Step 4": "Add the remaining oil to the wok and stir-fry the veg for 1-2 minutes until beginning to wilt. 5. Return the chicken to the pan with the noodles and fry for 30 seconds with a splash of soy sauce. Divide between two bowls and squeeze over a wedge of lime"
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/87.jpg"
  },
  {
    "id": "88",
    "title": "Sesame-crusted chicken with chilli and soy noodles",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Ready in 20 minutes",
    "description": "This clever sesame chicken recipe uses time-saving products like ready to wok noodles to make midweek cooking a cinch.",
    "ingredients": [
      "2 tbsp light soy sauce",
      "1 tbsp Very Lazy Hot Chilli Paste (widely available)",
      "6 free-range mini chicken fillets (about 250g), halved lengthways",
      "75g sesame seeds",
      "2 tbsp vegetable oil",
      "300g pack ready-to-wok medium egg noodles",
      "4 spring onions, julienned",
      "Lime wedges to serve"
    ],
    "method": [
      {
        "Step 1": "In a bowl, stir together the soy and chilli paste, then pour half the mixture over the halved mini chicken fillets in another bowl. Stir to coat well. Put the sesame seeds in a third bowl, then cover each chicken piece with an even coating."
      },
      {
        "Step 2": "Heat the vegetable oil in a wok over a medium heat and gently cook the chicken, turning regularly, for 6-8 minutes until cooked through. Remove the chicken with a slotted spoon and set aside. Add the remaining chilli/soy mixture, the noodles and most of the spring onions to the wok, then stir-fry for 2 minutes. Divide the noodles between 2 bowls, top with pieces of sesame chicken, then sprinkle over the remaining spring onions. Serve with lime wedges."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/88.jpg"
  },
  {
    "id": "89",
    "title": "Sticky chicken with jasmine rice",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 40 min, plus 20 minutes marinating time",
    "description": "Add flair to your midweek meals with this sweet sticky chicken recipe with jasmine rice.",
    "ingredients": [
      "1 diced red chilli",
      "2 sliced garlic cloves",
      "½ tbsp of honey",
      "2 tbsp soy sauce",
      "2 chicken breasts",
      "150g jasmine rice",
      "1-2 tbsp creamed coconut",
      "1 tbsp toasted sesame oil",
      "Spring onions, sliced",
      "Toasted sesame seeds",
      "Fresh coriander, roughly chopped",
      "Lime wedges, to serve"
    ],
    "method": [
      {
        "Step 1": "Mix the chilli, garlic, honey and soy sauce, then use to marinate the chicken breasts for 20 minutes."
      },
      {
        "Step 2": "Cook the jasmine rice until tender, drain, then stir in the creamed coconut."
      },
      {
        "Step 3": "Heat the sesame oil over a medium heat in a griddle pan."
      },
      {
        "Step 4": "Cook the chicken (reserving the marinade) for 6 minutes on each side. Add the marinade and bubble for 2 minutes."
      },
      {
        "Step 5": "Slice the chicken, garnish with spring onions, sesame seeds and coriander, then serve with the rice and lime wedges."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/89.jpg"
  },
  {
    "id": "90",
    "title": "Gingery beef and mushroom pie",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Takes 10 minutes to make, 55 minutes to cook, plus chilling",
    "description": "An Asian-style beef pie recipe that makes enough for two batches and is always a crowd pleaser. Save time and freeze ahead for next time.",
    "ingredients": [
      "2 tbsp sunflower oil",
      "750g lean minced beef",
      "4 garlic cloves, finely chopped",
      "2 red chillies, finely sliced",
      "8cm piece of fresh ginger, chopped into matchsticks",
      "150g shiitake mushrooms, sliced",
      "500g chestnut mushrooms, sliced",
      "200ml beef stock, hot",
      "2 star anise",
      "3 tbsp oyster sauce",
      "3 tbsp light soy sauce",
      "4 baby pak choi, quartered",
      "Bunch of fresh coriander, roughly chopped",
      "Milk for sealing and glazing",
      "2 x 375g packs ready-rolled puff pastry"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large wide pan (a large sauté pan or wok works best), then cook the beef, garlic, chillies and ginger over a high heat, stirring often, for about 5 minutes until the mince is browned."
      },
      {
        "Step 2": "Add the mushrooms, stock, star anise, oyster sauce and soy. Cover, then simmer gently for 20 minutes. Remove from the heat, stir in the pak choi and coriander, then set aside to cool. Preheat the oven to 200°C/fan180°C/gas 6."
      },
      {
        "Step 3": "Divide the cooled filling between 2 x 1.3 litre pie dishes. Brush the rims of the dishes with a little milk. Unroll the pastry and use it to cover the dishes, crimping the edges to seal and trimming any excess pastry. Open-freeze one pie for 1-2 hours until firm, then wrap tightly in cling film and store in the freezer for up to 3 months. Cook from frozen, adding 10 minutes to the cooking time (below)."
      },
      {
        "Step 4": "Brush the other pie with milk and bake for 25-30 minutes until golden brown and piping hot."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/90.jpg"
  },
  {
    "id": "91",
    "title": "Sweet and sour pork and prawns with jasmine rice",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Ready in 20 mintues",
    "description": "This sweet and sour pork and prawns recipe with rice is ready in just 20 minutes, making it the perfect midweek meal.",
    "ingredients": [
      "300g jasmine rice",
      "2 tbsp groundnut oil",
      "2 red peppers, sliced",
      "1 bunch of spring onions, sliced",
      "300g pork fillet, cut into cubes",
      "200g raw prawns, peeled",
      "200g tin pineapple chunks, drained",
      "Handful of fresh coriander leaves to serve",
      "2 tbsp cornflour",
      "4 tbsp soft brown sugar",
      "2 tbsp soy sauce",
      "6 tbsp rice wine vinegar",
      "2 tbsp tomato ketchup"
    ],
    "method": [
      {
        "Step 1": "Put all the sauce ingredients into a pan with 100ml water. Stir, bring to the boil, then simmer for a couple of minutes until thickened."
      },
      {
        "Step 2": "Simmer the rice in salted water for 10-12 minutes until tender, then drain. Meanwhile, heat 1 tbsp of the oil in a wok or pan, fry the peppers and spring onions for 1 minute, then remove and set aside."
      },
      {
        "Step 3": "Heat the remaining oil in the wok, fry the pork for 5 minutes, turning, until cooked, then add the prawns and cook for 1 minute until pink. Return the veg to the wok with the pineapple and sauce, then heat through. Serve with the rice, sprinkled with coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/91.jpg"
  },
  {
    "id": "92",
    "title": "Five-spice slow-roast pork belly with pea and leek pilaf",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Takes 5 minutes to make, 1 hour to cook, plus marinating",
    "description": "This quick and easy five-spice slow-roast pork belly with pea and leek pilaf recipe is the ultimate shortcut supper.",
    "ingredients": [
      "2 tsp five-spice powder",
      "3 tbsp dark soy sauce",
      "Thumb-size piece of fresh ginger, finely grated",
      "2 tbsp hoisin sauce, plus extra to serve",
      "2 star anise",
      "8 x British pork belly slices",
      "Veetee Dine In Basmati & Wild Rice (from most supermarkets)",
      "Tesco Finest Side Dish Petit Pois with Leeks and Pancetta, or similar",
      "Small bunch of fresh coriander, leaves picked"
    ],
    "method": [
      {
        "Step 1": "In a big dish, mix the five-spice, soy sauce, ginger, hoisin and star anise. Add the belly slices and marinate, covered, in the fridge for at least half an hour (you can do this the day or morning before). Preheat the oven to 180°C/fan160°C/gas 4."
      },
      {
        "Step 2": "Put the marinade-covered pork in a baking tray skin-side up and roast for 30 minutes. Baste the pork in the sauce from the tin, then return the tray to the oven for another 30 minutes. Just before serving, cook the rice according to the packet instructions along with the pea and leek side dish. Mix together in a serving dish and stir through most of the coriander."
      },
      {
        "Step 3": "Remove the pork from the oven, then divide among plates along with the pilaf, drizzled with cooking juices. Sprinkle over the reserved coriander leaves and serve with extra hoisin sauce on the side."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/92.jpg"
  },
  {
    "id": "93",
    "title": "Sesame chicken stir-fry",
    "difficulty": "Easy",
    "portion": "For 4 people",
    "time": "Takes 20 minutes to make, 20 minutes to cook",
    "description": "This quick and easy chicken stir-fry dish is offset by the zesty sesame stir-fry sauce, it’s a must for mid-week mains.",
    "ingredients": [
      "1 tbsp sunflower oil",
      "1 large chicken breast, cut into 1cm wide strips",
      "½ chinese leaf cabbage, shredded",
      "150g beansprouts",
      "150g baby corn, halved lengthways",
      "1 large carrot, thinly sliced",
      "150g mangetout, halved lengthways",
      "Bunch of spring onions, finely sliced",
      "150g pack straight-to-wok noodles",
      "Grated zest and juice of 1 small orange",
      "Thumb-size piece of fresh ginger, grated",
      "1 tsp soy sauce, plus extra to serve",
      "2 tbsp sweet chilli sauce",
      "2 tbsp toasted sesame seeds"
    ],
    "method": [
      {
        "Step 1": "Heat a splash of oil in a wok. Add the chicken and stir-fry for 5 minutes until golden and cooked through."
      },
      {
        "Step 2": "Meanwhile mix the ingredients for the stir-fry sauce in a bowl. Add the chicken to the stir-fry sauce, mix, then return the wok to the heat."
      },
      {
        "Step 3": "Make sure the wok is hot, then add a splash of oil. Add the cabbage and stir-fry for 5 minutes until wilted. Add the beansprouts and remaining veg, then fry for another 5 minutes."
      },
      {
        "Step 4": "Return the chicken and the sauce to the wok with the noodles and cook for 1-2 minutes until hot. Serve immediately with extra soy sauce."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/93.jpg"
  },
  {
    "id": "94",
    "title": "Sticky chilli and black bean pork with egg-fried rice",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Ready in 20 min",
    "description": "Comfort food gets classy. Quick and easy with a hit of heat, make it your go-to on dreary days.",
    "ingredients": [
      "Sesame oil and vegetable oil for frying",
      "4 spring onions, chopped",
      "1 large free-range egg",
      "1 tbsp soy sauce",
      "250g pack Tilda Steamed Rice",
      "2 x pork loin steaks, fat removed, cut into thin strips",
      "240g pack Sainsbury’s Taste the Difference Tenderstem Broccoli with Garlic and Chilli Stir Fry – pak choi, broccoli, fine beans, red onion, coriander, garlic and chilli (or similar)",
      "120g black bean stir-fry sauce"
    ],
    "method": [
      {
        "Step 1": "First make the egg-fried rice. Heat a dash each of sesame oil and vegetable oil in a large wok, then add the spring onions and fry for 2-3 minutes. Add the egg and stir until scrambled, then pour in the soy sauce."
      },
      {
        "Step 2": "Meanwhile, cook the rice for 2 minutes in the microwave, then add to the wok and stir to combine. Tip into a bowl, set aside and keep warm."
      },
      {
        "Step 3": "Add a little more sesame oil and vegetable oil to the wok, season the pork strips, then fry them over a high heat for 3-4 minutes until just golden all over."
      },
      {
        "Step 4": "Add the stir-fry mix and a splash of water, then fry for 2-3 minutes."
      },
      {
        "Step 5": "Stir in the black bean sauce and warm through for 1 minute."
      },
      {
        "Step 6": "To serve, divide the egg-fried rice between 2 plates and top with the stir-fry."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/94.jpg"
  },
  {
    "id": "95",
    "title": "Broccoli and mushroom sweet chilli noodles",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands on time 15 mins",
    "description": "An easy vegetarian stir-fry combining storecupboard and time-saving ingredients, makes this a quick 15-minute recipe.",
    "ingredients": [
      "1 tbsp sesame seeds",
      "½ tbsp olive oil",
      "125g chestnut mushrooms, sliced",
      "½ x 220g pack Waitrose Tenderstem Broccoli and Green Beans",
      "300g pack sweet chilli dressed egg noodles",
      "1 tbsp chilli and garlic sauce",
      "2 limes",
      "Small handful of fresh coriander, roughly chopped"
    ],
    "method": [
      {
        "Step 1": "Heat a dry wok until hot, add the sesame seeds and toss for 30 seconds until toasted. Remove from the pan and set aside."
      },
      {
        "Step 2": "Add the oil to the pan with the mushrooms and fry over a high heat for 3-4 minutes until golden, remove and set aside. Remove the wok from the heat."
      },
      {
        "Step 3": "Cook the broccoli in a saucepan of boiling water for 2 minutes, add the beans and cook for 1-2 minutes more until tender, then drain well."
      },
      {
        "Step 4": "Cook the noodles in the microwave according to the pack instructions. Return the wok to the heat, add the chilli and garlic sauce and fry for 30 seconds. Add the cooked mushrooms, along with the noodles and veg. Add the zest and juice of 1 lime, most of the sesame seeds and coriander, then toss."
      },
      {
        "Step 5": "Divide between 2 plates. Garnish with the remaining sesame seeds and coriander, and some lime wedges to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/95.jpg"
  },
  {
    "id": "96",
    "title": "Peking duck stir-fried rice",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Ready in 15 minutes",
    "description": "Experience a taste of the orient with this super quick Peking duck stir-fried rice. Speedy but satisfying, a perfect meal if you’re in a hurry.",
    "ingredients": [
      "½ tbsp olive oil",
      "½ x 200g pack free-range duck mini fillets",
      "100g sugar snap peas, sliced diagonally",
      "½ x 90g pack baby pak choi, leaves separated",
      "240g pack Tilda Stir Fry Peking Rice",
      "2 spring onions, sliced diagonally",
      "2-3 tbsp plum sauce",
      "7.5cm piece of cucumber, sliced and cut into thin strips",
      "1 tbsp honey-roasted peanuts, roughly chopped"
    ],
    "method": [
      {
        "Step 1": "Heat a wok until hot, add the olive oil, then add the duck and stir-fry for 3-4 minutes until browned and cooked through. Remove from the pan and set aside."
      },
      {
        "Step 2": "Return the wok to the heat, add the sugar snaps and pak choi and 1 tbsp of water. Stir-fry for 1 minute, remove from the pan and set aside with the duck."
      },
      {
        "Step 3": "Add the rice to the pan and stir-fry for 2-3 minutes, adding 1-2 tbsp water if it begins to stick."
      },
      {
        "Step 4": "Return the vegetables and duck to the pan along with the spring onions. Toss it all together, taste and adjust the seasoning, then add plum sauce to taste."
      },
      {
        "Step 5": "Divide between two bowls and serve topped with strips of cucumber and a sprinkling of chopped peanuts."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/96.jpg"
  },
  {
    "id": "97",
    "title": "Chinese crispy duck",
    "difficulty": "Easy",
    "portion": "Serves 8",
    "time": "Hands-on time 20 min, oven time 2 hours 10 min, plus overnight marinating",
    "description": "This crispy duck recipe with pancakes is an easy homemade version of the irresistible Chinese delicacy, and perfect for Chinese New Year.",
    "ingredients": [
      "4 free-range duck legs (400g in total)",
      "3 tsp salt",
      "2 tsp whole Sichuan peppercorns",
      "2 star anise",
      "2 pieces of cassia bark or 2 cinnamon sticks",
      "40g piece of fresh ginger, unpeeled, lightly crushed",
      "4 spring onions, white parts",
      "only, lightly crushed",
      "2 tbsp Shaoxing wine (available from Asian supermarkets or online)",
      "Groundnut oil for deep frying (1 litre if using a round-bottomed wok)",
      "½ cucumber",
      "10 spring onions, white parts only",
      "20 Chinese pancakes",
      "Hoisin sauce",
      "You’ll need an oil thermometer and a deep-fat fryer or wok. If using a round-bottomed wok, use a wok stand to keep it stable.",
      "You’ll also need a pan to steam the pancakes – or another wok if you have one.",
      "You’ll need a bamboo (not metal) steamer that will fit onto your pan, or into your wok. Alternatively, you can heat them in a microwave."
    ],
    "method": [
      {
        "Step 1": "To marinate the duck, prick the legs all over with a skewer, then put in a large bowl. Add the salt and peppercorns. Pound the star anise and cassia with a pestle and mortar to break them into smaller pieces, then add them to the bowl, along with the crushed ginger, spring onions and Shaoxing wine. Rub the salt and spices all over the duck legs. Set aside, covered, in the fridge for at least a couple of hours, or overnight."
      },
      {
        "Step 2": "Drain off and discard any juices, then put the duck legs, along with the spices, in a heatproof glass or ceramic bowl. Cover the bowl with foil and place in a large pan. Pour in boiling water to halfway up the side of the bowl. Cover, then steam over a high heat for 2 hours until the duck is tender and the meat comes away from the bones easily. Top up the pan with water regularly so it doesn’t dry out."
      },
      {
        "Step 3": "Meanwhile, prepare the trimmings. Cut the cucumber into 5cm lengths, then into fine, even slivers. Cut the spring onion into fine, even slivers. Put the sliced veg into small serving dishes."
      },
      {
        "Step 4": "Once the duck has steamed, remove the bowl from the steamer. Tasty liquid will have come out of the duck legs – strain and keep it to use as stock for soup or a bowl of noodles (it will be salty, so you may need to dilute it). Remove the duck legs from the liquid, discarding any whole spices sticking to them, then set aside to dry (if you’re planning to deep-fry them immediately, pat them dry with kitchen paper)."
      },
      {
        "Step 5": "To deep-fry the duck, heat the oil in a wok or deep-fat fryer to 180°C. To check the temperature, drop a cube of bread in the oil – it should brown within 1 minute. Use tongs to lower the duck legs into the oil, then deep-fry for 5 minutes until they are a deep mahogany brown, turning occasionally."
      },
      {
        "Step 6": "Pour a little boiled water into another pan (or wok) over a medium heat. Lay a stack of pancakes directly onto the slats of a bamboo steamer that will fit into your pan, then cover with the steamer’s lid. Steam for 1-2 minutes to heat them through. (Or you could microwave them on high for 10 seconds.) Spoon some hoisin sauce into a serving dish."
      },
      {
        "Step 7": "Remove the duck legs to a serving dish, then use a couple of forks to shred the skin and meat."
      },
      {
        "Step 8": "Serve with the steamer of pancakes, the cucumber, spring onion and hoisin sauce. To eat, spread hoisin sauce on a pancake, add pieces of duck and slivers of onion and cucumber, then roll up and tuck in."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/97.jpg"
  },
  {
    "id": "98",
    "title": "Aromatic poached and barbecued chicken",
    "difficulty": "Medium",
    "portion": "Serves 8",
    "time": "Takes 25 minutes to make, 1 hour 50 minutes to cook",
    "description": "A super succulent poached chicken recipe, infused with Asian flavours, that benefits from being given the barbecue treatment.",
    "ingredients": [
      "2 tbsp olive oil",
      "1 onion, quartered",
      "2 celery stalks, halved",
      "1 leek, white only, halved",
      "2 carrots, quartered",
      "250ml Madeira wine",
      "1 garlic bulb, halved lengthways",
      "2 cinnamon sticks",
      "3 star anise",
      "1 orange, halved",
      "2 red chillies, halved",
      "Handful of fresh coriander stalks",
      "80g fresh ginger, roughly chopped",
      "2 litres chicken or vegetable stock",
      "2 tbsp soy sauce",
      "4 tbsp hoisin sauce",
      "2 tbsp honey",
      "1 (about 2.3kg) free-range, corn-fed chicken"
    ],
    "method": [
      {
        "Step 1": "Heat a large saucepan over a moderate heat, pour in the olive oil, then add the onion, celery, leek and carrot. Brown well for 10-15 minutes. Add the Madeira and simmer for a few minutes until syrupy. Add the remaining ingredients, except for the chicken, and bring to a simmer."
      },
      {
        "Step 2": "Carefully add the chicken to the pan and top up with water if the chicken isn’t fully submerged. Cover the pan with a lid. Turn down the heat and simmer gently for 1 hour."
      },
      {
        "Step 3": "Preheat the barbecue. Remove the pan from the heat and allow to sit for a further 20 minutes. Using 2 slotted spoons, carefully remove the chicken from the stock and place on a tray. Cover and set aside."
      },
      {
        "Step 4": "Strain 200ml of the cooking liquid into a heavy-based saucepan and bring to the boil. Reduce for 5-10 minutes until the sauce has a thick, syrupy consistency. Brush the chicken all over with the sauce, then cook on a moderate barbecue, turning occasionally, until blackened all over. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/98.jpg"
  },
  {
    "id": "99",
    "title": "Duck with spiced plums",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Takes 10 minutes to make, 25 minutes to cook",
    "description": "This is a hearty, fruity yet amazingly low-cal Chinese-inspired duck recipe that makes use of seasonal plums. Extra zing comes from ginger, star anise and red chilli.",
    "ingredients": [
      "6 ripe red plums (we like victoria)",
      "2cm piece fresh ginger, peeled and finely sliced into matchsticks",
      "1 star anise",
      "1 red chilli, deseeded and finely sliced",
      "2 tbsp soft light brown sugar",
      "Grated zest and juice of 1 lime",
      "4 duck breasts, skin on",
      "2 tsp Chinese five-spice powder"
    ],
    "method": [
      {
        "Step 1": "Halve the plums, remove the stones and cut into wedges. Place in a small saucepan with the ginger, star anise, chilli, sugar, and the lime zest and juice. Heat over a low heat to dissolve the sugar, then turn the heat up a little, cover and cook for 10-15 minutes until the plums are tender. Set aside and keep warm."
      },
      {
        "Step 2": "Preheat the oven to 180ºC/fan160ºC/gas 4. Slash the skin of the duck breasts with a sharp knife in a crisscross pattern, then sprinkle with the five-spice and some sea salt."
      },
      {
        "Step 3": "Heat a heavy ovenproof frying pan over a medium-high heat. Place the duck in the pan, skin-side down, and cook for 5-6 minutes until the skin is golden and crisp. Tip most of the fat from the pan, then turn the duck over and sear the other side for 1 minute. Put the pan in the oven and cook for 6-8 minutes, depending on the size of the duck breasts (we think they’re best served pink)."
      },
      {
        "Step 4": "Remove the duck to a warm plate and rest for 5 minutes. Slice the duck breasts and serve with the spiced plums and some wilted greens and potatoes, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/chinese_recipes_api/99.jpg"
  }
]