[{},
  {
    "id": "1",
    "title": "Pressure cooker refried beans",
    "difficulty": "Easy",
    "portion": "Serves 4-8 as a side",
    "time": "Hands-on time 15 min. Simmering time 30 min",
    "description": "Using dried instead of tinned beans is cheaper and offers up more flavour, but most of us don’t bother due to the time it takes. A pressure cooker is the solution – better for your time, wallet and for the environment. These refried beans beat anything you can buy and are the perfect introduction to pressure  cooking and dried pulses (a match made in heaven).",
    "ingredients": [
      "500g dried pinto beans",
      "1 tsp dried oregano",
      "1 tsp ground cumin",
      "1 tsp fine sea salt",
      "2 tbsp olive oil or lard",
      "1 large onion, finely chopped",
      "1 jalapeno, finely chopped",
      "3 garlic cloves, chopped",
      "Diced tomatoes, pickled jalapenos and fresh coriander to serve",
      "Pressure cooker"
    ],
    "method": [
      {
        "Step 1": "inse the beans then put them in the pressure cooker with 1.6 litres water. Stir in the oregano, cumin and salt. Add the lid and bring to high pressure then cook for 30 minutes. Allow the steam to release naturally then open and check if they’re done (they should be very tender). Return to high pressure and cook for another 5-10 minutes if needed."
      },
      {
        "Step 2": "Once the beans are cooked, drain them, reserving the cooking water in a jug. Return the pressure cooker to a medium heat (or set to the sauté function if electric), add the oil or lard then cook the onion, jalapeno and garlic with a pinch of salt for about 5 minutes, until softened. Stir in the drained beans then cook for a few minutes, adding a little of their cooking water while mashing with a potato masher until you reach the desired consistency (if you prefer them smoother you can whizz with a hand blender then continue cooking). Season to taste then serve topped with tomatoes, pickled jalapenos and coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/1.jpg"
  },
  {
    "id": "2",
    "title": "Black bean chilli soup with corn dumplings",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min. Simmering time 2 hours",
    "description": "Simmering black beans gently with garlic, chillies and lime rewards you with an easy, flavourful soup that you can leave bubbling away in the kitchen. We’ve taken inspiration from Mexico for this zingy broth, complete with fluffy corn dumplings.",
    "ingredients": [
      "300g dried black, pinto or red haricot beans",
      "1 dried pasilla or ancho chilli, stem and seeds removed, then finely chopped",
      "1 tsp dried oregano",
      "2 tsp fine sea salt",
      "2 garlic cloves",
      "1 green or jalapeno chilli",
      "Sour cream to serve (optional)",
      "Finely grated zest and juice 2 limes",
      "120g masa harina",
      "1 tbsp olive oil",
      "¼ tsp fine sea salt",
      "Bunch coriander"
    ],
    "method": [
      {
        "Step 1": "Rinse the beans then put them in a large saucepan and cover with 1.5 litres water (it should cover the beans with about 5cm water on top). Add the dried chilli, oregano and salt to the pan. Bring to the boil."
      },
      {
        "Step 2": "Meanwhile, put a small dry frying pan over a high heat and add the garlic and green chilli. Cook for 3-5 minutes until charred all over. Leave to cool slightly, then peel the garlic cloves and remove the stem and seeds from the chilli. Finely chop, then add to the pan of beans."
      },
      {
        "Step 3": "Boil the beans for 10 min then reduce to a low simmer, cover and cook for 1½-2 hours until creamy and tender. You’ll need to stir the pot about every 30 minutes to prevent it from sticking."
      },
      {
        "Step 4": "Make the dumplings once the beans have been simmering for 1 hour. Put the masa harina, olive oil and salt in a bowl, then finely chop roughly a third of the coriander and add that too (save the rest to garnish). Slowly add 160ml lukewarm water while mixing the dough with your hands until it comes together. Knead lightly for about 1 minute to form a dough."
      },
      {
        "Step 5": "With wet hands, roll pieces of the dough into small spheres, about the size of a golfball. Lightly press your thumb into the centre of the ball to form a little crater. Pop them on a plate and repeat until all the dough is used up."
      },
      {
        "Step 6": "When the beans are tender add the dumplings to the broth, keeping it at a low simmer (uncovered). Let them sit without stirring at first, then start spooning over some of the broth to help them cook through. After 10 minutes, gently stir the broth to move the dumplings around. Cook for another 5 minutes."
      },
      {
        "Step 7": "Add the lime juice to the soup and season. Serve topped with a dollop of sour cream, the lime zest and the remaining coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/2.jpg"
  },
  {
    "id": "3",
    "title": "Fishcake tacos",
    "difficulty": "Easy",
    "portion": "Serves 4 (makes 12 tacos)",
    "time": "Hands-on time 40 min",
    "description": "These spice and smoke fishcake tacos make for a filling midweek dinner. Load taco shells with crispy fishcakes, mango salsa and lime mayo.",
    "ingredients": [
      "300ml semi-skimmed milk",
      "250g undyed smoked haddock, skinned",
      "350g floury potatoes (such as maris piper or king edward), peeled and quartered",
      "1 large mango, peeled, stoned and diced into 1cm cubes",
      "1 small red chilli, finely chopped",
      "Bunch (25g) coriander, finely chopped",
      "Finely grated zest and juice 1 lime",
      "3 tbsp mayonnaise",
      "Bunch spring onions, trimmed and finely chopped",
      "¼ tsp cayenne pepper",
      "1 medium free-range egg, beaten",
      "30g panko breadcrumbs",
      "Vegetable oil for frying",
      "2 little gem lettuces, finely shredded",
      "12 small corn or flour tacos"
    ],
    "method": [
      {
        "Step 1": "Pour the milk into a saucepan and bring to the boil. Turn down the heat and add the smoked haddock, then gently poach for 3-4 minutes until cooked through and flaky. Lift the fish out of the milk with a slotted spoon, then set aside to cool."
      },
      {
        "Step 2": "Put the potatoes in the leftover milk, topping up with water to cover (if needed). Bring to the boil and simmer for 10-12 minutes until very tender. Drain in a colander and set aside to steam dry."
      },
      {
        "Step 3": "Meanwhile, combine the mango with the chilli, half the coriander and half the lime juice. Season with a pinch of salt and mix well. Mix the remaining lime juice with the mayonnaise."
      },
      {
        "Step 4": "Put the spring onions, lime zest and cayenne pepper in a bowl. Add the potatoes with a pinch of salt and mash everything together until well combined. Flake in the fish, add half the remaining coriander, then stir until you have a dry, firm mixture. Shape into small 3-4cm patties, laying them on a tray as you work. You should get around 24 in total."
      },
      {
        "Step 5": "Put the beaten egg in one shallow dish and the breadcrumbs in another. Heat a good glug of vegetable oil in a large frying pan over a medium heat. One by one, dip the fishcakes in the egg, then the breadcrumbs, then put them straight into the frying pan (you’ll need to work in batches, adding more oil as needed). Cook for 2 minutes on each side until golden and crisp, then drain on kitchen paper."
      },
      {
        "Step 6": "To serve, sprinkle shredded lettuce onto each taco. Top with 2 fishcakes, then a spoonful of lime mayonnaise. Finish with the mango salsa and a pinch of the remaining coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/3.jpg"
  },
  {
    "id": "4",
    "title": "Black bean and chicken burritos",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "Use leftover roast chicken to make these thrifty and delicious chicken burritos. These filling burritos are packed with black beans, rice and guacamole.",
    "ingredients": [
      "1 tbsp vegetable oil",
      "Bunch spring onions, finely chopped",
      "2 garlic cloves, finely chopped",
      "1 tsp cumin seeds",
      "400g tin black beans in water, rinsed and drained",
      "2 tsp smoked paprika",
      "100g cooked rice",
      "1 large avocado",
      "Juice 1 lime",
      "1 red chilli, finely chopped",
      "150g ripe cherry tomatoes, roughly chopped",
      "Bunch fresh coriander, roughly chopped, reserving a few whole leaves to serve",
      "4 large flour tortillas",
      "125g cooked chicken, shredded",
      "100g mild cheddar, grated",
      "Hot sauce such as Tabasco or Cholula to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a frying pan, add the spring onions and cook for 3-4 minutes until beginning to soften. Stir in the garlic and cumin, cook for just a minute longer, then add the drained beans and paprika and cook for a further 3 minutes. Add a splash of water to the pan and, with a fork or potato masher, mash the beans until you have a coarse paste. Season to taste, then stir in the rice and remove from the heat."
      },
      {
        "Step 2": "Scoop the avocado into a bowl and mash well with a fork, adding the lime juice as you go. Stir in the chopped chilli, tomatoes and coriander, then season to taste."
      },
      {
        "Step 3": "Warm a flour tortilla in a dry frying pan over a medium heat. Put it on a chopping board, then spread a few tablespoons of the black bean and rice mixture in the centre. Spoon a quarter of the avocado mixture on top, then sprinkle on a quarter each of the chicken and the cheese and a few reserved coriander leaves. Roll up the tortilla tightly, tucking in the ends. Lay seam-side down on the chopping board, then prepare the other tortillas. Serve with hot sauce, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/4.jpg"
  },
  {
    "id": "5",
    "title": "Pork tacos with sweetcorn and feta",
    "difficulty": "Easy",
    "portion": "Serves 2-3",
    "time": "Hands-on time 25 min, plus marinating",
    "description": "Grill marinated chops on the barbecue to make these delicious pork tacos. Load charred tortillas with pork, chillies, herbs and crumbled feta.",
    "ingredients": [
      "2 bone-in free-range pork chops",
      "3 tbsp olive oil",
      "2 large corn-on-the-cobs",
      "6 fresh jalapeño chillies",
      "2 limes, halved",
      "2 tsp coriander seeds",
      "2 tsp cumin seeds",
      "2 garlic cloves, bashed",
      "4 tbsp cider vinegar",
      "1 tsp brown sugar",
      "Small bunch coriander, leaves and stalks finely chopped",
      "6 small wheat or corn tortillas and crumbled feta to serve",
      " Digital thermometer"
    ],
    "method": [
      {
        "Step 1": "Prepare the barbecue for direct heat (for cooking right over the coals; or see alternative cooking instructions in tips). Pat the pork chops dry, then rub with 1 tbsp oil and season well with salt. Grill the chops, corn and chillies (turning them all) until the corn and chillies are lightly charred and the pork is cooked through to your liking (they should read 63°C or over on a probe thermometer). Cook the limes cut-side down for 1-2 minutes until caramelised."
      },
      {
        "Step 2": "Toast the coriander and cumin seeds in a hot dry pan for about 1 minute until fragrant. Lightly crush in a pestle and mortar, then mix in a shallow dish with the garlic, vinegar, sugar and coriander stalks. Roughly chop 3 of the charred jalapeños and add to the marinade with the remaining 2 tbsp oil. Add the cooked chops, turning to coat, then set aside for 10 minutes."
      },
      {
        "Step 3": "Remove the pork from the marinade, cut off the bone, then slice and toss back through the marinade (this is known as a reverse marinade – a quick way of adding more flavour). Slice the kernels from the cobs and mix with the coriander leaves, the juice from half a lime and some seasoning. Briefly toast the tortillas on the barbecue (or in a pan) until slightly charred but still flexible, then pile on the pork and corn. Crumble feta over and drizzle with the remaining marinade. Serve with the rest of the charred chillies and limes."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/5.jpg"
  },
  {
    "id": "6",
    "title": "Taco slaw with pink pickled onions",
    "difficulty": "Easy",
    "portion": "Serves 4-6 as a side",
    "time": "Hands-on time 15 min, plus pickling",
    "description": "You need a zingy taco slaw to cut through the smoky richness of tacos – and this easy, colourful carrot slaw with quick-pickled onions has zest and crunch to spare.",
    "ingredients": [
      "1 red onion, finely sliced",
      "Juice of 5 limes",
      "1 garlic clove, finely chopped",
      "1 tsp cumin seeds",
      "½ tsp chipotle flakes (optional)",
      "½ tsp sugar",
      "1/4 white cabbage, finely shredded",
      "2 carrots, finely shredded",
      "1 jalapeño chilli, finely chopped",
      "Handful coriander, finely chopped",
      "1 tbsp rapeseed oil"
    ],
    "method": [
      {
        "Step 1": "Put the sliced red onion in a heatproof bowl, cover with boiling water for 20 seconds, then drain well and return to the bowl. Squeeze in the lime juice, then add the garlic, cumin seeds, chipotle flakes (if using), sugar and a big pinch of salt. Stir well, then set aside for at least 20 minutes to quick-pickle."
      },
      {
        "Step 2": "While the onion pickles,put the shredded cabbage and carrot in a colander. Add the finely chopped jalapeño and a good pinch of salt then scrunch together and set aside for 10 minutes to drain."
      },
      {
        "Step 3": "Squeeze the cabbage mixture to remove excess water, then put in a mixing bowl. Add the pickled onions, along with the pickling lime juice. Sprinkle in a handful of finely chopped coriander, drizzle in the rapeseed oil, give everything a mix, then taste and add extra salt if needed."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/6.jpg"
  },
  {
    "id": "7",
    "title": "Smoky chipotle tofu with tomatoes and avocado",
    "difficulty": "Easy",
    "portion": "Serves 2-3",
    "time": "Hands-on time 15 min. Simmering time 7-8 min",
    "description": "Pair warm, intensely smoky, chipotle tofu with soothing smashed avocado. This vegan combo is incredible on toast or in breakfast tacos.",
    "ingredients": [
      "2 tbsp olive oil",
      "225g block smoked firm tofu, cut into small cubes",
      "3 tbsp chipotles in adobo",
      "½ tsp sea salt",
      "3 spring onions, finely sliced",
      "150g cherry tomatoes, halved",
      "Tacos or toast to serve",
      "1 large avocado",
      "Grated zest and juice 1 lime",
      "Garlic cloves",
      "Chilli oil or Korean chilli flakes",
      "Chopped coriander, chervil, tarragon, basil or dill",
      "Drizzle of tahini"
    ],
    "method": [
      {
        "Step 1": "For the smashed avocado, cut the avocado in half and discard the stone. Mash the garlic, if using, with ½ tsp salt using a knife or pestle and mortar. Mash with the avocado, then add the lime zest and juice (and, if using, the chilli oil/flakes, herbs and tahini). Season to taste."
      },
      {
        "Step 2": "Heat a frying pan over a medium-high heat and, when hot, add the olive oil, then the tofu. Fry for a few minutes until crisp, then add the chipotles. Stir-fry for a few minutes, seasoning with the sea salt, then add the spring onions and tomatoes. Turn the heat to medium and cook for 7-8 minutes until the tomatoes begin to break down. Taste and adjust the seasoning, then serve with the smashed avocado, in tacos or on toast."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/7.jpg"
  },
  {
    "id": "8",
    "title": "Chilaquiles with fresh tomatillo salsa",
    "difficulty": "Medium",
    "portion": "Serves 4",
    "time": "Hands-on time 25 min, simmering time 10 min ",
    "description": "Thomasina Miers’ vegetarian chilaquiles is her take on one of Mexico’s most treasured recipes. Serve for breakfast with a fried egg, ricotta or refried beans and plenty of salsa.",
    "ingredients": [
      "200g leftover tortillas or good quality plain tortilla chips",
      "2 tbsp olive oil, plus extra for frying the tortillas (optional)",
      "300g fresh tomatillos or 350g tinned (see Know How for stockists or use green tomatoes instead)",
      "1 onion, cut into 8 wedges",
      "3 garlic cloves, unpeeled",
      "1 jalapeño chilli, de-stemmed",
      "25g coriander, leaves and stalks",
      "1 tbsp caster sugar",
      "1½ tsp salt",
      "500ml vegetable stock or water",
      "Juice ½ lime",
      "4 fried eggs",
      "Sliced avocado",
      "Soured cream",
      "A few handfuls coriander leaves",
      "Feta or lancashire cheese",
      "Finely chopped red onion or quick-pickled onions"
    ],
    "method": [
      {
        "Step 1": "If using up tortillas, cut them into triangles, pour a few tbsp of oil into a pan over a medium-high heat and shallow-fry until you have crisp tortilla chips. Set aside."
      },
      {
        "Step 2": "If you have fresh tomatillos, remove their husks and wipe with a damp cloth. Put a large frying pan over a medium-high heat and toast the onion, garlic, jalapeño and tomatillos. Shake and turn frequently until charred over and tender in the middle (6-7 minutes for the garlic and chilli and a little longer for the onion and tomatillos). When cool enough to handle, peel the garlic, then transfer to a blender/food processor along with the other charred ingredients, the coriander, sugar and salt. If you’re using tinned tomatillos, add them at this point. Whizz to a purée."
      },
      {
        "Step 3": "Warm the 2 tbsp oil in a pan over a medium heat and pour in the sauce. Fry, stirring, for 2-3 minutes until it darkens slightly. Pour in the veg stock or water and bring to a simmer. Add the lime juice and tortilla chips, then toss gently in the sauce for just long enough for some of them to soften. Taste and season if needs be, then remove from the heat and transfer to shallow bowls. Top with any serving suggestions or sides that you fancy."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/8.jpg"
  },
  {
    "id": "9",
    "title": "Chipotle baked eggs",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 25 min, plus simmering time 10 min ",
    "description": "Tommi Miers’ chipotle baked eggs are a simple way to start the day, with all the sweetly smoky flavours of a tomato-chipotle sauce. Mop up with tortillas or flatbreads.",
    "ingredients": [
      "3 tbsp olive oil",
      "1 onion, finely sliced",
      "2 garlic cloves, finely sliced",
      "1 small red pepper, deseeded and finely sliced",
      "1 red chilli, finely chopped",
      "1 tsp ground cumin",
      "1 tsp ground cinnamon",
      "1 tsp allspice",
      "A few large pinches of Mexican oregano or hoja santa (optional; see Know How)",
      "1 tbsp chipotles in adobo (or more to taste; see Know How)",
      "2 x 400g tins chopped tomatoes or 700g fresh tomatoes, chopped",
      "2-3 tsp brown sugar",
      "1 tbsp red wine vinegar",
      "8 medium free-range egg",
      "8 corn or flour tortillas",
      "Sliced avocado",
      "Handful coriander leaves or chervil, torn"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 170°C fan/gas 5. Warm the olive oil in a large ovenproof frying pan over a medium heat – or use a regular pan and transfer to a baking dish for step 3. Add the onion, garlic, pepper and chilli. Season with a few pinches of salt and fry gently for 20 minutes until the pepper is soft and sweet."
      },
      {
        "Step 2": "Add the spices and oregano/hoja santa, if using, Cook for 30 seconds more, then add the chipotles, tomatoes, sugar and vinegar with another big pinch of salt. The amount of sugar needed to season this will depend on whether you’re using tinned or fresh tomatoes and their ripeness. Pour in 250ml water, then simmer for 15 minutes until the sauce has reduced a little but is still loose enough to envelop the eggs. Taste to check the seasoning."
      },
      {
        "Step 3": "Make 8 small indents in the sauce and crack in the eggs. Bake in the oven for 12-15 minutes until the whites are just set. While the eggs are cooking, warm the tortillas, then serve with the avocado and a sprinkle of fresh herbs."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/9.jpg"
  },
  {
    "id": "10",
    "title": "Venison tacos with grilled spring onions and peanut salsa",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min, plus resting. Oven time 8-10 min.",
    "description": "Dish up gourmet tacos at home with our recipe for venison tacos with grilled spring onions. Spoon the moreish Mexican peanut salsa on top and scatter with crumbled feta to serve.",
    "ingredients": [
      "2 venison steaks (about 250g each; or use British beef steaks)",
      "1 tbsp ground nut or veg oil",
      "2 bunches spring onions",
      "Tortillas, 100g crumbled feta, chopped coriander and lime wedges to serve",
      "250ml groundnut/veg oil",
      "6-8 dried Mexican chillies (we used ancho, guajillo and chipotle; see Know How), seeds and stems removed, torn",
      "4 large garlic cloves, sliced",
      "50g raw blanched peanuts",
      "1 tbsp sesame seeds",
      "2 tsp apple cider vinegar or white wine vinegar",
      "1 tsp dark brown sugar"
    ],
    "method": [
      {
        "Step 1": "Rub the venison with half the oil, season on both sides with salt, then set aside."
      },
      {
        "Step 2": "For the salsa, heat the oil in a small pan over a low-medium heat. Add the chillies and fry for 6-8 minutes until a little puffed, toasted and smelling fragrant. Put the chillies in a bowl, leaving the oil behind. Add the garlic to the oil and cook, stirring often, until crisp and light golden, then remove with a slotted spoon and add to the chillies. Add the peanuts and sesame seeds to the oil and fry for 5 minutes until lightly toasted, then stir in the vinegar and sugar and return the chillies and garlic to the pan. Set the pan aside to cool for 15 minutes, then whizz the contents in a food processor until everything is finely chopped. Taste and season with salt."
      },
      {
        "Step 3": "Heat the oven to 160ºC fan/gas 4. Heat an ovenproof frying pan over a high heat, cook the venison for 2-3 minutes on each side until browned, then transfer to the oven and cook for 8-10 minutes for medium-rare. Put on a plate to rest in a warm place (take care with the hot handle)."
      },
      {
        "Step 4": "Wipe out the pan and return to a high heat. Toss the spring onions with the remaining oil, then cook for 3-4 minutes, turning occasionally, until charred and tender. Set aside to cool slightly, then chop or leave whole."
      },
      {
        "Step 5": "Warm the tortillas according to the packet instructions. Thinly slice the venison and toss with any resting juices. Serve with the warm tortillas and the spring onions for everyone to assemble into tacos topped with crumbled feta, peanut salsa, chopped coriander and a squeeze of lime."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/10.jpg"
  },
  {
    "id": "11",
    "title": "Easy huevos rancheros",
    "difficulty": "Medium",
    "portion": "Serves 2",
    "time": "Takes 20 minutes to make",
    "description": "When it comes to breakfast, huevos rancheros (ranch eggs) is the full Mexican. This weekend-treat deserves to become your Saturday go-to – plus it comes in at just £2.50 a portion.",
    "ingredients": [
      "400g tin black or pinto beans, rinsed and drained (or 160g dried beans, soaked and boiled – see tips)",
      "1 tbsp sunflower oil for frying",
      "4 small corn tortillas (see tips)",
      "2 medium free-range eggs",
      "1 avocado, sliced",
      "50g feta, crumbled (or queso fresco if you can find it)",
      "Hot sauce to serve (optional)",
      "2 tbsp sunflower oil",
      "1 small onion, finely chopped",
      "1 jalapeño chilli, seeds removed, sliced into matchsticks (plus extra, sliced, to serve – optional)",
      "1⁄2 tsp ground cumin",
      "1⁄2 tsp dried oregano",
      "3 medium tomatoes, finely chopped (or use 6 tbsp chopped tinned tomatoes)",
      "Small bunch coriander, chopped",
      "Juice 1⁄2 lime, plus wedges"
    ],
    "method": [
      {
        "Step 1": "For the salsa, heat the oil in a pan over a medium heat, then fry the onion and jalapeño until softened (about 4 minutes). Add the cumin, oregano and tomatoes, then cook for 3 minutes or until the mixture becomes saucy. Stir in half the coriander and season with some salt. Cover, turn the heat to low and simmer for 5 minutes. Season with lime juice."
      },
      {
        "Step 2": "Meanwhile, put the beans and a splash of water in a pan and warm over a low-medium heat until hot. Mash until mostly smooth with a little texture."
      },
      {
        "Step 3": "Heat the oil, then briefly fry the tortillas on both sides until just toasted. Drain on kitchen paper. Fry the eggs in the same oil until cooked to your liking."
      },
      {
        "Step 4": "Top the tortillas with the beans, salsa and eggs, then finish with avocado, feta and the remaining coriander. Serve with lime wedges and, if you like, extra jalapeño and/or hot sauce."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/11.jpg"
  },
  {
    "id": "12",
    "title": "Turkey pozole",
    "difficulty": "Easy",
    "portion": "Serves 4-5",
    "time": "Hands-on time 25 min, plus simmering time 35 min ",
    "description": "This delicious version of pozole, a hearty Mexican soup, uses leftover turkey in place of the traditional pork, and is made with pozole corn.",
    "ingredients": [
      "1.5 litres chicken or turkey stock (or 2 chicken stock cubes dissolved in 1.5 litres water)",
      "1/2 small onion, peeled (use the other half for the salsa)",
      "3 garlic cloves, peeled",
      "400-500g shredded cooked turkey or chicken",
      "500g tin pozole corn (hominy), rinsed (or a 400g tin chickpeas, rinsed)",
      "1 tbsp dried oregano",
      "2 bay leaves",
      "1 tsp cumin",
      " 1/2 small onion (leave the skin on), cut into 2 wedges",
      "1 garlic clove (leave the skin on)",
      "2 ancho chillies, stalks and seeds removed (see Know How)",
      "2 dried guajillo chillies, stalks and seeds removed (see Know How)",
      "4 medium tomatoes, or a 400g tin plum tomatoes",
      "1 tsp brown sugar",
      "Half iceberg lettuce, shredded",
      "Small onion, finely sliced",
      "100g radishes, thinly sliced",
      "3 corn or flour tortillas, sliced into strips and shallow fried until crisp (or use tortilla chips)",
      "Handful coriander leaves, picked or finely chopped",
      "Lime wedges for squeezing",
      "Hot sauce and/or soured cream (optional)"
    ],
    "method": [
      {
        "Step 1": "Put the stock, onion and garlic cloves in a saucepan over a medium-high heat and bring to the boil. Reduce the heat, then simmer for 20 minutes."
      },
      {
        "Step 2": "Meanwhile, make the salsa. Char the onion wedges, tomatoes (if you’re using fresh) and garlic in a dry pan for 6-8 minutes until blackened. Peel and set aside."
      },
      {
        "Step 3": "Put the chillies in a small pan, then cover with boiling water and simmer for 5 minutes until the skins are softened. Drain, then add to a blender or food processor with the charred onion and garlic, tomatoes, sugar, 250ml cold water and a large pinch of salt. Add the softened onion and garlic from the stock, then whizz until smooth."
      },
      {
        "Step 4": "Pour the salsa back into the pan, then simmer for 10 minutes until reduced by about half. Add the salsa to the stock, then add the shredded meat, pozole corn or chickpeas, dried oregano, bay, cumin, and some more seasoning. Simmer gently for 5 minutes until warmed through and the meat takes on the flavour of the broth."
      },
      {
        "Step 5": "Ladle the soup into bowls and garnish with lettuce, onion, radishes, fried tortilla strips, coriander and lime wedges. Serve with hot sauce and/or soured cream, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/12.jpg"
  },
  {
    "id": "13",
    "title": "Mexican-style barbecued beef brisket with quick-pickled onions",
    "difficulty": "Medium",
    "portion": "Serves 6-8",
    "time": "Hands-on time 45 min, oven time 5½ hours, grill/barbecue time 10 min, plus marinating",
    "description": "Beef brisket can be a tough joint, but this recipe guarantees fall-apart-tender meat with a Mexican flavour that will make your taste buds sit up and take notice.",
    "ingredients": [
      "2 tbsp vegetable oil",
      "1 red onion, chopped",
      "4 garlic cloves, crushed",
      "1 tbsp ground cumin",
      "1 tbsp ground coriander",
      "1-2 green or yellow jalapeños, sliced",
      "2 tbsp chipotle paste",
      "6 tbsp dark muscovado sugar",
      "2.25kg British beef brisket",
      "3 dried cascabel chillies (available from Waitrose, Ocado or online from Souschef)",
      "500ml good quality beef stock",
      "250ml fruity red wine",
      "200ml fresh orange juice",
      "200ml passata",
      "2 red onions, thinly sliced",
      "Juice 3 limes",
      "1 tbsp sea salt",
      "Large handful fresh coriander, roughly chopped",
      "Sliced green or yellow jalapeños",
      "2 ripe avocados, chopped",
      "Juice ½ lime, plus extra wedges",
      "Steamed rice or warm tortillas"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large, deep frying pan. Add the chopped onion and fry for 5 minutes or until beginning to colour. Stir in the garlic, cumin, coriander, jalapeños, chipotle paste and sugar, season generously with salt and pepper, then cook for 1 minute more. Remove from the heat and allow to cool. If you like a smooth consistency, whizz in a mini food processor or pound in a pestle and mortar (optional)."
      },
      {
        "Step 2": "Rub the cooled onion and spice marinade all over the brisket, then transfer to a large food bag with any leftover marinade. Marinate for at least 2 hours or ideally overnight in the fridge (see Make Ahead). "
      },
      {
        "Step 3": "Meanwhile, for the pickled onions, toss the sliced onions with the lime juice and salt in a glass bowl, then leave for at least 2 hours until they’ve turned pink. "
      },
      {
        "Step 4": "Put the dried chillies, stock, wine, orange juice and passata in a large jug and stir until well combined."
      },
      {
        "Step 5": "Once ready to slow-cook, heat the oven to 140°C/120°C fan/gas 1. Put the brisket and any marinade from the bag in a large, deep roasting tin and pour over the stock mixture (including the chillies). Cover the meat with a layer of baking paper, then tightly cover the tin with 2 layers of foil, scrunching the edges to form a tight seal. Slow cook for 5-5½ hours, turning the meat over in the roasting tin halfway through the cooking time."
      },
      {
        "Step 6": "Once the brisket is fully tender (see tips) remove from the oven and set aside on a chopping board, loosely covered, to rest. Carefully pour the cooking liquid from the roasting tin into a saucepan and bubble over a high heat for 25-30 minutes to reduce to a sauce consistency. Taste and adjust the seasoning (see Make Ahead)."
      },
      {
        "Step 7": "Heat the grill to medium-high and cook for 5 minutes on each side, basting every 2 minutes with more sauce to give a charred sticky crust."
      },
      {
        "Step 8": "To serve, mix the coriander, jalapeños, avocados and lime juice in a bowl and serve alongside the brisket with the quick-pickled onions and steamed rice or warm tortillas."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/13.jpg"
  },
  {
    "id": "14",
    "title": "Frozen mango margarita",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "Hands-on time 5 min, plus infusing time",
    "description": "This easy frozen mango margarita has a chilli kick thanks to homemade, jalapeno-infused tequila. Use ordinary tequila with a dash of chilli powder, if you’d prefer. The perfect slushie for barbecues and summer parties.",
    "ingredients": [
      "160ml jalapeño infused tequila (see below), or regular tequila and a pinch of chilli powder",
      "150g frozen mango chunks",
      "50ml fresh orange juice, plus extra to coat",
      "30ml orange liqueur (Grand Marnier, Cointreau or Triple Sec)",
      "Juice 1 lime, plus a little extra to coat",
      "Handful crushed ice",
      "Fresh jalapeño, thinly sliced, to serve (optional)",
      "350ml good quality tequila",
      "1 fresh jalapeño chilli, sliced",
      "1 wide strip lime zest",
      "1 tsp chilli powder (we used smoked)",
      "1 tsp fine sea salt"
    ],
    "method": [
      {
        "Step 1": "Start by infusing the tequila, if you’re making it. Put the cut chilli in a clean 500ml capacity jar. Add the sliced jalapeño, put the lid on and set aside at room temperature to infuse for at least 12 hours or up to 1 week depending on how spicy you like it. Pour the infused tequila through a muslin lined sieve set over a clean jug. Discard the chilli and zest."
      },
      {
        "Step 2": "To make the margarita, put all the drink ingredients (except the fresh jalapeño) in a blender and whizz to a smooth slushy consistency."
      },
      {
        "Step 3": "To serve, coat the rim of a glass with a little lime juice (put the glass in the freezer for 30 minutes beforehand if you like it extra chilled). Stir together the chilli powder and salt on a flat plate. Dip the moistened rim of the glass into the salt mix and tap to remove any excess. Scoop the mango margarita mix into the prepared glass and serve topped with jalapeño slices, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/14.jpg"
  },
  {
    "id": "15",
    "title": "Raspberry margarita",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "Hands on time 10 min, plus cooling time",
    "description": "Learn how to make a raspberry margarita with our easy cocktail recipe. Tequila and Grand Marnier are served over ice with homemade raspberry syrup and a touch of lime.",
    "ingredients": [
      "60ml good quality tequila",
      "45ml raspberry syrup (see below)",
      "30ml orange liqueur (Grand Marnier, Cointreau or Triple Sec)",
      "1 cup crushed ice, plus extra to serve (optional)",
      "3-4 fresh raspberries to serve",
      "150g raspberries (fresh or frozen)",
      "100g granulated sugar",
      "50ml water",
      "Juice 1 lime",
      "Dash raspberry syrup",
      "1 tbsp freeze-dried raspberry powder",
      "2 tbsp caster sugar"
    ],
    "method": [
      {
        "Step 1": "For the raspberry syrup, combine the raspberries, sugar and water in a small pan and cook over a medium heat, stirring regularly until the sugar dissolves and the raspberries start to break down. Bring to a boil, then strain into a small bowl. Stir in the lime juice and leave to cool, then chill in the fridge until needed."
      },
      {
        "Step 2": "To make the margarita, put the crushed ice in a cocktail shaker, then pour in the tequila, raspberry syrup and Grand Marnier. Secure the lid and shake vigorously for 1 minute."
      },
      {
        "Step 3": "To serve, coat the rim of a glass with a little raspberry syrup. Stir together the raspberry powder and sugar on a flat plate. Dip the moistened rim of the glass into the sugar mix and tap to remove excess coating. Fill a glass with fresh crushed ice, the whole raspberries and a little extra raspberry syrup. Strain the margarita into the prepared glass and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/15.jpg"
  },
  {
    "id": "16",
    "title": "Enchiladas verdes",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 30 min",
    "description": "These classic Mexican enchiladas verdes are filled with tender chicken thighs and covered with cheese and rich tomatillo sauce for a filling family dinner.",
    "ingredients": [
      "6 skinless and boneless free-range chicken thighs",
      "400g tin pinto beans (or use black beans if you prefer)",
      "200g mature cheddar, grated",
      "6 large tortilla wraps",
      "Small bunch coriander, leaves picked, to serve",
      "1 small red onion, thinly sliced, soaked in cold water, to serve",
      "1 red chilli, thinly sliced, to serve",
      "1 green chilli, thinly sliced, to serve",
      "100g queso fresco cheese or feta, crumbled, to serve and cut in half if large",
      "790g tin tomatillos",
      "50g coriander, leaves and stalks roughly chopped",
      "½ white onion, roughly chopped",
      "1-2 fresh jalapeño chilli, halved, seeds removed",
      "2 large garlic cloves, peeled",
      "Grated zest and juice 2 limes"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160ºC fan/gas 4. To make the salsa, put all the ingredients in a food processor or blender with a large pinch of salt and whizz until everything is finely chopped. Put the chicken thighs in the roasting dish and toss with 150ml of the salsa, cover tightly with foil, then cook in the oven for 30 minutes until cooked through. Shred the chicken and mix in a large bowl with the pinto beans, 150g of the cheddar and 2-3 tbsp of the salsa."
      },
      {
        "Step 2": "Increase the oven to fan 180ºC/gas 6. Pour half the remaining salsa into the baking dish. Dip a tortilla into the salsa, lightly coating both sides. Divide the chicken mix into 6 portions, then arrange one portion along the middle of a wrap. Roll up and put in the baking dish. Repeat with the remaining tortillas and filling. Drizzle over the remaining salsa, sprinkle with the remaining 50g cheddar, then bake in the oven for 20-30 minutes until bubbling and golden."
      },
      {
        "Step 3": "Serve piping hot, topped with the coriander, onion, chillies and queso fresco/feta, with extra lime and sour cream on the side if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/16.jpg"
  },
  {
    "id": "17",
    "title": "Margarita cheesecake with tequila strawberries",
    "difficulty": "Easy",
    "portion": "Serves 10",
    "time": "Hands-on time 20 min, plus 4-6 hours setting/marinating time",
    "description": "For a make-ahead cheesecake with a twist, try our incredible margarita cheesecake, with crushed pretzel base and boozy tequila strawberries on top.",
    "ingredients": [
      "140g pretzel thins (we like Olly’s Pretzels Salted Original)",
      "2 tsp caster sugar",
      "90g unsalted butter, melted",
      "360g cream cheese",
      "150g soured cream",
      "100g icing sugar, sifted",
      "Finely grated zest 1 lime",
      "Finely grated zest ½ orange",
      "150ml double cream",
      "4 gelatine leaves, soaked in cold water for 10 minutes (we used Dr Oetker)",
      "100g caster sugar",
      "Juice 6 limes, strained",
      "Juice 1 orange, strained",
      "2 tbsp tequila",
      "1 tbsp Grand Marnier, Cointreau or Triple Sec",
      "100ml lime soda (we used Fever Tree Mexican lime soda)",
      "300g strawberries, hulled and sliced",
      "100g pure icing sugar, sifted",
      "1-2 tbsp tequila",
      "1 tbsp Grand Marnier, Cointreau or Triple Sec",
      "Grated zest 1 lime",
      "Grated zest ½ orange",
      "Flaky salt to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Put the pretzel thins and caster sugar in a food processor and whizz to fine crumbs. Pour in the melted butter and whizz again until the mixture comes together (it should hold its shape when scrunched together). Spoon into a 20cm loose-bottomed cake tin, then smooth the surface with the back of a spoon to level, pressing to compact a little. If you don’t have a food processor put the pretzels into a food bag and bash with a rolling pin, then mix in a bowl with the sugar and melted butter. Set aside in the fridge while you make the filling."
      },
      {
        "Step 2": "In a large mixing bowl beat together the cream cheese, soured cream, icing sugar, and zests until smooth. In another bowl, whip the cream to soft peaks, then gently fold it into the cream cheese mixture until combined. Pour the cheesecake filling on top of the biscuit base and level the top with a spatula. Set aside in the fridge for 2 hours until set firm."
      },
      {
        "Step 3": "To make the margarita layer, put the sugar, lime and orange juice in a small heavy based saucepan over low heat, stirring until the sugar dissolves. Squeeze the soaked gelatine leaves to remove excess water, then stir them into the warm juice mixture until fully melted. Add the tequilla, Grand Marnier and lime soda and stir to combine, then set aside to cool. Pour the jelly over the set cheesecake mixture. Cover, and return to the fridge until fully set for at least 2 hours or overnight."
      },
      {
        "Step 4": "For the tequila strawberries, combine all the ingredients in a bowl. Stir to combine, then cover and set aside in the fridge until ready to serve. As the strawberries sit, they will create their own syrup. Cut the cheesecake in to slices and serve with the strawberries and a drizzle of tequila strawberry syrup."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/17.jpg"
  },
  {
    "id": "18",
    "title": "Bolognese quesadilla",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min",
    "description": "Make this tasty quesadilla recipe with leftovers from the night before: bolognese sauce is transformed into a meaty Mexican-spiced filling.",
    "ingredients": [
      "400g tin red kidney beans, drained and rinsed (see tips)",
      "1 tbsp sliced pickled jalapeño chillies from a jar, roughly chopped",
      "250g beef bolognese sauce (we used leftover easy midweek spaghetti bolognese; see tips)",
      "Handful coriander leaves, roughly chopped",
      "200g monterey jack cheese, grated (see Know-how)",
      "2 large wheat tortillas",
      "Soured cream to serve",
      "1 large avocado, diced",
      "Small handful fresh coriander leaves, roughly chopped",
      "1 spring onion, finely sliced",
      "½ fresh jalapeño chilli, deseeded and finely chopped",
      "Juice ½ lime, plus wedges to serve",
      "1 tbsp olive oil"
    ],
    "method": [
      {
        "Step 1": "In a medium bowl, mix the drained red kidney beans, pickled jalapeños, bolognese sauce and chopped fresh coriander leaves. Divide the mixture, along with the grated cheese, between the tortillas. Fold each tortilla in half to encase the filling."
      },
      {
        "Step 2": "Heat a large dry frying pan over a low-medium heat and toast the quesadillas one at a time for 2-3 minutes on each side until the filling is hot, the cheese is melted and the tortilla is crisp and golden on the outside. Keep warm."
      },
      {
        "Step 3": "While the quesadillas cook, mix all the salsa ingredients together in a small bowl and season to taste with a little salt."
      },
      {
        "Step 4": "Cut the quesadillas into wedges and serve with the salsa, soured cream and lime wedges on the side to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/18.jpg"
  },
  {
    "id": "19",
    "title": "Sausage burritos with pea and avocado guacamole",
    "difficulty": "Easy",
    "portion": "Makes 4 large or 6 smaller burritos",
    "time": "Hands-on time 30 min",
    "description": "Shake up your routine and fill your next burritos with pork sausages and a twist on guacamole made with peas and avocados.",
    "ingredients": [
      "2 tsp olive oil",
      "454g pack sausages, skins removed",
      "3 tbsp Mexican spice mix (or use fajita seasoning)",
      "1 red onion, sliced",
      "2 mixed peppers, sliced – we used red and orange",
      "198g tin sweetcorn, drained",
      "2 avocados, roughly chopped",
      "100g frozen peas, cooked",
      "Juice 1 lime",
      "4 large or 6 small tortilla wraps",
      "2 x 250g pouches cooked basmati rice",
      "125g mature cheddar, grated",
      "Handful fresh coriander",
      "Microwave",
      "Compostable baking paper"
    ],
    "method": [
      {
        "Step 1": "Heat 1 tsp of the oil in a large frying pan. Add the sausages and cook for 9-10 minutes until cooked through, breaking into small chunks with a wooden spoon. Add the spice mix and fry for 1 minute more, then remove with a slotted spoon."
      },
      {
        "Step 2": "Heat the remaining 1 tsp oil in the same pan and fry the onion and peppers for 5 minutes. Stir in the corn and fry for another 2 minutes."
      },
      {
        "Step 3": "Put the avocados, peas, lime juice and some salt and pepper in a mini blender and whizz until smooth – or mash with a fork for a chunkier texture."
      },
      {
        "Step 4": "Warm the tortillas and rice in the microwave according to the pack instructions, then set each tortilla on a square of baking paper. Divide the grated cheese, veg mixture, sausage and most of the coriander and hot rice among the tortillas. Add a dollop of guacamole, then roll up each tortilla and secure with the baking paper."
      },
      {
        "Step 5": "Heat a dry frying pan and add the burritos in their wrappers. Gently press down the burritos and cook for 2-3 minutes on each side until you can see through the paper that the tortilla is golden. Slice in half and serve with the remaining guacamole and coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/19.jpg"
  },
  {
    "id": "20",
    "title": "Taco traybake",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 15 min, oven time 1 hour 40 min",
    "description": "This taco traybake topped with melted cheese really cuts down on the washing up when you’re cooking a midweek meal. Serve with guacamole.",
    "ingredients": [
      "Vegetable oil for frying",
      "1kg beef stewing steak or pork shoulder, cut into 2cm chunks",
      "2 red onions, sliced",
      "2 mixed sweet peppers, sliced",
      "2-3 tbsp mexican spice mix or fajita seasoning",
      "400g tinned tomatoes",
      "300ml chicken stock or water",
      "Juice 2 oranges",
      "198g tin sweetcorn, drained",
      "3 tortilla wraps, cut into triangles",
      "50g cheddar, grated",
      "Fresh coriander and lime wedges to serve (optional)",
      "Shallow flameproof casserole or heavy-based ovenproof saucepan with a lid"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/gas 6. Heat the oil in the casserole/saucepan over a high heat, then add the meat, onions and peppers. Fry for 5 minutes, then stir in the spice mix or fajita seasoning and cook for another minute."
      },
      {
        "Step 2": "Stir in the tomatoes and stock/water and bring to the boil, then cover the casserole/saucepan and transfer to the oven. Cook for 1½ hours, stirring halfway through, until the meat falls apart easily when pressed with a spoon. Remove from the oven and stir, breaking up the meat as you do (see Make Ahead)."
      },
      {
        "Step 3": "Stir in the orange juice and sweetcorn, then top with the tortilla triangles, scatter with the cheese and return to the oven for 10 minutes until the tortilla pieces are golden and the cheese has melted."
      },
      {
        "Step 4": "Serve topped with coriander and lime wedges on the side if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/20.jpg"
  },
  {
    "id": "21",
    "title": "Slow-cooked chipotle chicken",
    "difficulty": "Easy",
    "portion": "Serves 6-8",
    "time": "Hands-on time 25 min, oven time 2 hours",
    "description": "Our slow-cooked chipotle chicken takes inspiration from great Mexican flavours to create an uncomplicated one-pot dinner. The star is the flavour of chipotle, which is a smoke-dried jalapeño chilli and a Mexican staple. Obviously we’ve thrown in guacamole for a side, because – well, who doesn’t like guacamole?",
    "ingredients": [
      "4 tbsp extra-virgin olive oil8 skinless, boneless free-range chicken thighs (about 1.4kg), halved2 red onions, cut into wedges2 red peppers, sliced4 garlic cloves, crushed2 tsp ground cumin2 tsp sweet smoked paprika2 tbsp chipotle paste (see Know-how)1 tbsp good-quality cocoa powder2 x 400g tins chopped tomatoes300ml chicken stock400g tin black beans or kidney beans, rinsed and drainedWarm tortillas, soured cream, coriander leaves and limewedges to serve",
      "4 tbsp extra-virgin olive oil",
      "8 skinless, boneless free-range chicken thighs (about 1.4kg), halved",
      "2 red onions, cut into wedges",
      "2 red peppers, sliced",
      "4 garlic cloves, crushed",
      "2 tsp ground cumin",
      "2 tsp sweet smoked paprika",
      "2 tbsp chipotle paste (see Know-how)",
      "1 tbsp good-quality cocoa powder",
      "2 x 400g tins chopped tomatoes",
      "300ml chicken stock",
      "400g tin black beans or kidney beans, rinsed and drained",
      "Warm tortillas, soured cream, coriander leaves and limewedges to serve",
      "3 avocados, peeled and choppedJuice 1-2 limes1 green chilli, seeds removed, chopped2 spring onions, choppedSmall handful chopped coriander",
      "3 avocados, peeled and chopped",
      "Juice 1-2 limes",
      "1 green chilli, seeds removed, chopped",
      "2 spring onions, chopped",
      "Small handful chopped coriander"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 170°C/150°C fan/gas 3½. Heat 2 tbsp of the oil in a hob safe casserole or large ovenproof sauté pan (you’ll need a lid) over a high heat, then fry the chicken in batches, turning often, for 3-4 minutes until browned all over. Remove and set aside."
      },
      {
        "Step 2": "Heat the remaining oil in the casserole/pan, then fry the onions and peppers for 2-3 minutes. Add the garlic, cumin, paprika, chipotle paste and cocoa, stirring to combine."
      },
      {
        "Step 3": "Return the chicken and any juices to the casserole, stir to coat, then add the chopped tomatoes and stock. Bring to a simmer, season with salt and pepper, then cover and cook in the oven for 1½ hours."
      },
      {
        "Step 4": "Add the beans to the stew and cook, uncovered, for 30 minutes more until the sauce has reduced and thickened."
      },
      {
        "Step 5": "Meanwhile, put all the guacamole ingredients in a food processor. Season with salt and pepper, add a little more lime juice to taste, then pulse until roughly chopped and combined but still with some texture. (Or mash everything together in a mixing bowl with a fork until as smooth as possible.)"
      },
      {
        "Step 6": "Serve the chicken on warm tortillas topped with guacamole, soured cream, coriander and a squeeze of lime."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/21.jpg"
  },
  {
    "id": "22",
    "title": "Beef burrito bowls",
    "difficulty": "Easy",
    "portion": "SERVES 4",
    "time": "HANDS-ON TIME 30 MIN",
    "description": "These easy beef burrito bowls are fun to make and have a spicy chipotle kick! The whole family will love building their own.",
    "ingredients": [
      "1 tbsp sunflower oil, plus extra to brush",
      "2 red onions, sliced",
      "500g British beef mince (5% fat)",
      "2 tsp chipotle chilli paste (from larger supermarkets)",
      "200ml boiling water",
      "4 medium tortilla wraps",
      "2 little gem lettuces or ¼ iceberg lettuce, shredded",
      "250g cherry tomatoes, halved",
      "½ cucumber, diced",
      "6 tbsp greek yogurt",
      "1 lime, quartered, to serve",
      "Pinch paprika, optional"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/ gas 6. Heat the 1 tbsp oil in a large non–stick frying pan, add the red onions and beef mince, then fry over a medium heat for 6-8 minutes until the onions have started to soften and the beef has browned."
      },
      {
        "Step 2": "Mix the chipotle paste with the boiling water, then add to the pan.Season with salt and black pepper, then simmer for 6-8 minutes until the liquid has cooked off."
      },
      {
        "Step 3": "Meanwhile, brush the tortillas with a little oil, then put each onein an ovenproof bowl (pudding basins are ideal). Bake for 5-6 minutes until golden and firm – work in batches if you only have 1 or 2 bowls. Remove from the oven and leave to cool while you repeat with the remaining tortillas."
      },
      {
        "Step 4": "To serve, half-fill the tortilla cases with shredded lettuce, then top with the hot chipotle beef, tomatoes and cucumber. Add a dollop of yogurt and a lime wedge to each, then sprinkle with paprika (if using) and serve straightaway."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/22.jpg"
  },
  {
    "id": "23",
    "title": "Classic margarita cocktail",
    "difficulty": "Easy",
    "portion": "Makes 1",
    "time": "Takes 5 minutes to make",
    "description": "Learn how to make a perfect classic margarita cocktail with our easy recipe. Plus discover how to scale up this classic Mexican tequila drink to serve a crowd.",
    "ingredients": [
      "60ml good quality tequila",
      "45ml fresh lime juice",
      "30ml orange liqueur (Grand Marnier, Cointreau or Triple Sec)",
      "1 cup crushed ice, plus extra to serve (optional)",
      "1 lime wedge to serve",
      "Fine sea salt to serve"
    ],
    "method": [
      {
        "Step 1": "Put the crushed ice in a cocktail shaker, then pour over the tequila, lime juice and Grand Marnier. Secure the lid and shake vigorously for 1 minute."
      },
      {
        "Step 2": "Sweep the lime wedge around the rim of a cocktail or lowball glass to moisten the edge with a little lime juice. Dip the rim of the glass into fine salt and shake off excess. Strain the margarita into the prepared glass, filled with fresh crushed ice if you like. Serve garnished with the lime wedge."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/23.jpg"
  },
  {
    "id": "24",
    "title": "Ensenada fish tacos",
    "difficulty": "Easy",
    "portion": "Serves 4-5 (makes 15 tacos)",
    "time": "Hands-on time 1 hour, plus pickling",
    "description": "Karla Zazueta’s take on Ensenada fish tacos – a Mexican delicacy bursting with fresh, zingy flavours and wonderfully crunchy textures – makes a vibrant family dinner and will satisfy everyone at the table.",
    "ingredients": [
      "140g plain flour, plus extra for dusting",
      "1½ tsp baking powder",
      "1 large free-range egg",
      "1 tsp fine garlic salt",
      "Pinch dried oregano",
      "1 tsp american or dijon mustard",
      "300g sustainable cod fillet, cut into 2cm strips",
      "1 litre vegetable oil for deep frying",
      "15 small corn tortillas to serve (see tip)",
      "Iceberg lettuce, finely shredded, to serve",
      "Lime wedges for squeezing",
      "1 tbsp fine sea salt",
      "1 medium red onion, cut into thin strips",
      "Juice 1 lime",
      "Pinch of dried oregano",
      "1 scotch bonnet chilli, finely chopped",
      "3 medium ripe tomatoes, finely chopped",
      "1 small onion, finely chopped",
      "3 tbsp chopped fresh coriander ",
      "Juice 1 lime",
      "3 tbsp soured cream",
      "3 tbsp good quality mayonnaise",
      "Digital probe thermometer; 2 baking trays lined with kitchen paper"
    ],
    "method": [
      {
        "Step 1": "For the pickled onion, mix the salt with the onion in a small non-metallic bowl, then set aside for 10 minutes. Rinse the onion, drain, then toss with the lime juice, oregano, chilli and a pinch of salt."
      },
      {
        "Step 2": "For the pico de gallo, mix the tomatoes, onion, coriander, lime juice and a pinch of salt in a non-metallic bowl."
      },
      {
        "Step 3": "For the mayo sauce, mix the soured cream and mayo in a bowl with some black pepper."
      },
      {
        "Step 4": "To make the batter, mix the flour, baking powder, egg, garlic salt, oregano, mustard and a grinding of black pepper in a large mixing bowl. Whisk in 175ml water, little by little, stopping when the batter reaches the consistency of double cream (add a few extra splashes of water if you need to)."
      },
      {
        "Step 5": "Dry the fish on kitchen paper, then lightly dust with flour (to help the batter stick). Once all the pieces are dusted, drop each one into the batter and coat well."
      },
      {
        "Step 6": "Pour the oil into a deep heavy-based pan to a depth of about 10cm, then heat until it reaches 180°C on a thermometer (or a cube of bread browns in 20 seconds)."
      },
      {
        "Step 7": "Deep-fry the fish in batches for 3 minutes on each side until golden brown, then drain on the prepared baking trays. Repeat until all the fish is fried."
      },
      {
        "Step 8": "Warm the tortillas, spread with the mayo sauce, then add 1-2 pieces of fried fish, lettuce, salsa and some pickled onion. Serve with lime wedges and cold beer."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/24.jpg"
  },
  {
    "id": "25",
    "title": "Tex-Mex enchilada bake",
    "difficulty": "Easy",
    "portion": "Serves 4 (plus sauce to feed another 4)",
    "time": "Hands-on time 25 min, cooking time 45 min",
    "description": "Here’s a comforting enchiladas recipe to simplify weeknight dinner planning; this bubbling bake is bursting with flavour and will leave you feeling properly fed and satisfied – just what you want from a midweek meal.",
    "ingredients": [
      "Splash light olive oil 450g British free-range pork mince",
      "450g British beef mince (5% fat)",
      "2 onions, sliced ",
      "1½ tbsp cumin seeds, roughly crushed",
      "1-3 tbsp chipotle paste (to taste; we used the Gran Luchito brand, from large supermarkets)",
      "2 x 400g cans chopped tomatoes",
      "3 medium red peppers, sliced ",
      "150g soured cream",
      "4 large tortilla wraps ",
      "1-2 handfuls grated mature cheddar cheese"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a deep, heavy-based frying pan (with a lid) over a medium-high heat. Brown the mince, in 2 batches, stirring regularly until golden and crisp (around 7 minutes per batch). Remove the mince with a slotted spoon and set aside."
      },
      {
        "Step 2": "Turn the heat to medium and add the onions to the pan, stirring with a wooden spoon to dissolve any brown bits from the base. Cover and cook for 5 minutes, stirring now and again."
      },
      {
        "Step 3": "Add the cumin, cook for a minute, then add the chipotle paste, tomatoes and 175ml water. Stir well, bring to the boil, then simmer, uncovered, for 15 minutes. Return the mince to the pan, put the peppers on top, then cover with the lid. Cook for 10 minutes more until the peppers are tender, then season and stir the peppers into the sauce."
      },
      {
        "Step 4": "When ready to serve, heat the oven to 180°C/160°C fan/gas 4. Divide half the mince sauce equally among the 4 tortillas, roll up, then arrange in a baking dish (use one that just fits the wraps). Mix the soured cream with 1 tbsp cold water, then spoon over the top and scatter with the cheese (see tips). Bake for 20 minutes until golden and the cheese has melted."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/25.jpg"
  },
  {
    "id": "26",
    "title": "Scampi tacos with jalapeño tartare sauce and avocado",
    "difficulty": "Easy",
    "portion": "Serves 3-4",
    "time": "Hands-on time 30 min, oven time 12-14 min",
    "description": "These scampi-topped tacos both look and sound impressive but they really couldn’t be easier to make. The jalapeño tartare sauce is the ultimate finishing touch – just combine all the ingredients and voilà!",
    "ingredients": [
      "400g jumbo wholetail breaded scampi (we used Whitby Seafoods)",
      "3 tortilla wraps",
      "½ round lettuce, torn",
      "1 avocado, finely sliced",
      "150g radishes, cut into wedges",
      "Lemon, cut into wedges for squeezing",
      "2 tbsp mayonnaise",
      "4 tbsp soured cream",
      "Splash white wine vinegar",
      "1 tbsp each chopped fresh tarragon and chopped fresh flatleaf parsley",
      "40g cornichons, chopped",
      "2 jalapeños, finely sliced"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 220°C/200°C fan/ gas 7. Spread out the scampi on a baking sheet and cook for 12-14 minutes or according to the packet instructions."
      },
      {
        "Step 2": "For the jalapeño tartare sauce, mix all the ingredients together, then season to taste (see Make Ahead). "
      },
      {
        "Step 3": "Put the tortilla wraps in the oven for the final 1-2 minutes of the scampi cooking time to warm them through. Remove the scampi and tortillas from the oven, then cut each wrap into 4 wedges."
      },
      {
        "Step 4": "Arrange the tortilla wedges on a board or platter, then top each with some torn lettuce, sliced avocado, 2-3 hot scampi, a drizzle of tartare sauce and some radish wedges. Squeeze over lemon juice to serve. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/26.jpg"
  },
  {
    "id": "27",
    "title": "Crispy tacos with charred veg and refried beans",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 45 min",
    "description": "Crispy tortillas are topped with spicy refried beans, warm veg and gooey feta in this fantastic vegetarian dinner. Try swapping the feta for fried halloumi if you prefer a milder flavour.",
    "ingredients": [
      "Olive oil for frying",
      "2 corn on the cobs",
      "250g chestnut mushrooms, sliced",
      "200g runner beans (or helda beans), cut into 2cm piece",
      "400g tin black beans, drained and rinsed",
      "2-3 tbsp chipotle paste",
      "2 tbsp soured cream",
      "100g vegetarian feta, crumbled",
      "8 small soft tortillas",
      "Olive oil for brushing",
      "1 sweet white onion, finely chopped",
      "4 vine tomatoes, deseeded and finely chopped",
      "Large handful fresh coriander, roughly chopped",
      "Juice 1-2 limes"
    ],
    "method": [
      {
        "Step 1": "Heat a glug of oil in a frying pan and cook the corn cobs over a medium-high heat for 15 minutes or so, turning regularly, until lightly charred. Once cool, slice off the kernels into a bowl and set aside. "
      },
      {
        "Step 2": "Add more oil to the pan and cook the mushrooms until golden but still with a bit of bite. Remove with a slotted spoon and add to the corn."
      },
      {
        "Step 3": "Add the runner or helda beans to the pan and cook for about 5 minutes until charred, adding more oil if needed. Return the corn and mushrooms to the pan, then reduce the heat to keep warm."
      },
      {
        "Step 4": "For the tacos, heat a second frying pan and brush the tortillas with a little oil. Fry on each side until crisp. Transfer to a low oven to keep warm as you cook the rest of the tortillas."
      },
      {
        "Step 5": "Combine all the salsa ingredients in a serving bowl. "
      },
      {
        "Step 6": "Put the black beans in a small pan and mash lightly with the back of a fork. Stir in the chipotle paste and soured cream, bring to a simmer, then season with salt and pepper (see Make Ahead)."
      },
      {
        "Step 7": "To serve, crumble the feta into the veg and toss gently. Spread each crispy tortilla with black beans and the vegetable/feta mix, then top with the salsa."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/27.jpg"
  },
  {
    "id": "28",
    "title": "Slow-cooked chicken tinga tacos with pickled onions",
    "difficulty": "Medium",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min, oven time 2 hours",
    "description": "Chicken thighs are slow-cooked with ancho chillies and chipotle paste until pull-apart tender and infused with all their spicy flavour. Shred the meat and then use to top soft tortilla wraps along with the homemade pickled onions and lots of soured cream.",
    "ingredients": [
      "2 dried ancho chillies (from Sainsbury’s, Waitrose, Ocado and souschef.co.uk)",
      "2 dried cascabel chillies (from Waitrose, Ocado and souschef.co.uk)",
      "Olive oil for frying",
      "1kg skinless, boneless free-range chicken thighs, sliced",
      "1 large onion, finely chopped",
      "1 red pepper, finely chopped",
      "4 garlic cloves, crushed",
      "½ tsp dried thyme",
      "2 tbsp tomato purée",
      "4 tbsp chipotle paste",
      "500g ripe tomatoes, roughly chopped",
      "3 fresh thyme sprigs",
      "12 small soft tacos or 8 tortilla wraps",
      "Soured cream, fresh coriander and lime wedges to serve",
      "2 red onions, finely sliced",
      "Juice 3 limes",
      "2 tsp sea salt flakes",
      "Casserole with a lid"
    ],
    "method": [
      {
        "Step 1": " Heat the oven to 180°C/160°C fan/ gas 4. Put the dried chillies in a heatproof bowl/jug, pour over 350ml freshly boiled water, then set aside to rehydrate for 15 minutes."
      },
      {
        "Step 2": "Meanwhile, heat a splash of oil in the casserole and brown the chicken in batches. Transfer to a bowl, then set aside. Add another splash of oil to the casserole, turn the heat down and gently fry the onion and pepper for 10 minutes until softened. Stir in the garlic and dried thyme, then cook for 2 minutes more. "
      },
      {
        "Step 3": "Stir in the tomato purée and chipotle paste and cook for 1-2 minutes. Return the chicken with any resting juices to the casserole, stirring well to coat. "
      },
      {
        "Step 4": "Strain the chillies into the casserole to add the soaking water, leaving the chillies in the sieve. Once the chillies are cool enough to handle, remove the stalks/seeds (discard), then add the chillies to the pan."
      },
      {
        "Step 5": "Add the chopped tomatoes, fresh thyme and a generous pinch of sea salt flakes (see tip). Bring to a simmer, cover with the lid, then cook in the oven for 2 hours. Give everything a stir halfway through to stop the sauce sticking. "
      },
      {
        "Step 6": "Meanwhile, make the pink pickled onions: put the onions, lime juice and salt in a small glass or ceramic dish, then toss to coat. Set aside for 2 hours, stirring occasionally."
      },
      {
        "Step 7": "Once the chicken is cooked through and tender, remove and discard the chillies and thyme sprigs. Using 2 forks, shred the chicken in the pan. Turn off the oven and put the tortillas inside to warm for a few minutes."
      },
      {
        "Step 8": "Serve the chicken in the middle of the table with the warm tortillas, soured cream, pink pickled onions, fresh coriander and lime wedges on the side, letting everyone construct their own taco."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/28.jpg"
  },
  {
    "id": "29",
    "title": "Mexican chicken and red rice burrito bowls",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min, simmering time 5 min",
    "description": "Use a few spare tortilla wraps and some leftover chicken to help make these filling and healthy Mexican chicken and rice burrito bowls.",
    "ingredients": [
      "Juice 2 limes, plus extra wedges to serve",
      "1 small red onion, finely sliced",
      "2 leftover corn tortilla wraps",
      "1 tbsp vegetable oil",
      "2-3 tbsp fajita spice mix, to taste",
      "200ml tomato passata",
      "250g cooked basmati rice (use a ready-cooked pouch if you want to)",
      "198g tin sweetcorn, drained",
      "400g tin black beans, drained and rinsed",
      "Large handful fresh coriander, roughly chopped",
      "450g leftover roast chicken or 3 cooked free-range chicken breasts, shredded"
    ],
    "method": [
      {
        "Step 1": "Put the lime juice in a small glass or ceramic bowl, then add the red onion and a generous pinch of salt. Toss, then set aside to quick-pickle."
      },
      {
        "Step 2": "Heat the grill to medium-high. Grill the wraps for a minute or so on each side until lightly golden. Cool, then roughly break up to make chunky croutons (see Make Ahead)."
      },
      {
        "Step 3": "Heat the vegetable oil in a frying pan, add the spice mix and fry for 1 minute until fragrant. Pour in the passata and bring to a simmer, cook for a few minutes, then add the rice. Cook for 5 minutes until piping hot."
      },
      {
        "Step 4": "Toss the sweetcorn, black beans and most of the coriander together in a mixing bowl."
      },
      {
        "Step 5": "Divide the rice, sweetcorn and bean mixture, quick-pickled red onion and shredded chicken among 4 serving bowls. Top with the tortilla croutons and remaining coriander, then serve with lime wedges to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/29.jpg"
  },
  {
    "id": "30",
    "title": "Cornbread with Mexican-style salad",
    "difficulty": "Easy",
    "portion": "Serves 6 as a side",
    "time": "Hands-on time 10 min, oven time 20 min",
    "description": "This rich and cheesy cornbread is served with a bright corn and tomato salad to cut through it all. Serve as a snack or nibble to please the masses. It’s great enjoyed alongside one of our chilli recipes, too.",
    "ingredients": [
      "Melted butter",
      "120g fine cornmeal",
      "120g self-raising flour",
      "1½ tsp caster sugar",
      " ½ tsp salt",
      " 275g natural yogurt",
      "1 medium free-range egg",
      "90g melted butter, plus extra for greasing",
      "75g crumbled lancashire cheese",
      "2 corn cobs",
      "½ tsp olive oil",
      "Large handful of watercress",
      "250g halved cherry tomatoes",
      "25g crumbled lancashire"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 220°C/200°C fan/gas 7. Brush the inside of a 23cm ovenproof frying pan with a little melted butter. In a bowl, combine the cornmeal, self-raising flour, caster sugar and salt. Mix the natural yogurt, egg, melted butter and 50g crumbled lancashire cheese in a measuring jug. Pour the wet mixture into the dry and stir to combine. "
      },
      {
        "Step 2": "Run a sharp knife down the side of the corn cobs to remove the kernels (discard the cobs). Add three quarters of the kernels to the batter, then pour into the pan. Bake for 20 minutes. Meanwhile, toss the remaining corn ona baking tray with ½ tsp olive oil and roast for 10 minutes."
      },
      {
        "Step 3": "Toss together a large handful of watercress, the halved cherry tomatoes, 25g crumbled lancashire and the roast corn kernels. Scatter over the cornbread to serve. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/30.jpg"
  },
  {
    "id": "31",
    "title": "Sweet potato and black bean nachos",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min, oven time 30 min",
    "description": "This crowdpleaser of a dish proves you don’t need a basketful of expensive ingredients or a complicated recipe to eat well. Our sweet potato nachos recipe feeds four people for just £5.16.",
    "ingredients": [
      "750g sweet potatoes, sliced into 5mm rounds",
      "1 tbsp olive oil",
      "1 red onion, finely sliced",
      "2 tbsp red wine vinegar",
      "400g tin black beans, drained and rinsed",
      "200g ready-made tomato salsa",
      "75g tortilla chips",
      "100g grated vegetarian cheddar",
      "1 large ripe avocado, chopped",
      "Finely grated zest and juice 1 lime",
      "Handful fresh coriander"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 220°C/200°C fan/gas 7. Toss the sweet potatoes in the oil on a roasting tray, season with salt and a grinding of black pepper, then bake for 30 minutes until caramelised and tender."
      },
      {
        "Step 2": "Meanwhile, mix the red onion with the vinegar and a pinch of salt in a glass or ceramic bowl. Set aside to quick-pickle for 25 minutes."
      },
      {
        "Step 3": "Heat the grill to high. Top the sweet potatoes with the black beans and tomato salsa. Crush the tortilla chips in a bowl and mix with the grated cheese, then sprinkle over the potatoes. Grill for 6-8 minutes until everything looks golden and bubbling."
      },
      {
        "Step 4": "Toss the chopped avocado with the lime zest and juice, then scatter over the nachos with the fresh coriander and pickled red onion. Serve straightaway."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/31.jpg"
  },
  {
    "id": "32",
    "title": "Za’atar-spiced lamb tacos",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 25 min, oven time 3½-4 hours ",
    "description": "Let the oven do most of the work for John Gregory-Smith’s slow-cooked lamb tacos, made with Welsh lamb shoulder (in season between August and November). Then, simply dress soft tortilla wraps with pickled red onions, yogurt and fresh pomegranate seeds.",
    "ingredients": [
      "1 tbsp olive oil",
      "1.5kg whole shoulder bone-in Welsh lamb",
      "3 tbsp za’atar spice blend (from large supermarkets)",
      "2 red onions, thinly sliced",
      "Juice 2 lemons",
      "8-12 soft tacos",
      "250g greek yogurt",
      "Large handful fresh coriander leaves, chopped",
      "50g pomegranate seeds"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 240ºC/220ºC fan/gas 9. Rub the oil all over the lamb, then cover it with 2 tbsp of the za’atar and plenty of salt. Put in a roasting tin, add 100ml water and cover the tin tightly with foil. Put the meat into the oven and immediately reduce the heat to 180ºC/160ºC fan/gas 6. Cook for 3½- 4 hours or until you can pull the meat apart with 2 forks. Check the lamb every hour or so, adding a splash more water if it seems dry."
      },
      {
        "Step 2": "Remove the lamb from the oven and leave to rest for 10 minutes. Put the lamb on a chopping board and remove and discard the skin. Pull the meat off the bone and shred with 2 forks. Skim the fat from the roasting juices, then return the shredded meat to the pan. Mix well and check the seasoning, adding salt to taste."
      },
      {
        "Step 3": "Meanwhile, put the red onions in a bowl and add the lemon juice. Add a good pinch of salt and mix well. Leave to pickle for 10-15 minutes, mixing again after 5 minutes, until the onions turn a beautiful light pink colour."
      },
      {
        "Step 4": "Serve the cooked lamb at the table with the onions, tacos, yogurt, fresh coriander and pomegranate seeds."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/32.jpg"
  },
  {
    "id": "33",
    "title": "Perfect guacamole",
    "difficulty": "Easy",
    "portion": "Serves 4-6 as a nibble",
    "time": "Takes 10 min",
    "description": "What’s the secret to the perfect guacamole recipe? Lots of lime, a pinch of chilli and dollops of soured cream for extra smooth richness. Find out how to make it, here, then serve with fajitas, nachos or tacos.",
    "ingredients": [
      "3 ripe avocados",
      "Juice of 2-3 limes",
      "1 tbsp soured cream",
      "½ finely chopped red onion",
      "1 finely chopped red chilli (remove the seeds if you don’t want your guacamole too spicy)",
      "Nachos, crisps or crudités (raw pieces of carrot, cucumber, chicory), to serve"
    ],
    "method": [
      {
        "Step 1": "Chop the avocados, put in a bowl, add the lime juice and soured cream, then mash with a fork."
      },
      {
        "Step 2": "Stir in the chopped red onion and chilli. Season to taste, then serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/33.jpg"
  },
  {
    "id": "34",
    "title": "Steak and pepper fajitas",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min, oven time 20 min",
    "description": "Keep washing up to a minimum with these easy steak and pepper fajitas. They’re tasty, quick and don’t require many ingredients. Just make sure you have plenty of guacamole and soured cream, to serve!",
    "ingredients": [
      "500g British beef stir-fry strips",
      "3 mixed peppers, sliced",
      "1 red onion, chopped into 1cm wedges",
      "1 tbsp vegetable oil",
      "2 tbsp fajita seasoning",
      "8 corn tortillas",
      "75g grated cheddar",
      "Handful fresh coriander, roughly chopped",
      "Ready-made salsa, guacamole and soured cream to serve"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 220°C/200°C fan/gas 7. Put the beef, peppers, onion, oil and fajita seasoning in a large bowl and toss everything until evenly coated in the spices and oil."
      },
      {
        "Step 2": "Lay 4 large strips of foil on a work surface, then divide the meat and peppers evenly among them. Fold up and tightly seal each strip to make 4 parcels. Put on a baking tray, then cook in the oven for 20 minutes."
      },
      {
        "Step 3": "Divide the tortillas into 2 stacks, then wrap each stack in a piece of foil. Warm in the oven for the final 4 minutes of the fajita cooking time. Transfer the tortilla and fajita parcels to a board and assemble, sprinkling with the grated cheese and fresh coriander. Serve with salsa, guacamole and souredcream on the side."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/34.jpg"
  },
  {
    "id": "35",
    "title": "Jalapeño, bacon and crispy potato frittata",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 25 min, cooking time 40 min",
    "description": "A great way to use up roast potatoes, our Mexican-inspired frittata – with salty bacon and warming chipotle mayo – will feed four for less than £6.",
    "ingredients": [
      "650g floury potatoes, such as maris piper, cut into 2-3cm chunks (see Make Ahead and tip)",
      "3 tbsp light olive oil",
      "1-3 fresh jalapeño chillies, finely sliced (see tip)",
      "Finely grated zest and juice 1 large lime",
      "8 large free-range eggs",
      "4 spring onions, sliced",
      "4 tbsp flavoured mayonnaise (we used Gran Luchito Chipotle Chilli Mayo)",
      "Small handful fresh coriander, stalks and leaves chopped separately",
      "175g streaky bacon, roughly chopped",
      "1 small pointed cabbage (or spring greens), roughly chopped",
      "90g cheddar or manchego, cut into small chunks"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/gas 6. Put the potatoes in a pan of cold salted water, bring to the boil and cook for 6 minutes until just tender. Drain and leave to steam dry."
      },
      {
        "Step 2": "Heat the oil in a roasting tin, add the potatoes and season with salt. Roast for 20 minutes or until golden (see Make Ahead and tip)."
      },
      {
        "Step 3": "Meanwhile, put the chillies in a bowl with the lime zest and juice (see tip). Set aside for a few minutes to pickle."
      },
      {
        "Step 4": "In a jug, whisk together the eggs, spring onions, pickled jalapeños, mayonnaise and coriander stalks."
      },
      {
        "Step 5": "Heat a pan or shallow casserole (24-26cm wide across the top) over a medium heat. Add the bacon, fry for 3 minutes, then add the cabbage and cook for around 8 minutes more until softened and golden. Add the roast potatoes and mix well."
      },
      {
        "Step 6": "Heat the grill to medium-high. Pour the egg mixture into the pan and mix it in. Dot over the cheese and continue cooking on the hob for 5 minutes until just set at the edges. Transfer to the grill and cook for about 5 minutes until set but with a slight wobble. Sprinkle over the chopped coriander leaves to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/35.jpg"
  },
  {
    "id": "36",
    "title": "Paloma cocktail",
    "difficulty": "Easy",
    "portion": "1",
    "time": "Ready in 5 mins",
    "description": "Transport yourself to a cantina in Mexico with our paloma recipe – a tequila cocktail with pink grapefruit and lime. It’s the perfect drink for a Mexican feast.",
    "ingredients": [
      "50ml tequila, such as Patrón Reposado",
      "10ml fresh lime juice (about ½ lime), plus an (optional) wedge to wet the glass rim",
      "10ml agave syrup",
      "200ml bottle Franklin & Sons Pink Grapefruit Soda (or a mixture of 60ml fresh grapefruit juice and 140ml regular soda water)",
      "Pink grapefruit slice or wedge to serve"
    ],
    "method": [
      {
        "Step 1": "Rim a tumbler with salt (optional) by wetting the rim with a lime wedge, then dipping it in a saucer of salt. Fill the tumbler with ice, add the tequila, lime juice and agave syrup, then stir well."
      },
      {
        "Step 2": "Top up with Franklin & Sons Pink Grapefruit Soda (or a mixture of fresh grapefruit and juice and soda water), then garnish with a slice or wedge of grapefruit and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/36.jpg"
  },
  {
    "id": "37",
    "title": "Mexican-style prawn rice with avocado salsa",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "This Mexican-style prawn rice dish is rich in Vitamins E, K and B12 making it an easy and healthy meal for busy weeks.",
    "ingredients": [
      "2 tbsp olive oil",
      "2 small red onions, 1 chopped, 1 sliced",
      "1-2 red chillies, chopped",
      "240g basmati rice",
      "400g tin chopped tomatoes",
      "20g fresh coriander, stalks and leaves chopped separately",
      "1 chicken or vegetable stock pot (we used Knorr)",
      "Juice of 1 lemon, plus wedges to serve",
      "300g sustainable peeled raw prawns",
      "200g green beans, tailed",
      "1 large ripe avocado, sliced"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a deep, heavy-based frying pan or shallow casserole with alid. Add the chopped onions, chillies and a pinch of salt, then fry for 5-6 minutes or until the onions are starting to soften."
      },
      {
        "Step 2": "Stir in the rice, then add the chopped tomatoes, chopped coriander stalks and the stock pot. Fill the empty tomato tin with cold water and add to the pan. Stir, then bring to the boil. Cover with the lid, then simmer over a low heat for 12-15 minutes until the rice is almost tender and most of the liquid has been absorbed. "
      },
      {
        "Step 3": "Put the sliced onion in a bowl with the lemon juice. Season with salt and set aside."
      },
      {
        "Step 4": "Once the rice is almost tender, poke in the prawns, then scatter the green beans over the top. Cover again and simmer for another 8 minutes or until the rice is tender and the prawns and beans are cooked through. Take off the heat and leave for a few minutes with the lid on."
      },
      {
        "Step 5": "Stir the avocado and coriander leaves into the onion, season to taste, then spoon over the top of the rice. Serve with lemon wedges for squeezing over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/37.jpg"
  },
  {
    "id": "38",
    "title": "Fish and chip tacos with pea guacamole",
    "difficulty": "Medium",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min, oven time 20 min",
    "description": "We’ve put an update on Friday fish and chips with these Mexican-inspired fish and chip tacos, complete with mushy pea guacamole and pickled red onions.",
    "ingredients": [
      "2 large maris piper potatoes, peeled and cut into matchsticks",
      "Olive oil for frying and drizzling",
      "1 red onion, sliced into thin half-moons",
      "2 tbsp red wine vinegar",
      "1 tsp sugar",
      "150g fresh peas, blanched (or use defrosted frozen peas)",
      "2 ripe avocados, flesh roughly chopped",
      "1 garlic clove, crushed",
      "1 lime, plus extra wedges to serve",
      "Bunch fresh coriander, leaves picked",
      "Splash olive oil",
      "4 tbsp plain flour",
      "2 tsp taco seasoning (we used Luchito brand)",
      "4 x 150g skinless haddock fillets, pin-boned, each fillet cut into 4 chunky strips",
      "4 corn tortillas",
      "4 tbsp mayonnaise",
      "1 tsp chipotle chilli paste"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 220°C/200°C fan/gas 7. Toss the matchstick chips with olive oil to coat, then season well with salt and pepper. Spread out in a single layer on a baking tray lined with non-stick baking paper and bake in the oven for 20 minutes, tossing occasionally, until crisp and golden."
      },
      {
        "Step 2": "Put the red onion in a glass or ceramic bowl with the red wine vinegar, sugar and a pinch of salt. Toss well, then set aside."
      },
      {
        "Step 3": "For the pea guacamole, mash the peas with the avocado, garlic, juice ½ lime, a handful of coriander leaves and a splash of olive oil in a bowl, then season and set aside."
      },
      {
        "Step 4": "For the fish, put the plain flour on a large plate and mix with the taco seasoning. Toss the chunks of fish in the seasoned flour. Heat 1cm olive oil in a large, heavy-based frying pan. When hot, fry the fish, in 2 batches, for 3-4 minutes, turning once, until lightly golden all over and cooked through. Drain on kitchen paper."
      },
      {
        "Step 5": "Warm the tortillas in the hot oven for 1 minute, then transfer to a plate. In a small serving bowl, mix the mayonnaise with the chipotle paste and remaining juice ½ lime. Drain the red onions and put in a separate small serving bowl."
      },
      {
        "Step 6": "To serve, divide the pea guacamole, chips and fish among the tortillas. Drizzle over the chipotle mayonnaise, then top with the pickled onions and the reserved coriander leaves. Eat straightaway with extra lime wedges for squeezing over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/38.jpg"
  },
  {
    "id": "39",
    "title": "Sweet potato, pea and cheese quesadillas",
    "difficulty": "Easy",
    "portion": "Serves 8 as a snack",
    "time": "Hands-on time 30 min",
    "description": "Whether it’s a veggie snack, starter or Friday night meal, these easy, cheesy quesadillas filled with sweet potato and avocado are sure to go down a treat.",
    "ingredients": [
      "300g sweet potatoes",
      "100g drained sweetcorn",
      "125g defrosted petits pois",
      "60g each grated cheddar and mozzarella",
      "Large handful of chopped fresh coriander",
      "8 tortilla wraps",
      "2 stoned avocados",
      "Juice of 1 lime,  plus extra to serve",
      "2 sliced spring onions"
    ],
    "method": [
      {
        "Step 1": "Microwave the sweet potatoes on high for 10-12 minutes until soft. Heat a large non-stick frying pan and fry the sweetcorn until lightly charred, then set aside in a bowl. When the potato is cool enough to handle, scoop out the flesh into a large mixing bowl and mix in the defrosted petits pois, grated cheddar and mozzarella and a large handful of chopped fresh coriander. Divide the mixture equally among 4 tortilla wraps, top with 4 more wraps, then press down to sandwich together."
      },
      {
        "Step 2": "Heat the pan over a medium heat and cook the quesadillas, one at a time, for 3 minutes on each side until golden and the cheese has melted. Keep warm while you cook the rest."
      },
      {
        "Step 3": "Mash the avocados with the  lime juice and serve alongside the quartered quesadillas, sprinkled with the charred corn, sliced spring onions and extra lime wedges for squeezing."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/39.jpg"
  },
  {
    "id": "40",
    "title": "Taco salad bowls with prawns",
    "difficulty": "Easy",
    "portion": "Serves 8 as a starter",
    "time": "Hands-on time 30 min",
    "description": "Serve these prawn taco salad bowls to eight people for a light and speedy starter. They only take half an hour to throw together and you could easily split them between four plates instead for a tasty Friday night meal.",
    "ingredients": [
      "8 tortilla wraps",
      "Olive oil",
      "380-400g sustainable large, peeled raw prawns",
      "2 thinly sliced red peppers",
      "16 trimmed spring onions",
      "2 little gem lettuces",
      "6 tbsp ready-made aioli",
      "Juice of 1 lemon ",
      "Pinch of sea salt flakes",
      "Large pinch of sweet smoked paprika",
      "Handful of chopped parsley"
    ],
    "method": [
      {
        "Step 1": "Heat the grill to medium. Brush the tortilla wraps with a little olive oil, then grill for 1 minute on each side until lightly charred. Quickly and carefully push the warm wraps into 8 shallow bowls and leave to set."
      },
      {
        "Step 2": "Toss the prawns, red peppers and spring onions in a splash of olive oil. Heat a large griddle pan to medium-high. Add the prawns/veg and cook until the prawns are pink and the vegetables are tender, turning throughout. Finely slice the little gem lettuces, then divide among the tortilla bowls and top with the prawns, peppers and spring onions. "
      },
      {
        "Step 3": "Whisk the ready-made aioli,  lemon juice and a pinch of sea salt flakes with a large pinch of sweet smoked paprika. Drizzle the dressing over the salad, then sprinkle with a handful of chopped parsley. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/40.jpg"
  },
  {
    "id": "41",
    "title": "Chicken and pepper pie with tortilla crisps",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 20 min, simmering time 35 min, oven time 6-8 min",
    "description": "This all-in-one chicken and pepper pie is topped with crispy toasted tortillas for extra crunch. Use them to dunk in the spicy filling beneath – it will soon become a family favourite.",
    "ingredients": [
      "Splash of veg oil",
      "1kg sliced skinless, boneless free-range chicken thighs",
      "1 large sliced red onion",
      "2 finely sliced orange peppers ",
      "35g Mexican spice blend (we used Old El Paso Smoky BBQ Fajita Seasoning Mix),",
      "2 x 400g tins of tomatoes",
      "400g tin of black beans",
      "300ml hot chicken stock",
      "8 tortilla wraps ",
      "Handful of chopped fresh coriander"
    ],
    "method": [
      {
        "Step 1": "Heat a splash of veg oil in a casserole. Brown the chicken thighs in batches. Add the sliced red onion and peppers and fry for 5 minutes. Stir in the spice blend, then return the chicken to the pan with the tomatoes, a black beans, drained and rinsed, and hot chicken stock. Bring to the boil, cover and simmer for 35 minutes to thicken."
      },
      {
        "Step 2": "Meanwhile, heat the oven to 180°C/160°C fan/gas 4, cut the tortilla wraps into wedges and bake for 6-8 minutes until golden. Serve some on top of the pie with a handful of chopped fresh coriander and the rest alongside. "
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/41.jpg"
  },
  {
    "id": "42",
    "title": "Mexican-style pork carnitas",
    "difficulty": "Easy",
    "portion": "Serves 8-12",
    "time": "Hands-on time 1 hr 10 min, soaking time 20 min, oven time 2½-3 hours",
    "description": "Sue Quinn’s recipe for these Mexican-style pork carnitas is taken from her cookbook Cocoa (Quadrille £25). ",
    "ingredients": [
      "2 whole ancho chillies",
      "2 whole guajillo chillies",
      "2 tsp cumin seeds",
      "2 tsp fennel seeds",
      "2kg boneless pork shoulder, cut into fist-sized chunks, about 8cm / 3¼in",
      "2 tbsp flaked sea salt",
      "4 tbsp pork fat, lard or dripping (olive oil is fine), plus extra if needed",
      "2 large white onions, chopped",
      "6 garlic cloves, finely chopped",
      "2 tsp hot chilli powder",
      "1½ tbsp dried oregano",
      "2 medium ripe tomatoes, chopped",
      "1 Tbsp chipotle chilli flakes or 1 chipotle chilli in adobo sauce",
      "2 litres diluted beef stock",
      "6 bay leaves",
      "1 tbsp red wine vinegar",
      "30g dark chocolate (100% cocoa solids or as high a percentage as you can find), grated",
      "Salt and freshly ground black pepper (optional)",
      "Guacamole, rice or soft bread rolls, chopped tomato salsa, pickled vegetables, to serve"
    ],
    "method": [
      {
        "Step 1": "Preheat the oven to 170°C / 340°F / Gas mark 3. Cut the whole chillies in half with scissors, discard the stalks and white veins, and collect the seeds. In a dry frying pan, fry the seeds until dark brown, almost burnt, then transfer to a spice or coffee grinder or small food processor. Set the whole chillies aside."
      },
      {
        "Step 2": "Add the cumin and fennel seeds to the frying pan and fry until toasted and fragrant. Add to the chilli seeds in the spice grinder and blitz to a powder. Set aside. Add the reserved whole chillies to the frying pan and fry until the skin is blistered, turning them over frequently. Transfer to a heatproof bowl, cover with boiling water (at least 200ml) and set aside for 20 minutes."
      },
      {
        "Step 3": "Meanwhile, pat the pork pieces dry and rub with the salt. Melt the fat in a large heavy casserole over a medium-high heat and fry the pork until golden brown all over. You will have to do this in batches, so transfer to a bowl as you go and add more fat if the pan becomes dry. Set the meat aside."
      },
      {
        "Step 4": "Add the onions to the pan, along with 1 tablespoon more of the fat if needed, then reduce the heat to low and fry gently until very soft, about 15 minutes. Add the garlic and cook for a few minutes more."
      },
      {
        "Step 5": "Add the reserved ground spices and chilli seeds to the onions, along with the chilli powder, oregano and tomatoes. Cook, stirring, over a medium heat for a few minutes until everything is amalgamated and the tomatoes have cooked down a little."
      },
      {
        "Step 6": "Drain the soaked chillies through a sieve [strainer], reserving the soaking liquid. Transfer to a food processor along with the chipotle chilli flakes (or chilli plus 1 tablespoon of the adobo sauce, if using) and 200ml of the chillies soaking liquid and blitz to a smooth paste. Add this to the onions and fry gently for 5 minutes."
      },
      {
        "Step 7": "Transfer the onion mixture to a large baking tray that has sides 7cm deep, add the meat and enough of the stock to almost cover – you want about 1cm to poke above the liquid. Tuck in the bay leaves so they are submerged. Set the tray on the hob and bring to the boil, skimming off any scum or fat. Cover tightly with foil and transfer to the oven. Cook for 2½–3 hours until the meat is very soft and can be pulled apart with forks. The top of the meat will have a dark crust and the liquid should be bubbling and a little reduced."
      },
      {
        "Step 8": "Scoop the meat out of the sauce onto a large serving plate and shred with 2 forks, adding a little of the sauce from the baking tray to moisten. Set the baking tray on the hob over a medium heat, or pour the sauce into a pan and simmer until reduced and thickened to your liking. Add the vinegar and grated chocolate and simmer for a few more minutes. Taste and add more vinegar, chocolate or salt and pepper."
      },
      {
        "Step 9": "Pour some of the sauce over the pork and take to the table. Serve the remaining sauce in a jug on the side for guests to help themselves, along with guacamole, rice or soft bread rolls, chopped tomato salsa and pickled vegetables."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/42.jpg"
  },
  {
    "id": "43",
    "title": "Sweet potato chilli nachos",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min, simmering time 40 min, oven time 10 min ",
    "description": "A great sharing starter for a Mexican-inspired feast. Try this vegetarian sweet potato chilli, made with smoked paprika and black beans, on top of tortilla chips and served with soured cream and cheddar cheese.",
    "ingredients": [
      "Olive oil for frying",
      "1 onion, finely chopped",
      "2 garlic cloves, finely chopped",
      "1 tsp cumin seeds",
      "1 tbsp smoked paprika",
      "Pinch chilli flakes",
      "1 tbsp tomato purée",
      "4 sweet potatoes, peeled and cut into 1cm chunks",
      "400g tin black beans, drained and rinsed",
      "400g tin chopped tomatoes",
      "400ml vegetable stock",
      "Large handful fresh coriander, chopped",
      "1 large bag tortilla chips (about 200g; use a mix of regular and blue maize chips, if you like)",
      "100g mature cheddar, grated",
      "2 tbsp soured cream"
    ],
    "method": [
      {
        "Step 1": "Heat a splash of olive oil in a large frying/sauté pan (with a lid) over a medium heat, add the onion and garlic and fry for 5 minutes without colouring. Season with salt and pepper."
      },
      {
        "Step 2": "Add the cumin, paprika and chilli flakes and cook for another 2-3 minutes, then stir in the tomato purée and cook for 3 minutes."
      },
      {
        "Step 3": "Add the sweet potatoes and mix in well, then add the black beans, chopped tomatoes and vegetable stock and season with salt and pepper. Cover the pan with a lid and cook over a low heat for 40 minutes, stirring every 10 minutes or so."
      },
      {
        "Step 4": "When the 40 minutes is up, add half the chopped coriander. Heat the oven to 220°C/200°C fan/gas 7. Open the tortilla chips and spread half over the base of a deep baking tray. Add half the sweet potato ragout in an even layer, then add half the grated cheddar. Repeat with the remaining tortilla chips, ragout and cheddar."
      },
      {
        "Step 5": "Bake for 10 minutes until the cheese is melted and turning golden. Finish with the soured cream spooned evenly over and the rest of the coriander sprinkled on top. Eat straightaway."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/43.jpg"
  },
  {
    "id": "44",
    "title": "Easy Mexican chicken traybake",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 10 min, oven time 45-50 min ",
    "description": "Try our easy Mexican chicken traybake for a healthy meal that’s high in protein, fibre and plenty of flavour. It only requires one tray too, so you don’t have to worry about the washing up.",
    "ingredients": [
      "2 red onions, cut into wedges",
      "4 free-range chicken legs, or 1kg free-range chicken thighs and drumsticks",
      "2-3 tbsp Mexican or fajita spice mix",
      "2 tbsp olive oil, plus extra for drizzling",
      "400g tin red kidney beans, drained and rinsed",
      "200g roasted red peppers from a jar, halved, or frozen sliced mixed peppers",
      "1 flour tortilla, cut into 1.5cm strips",
      "75g lancashire cheese or feta, crumbled",
      "A few fresh coriander sprigs to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/gas 6. Put the onions and chicken in a large roasting tin. Mix together the spice mix and 2 tbsp oil, then rub all over the chicken. Put in the oven and roast for 30 minutes."
      },
      {
        "Step 2": "Add the kidney beans and peppers (with the pepper juices) to the tin. Return to the oven for another 15-20 minutes."
      },
      {
        "Step 3": "Meanwhile, put the tortilla strips on a baking sheet, toss in a drizzle of oil and bake for 10 minutes until crisp."
      },
      {
        "Step 4": "Remove the traybake from the oven, sprinkle over the cheese, tortilla stripsand coriander (if using), then serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/44.jpg"
  },
  {
    "id": "45",
    "title": "Sweet potato, red pepper and turkey enchiladas",
    "difficulty": "Easy",
    "portion": "Serves 3-4",
    "time": "Hands-on time 20 min, oven time 12-15 min",
    "description": "Use up leftover turkey and cheese in these easy enchiladas. They make a fun Friday night meal and you could easily add any extra veggies you fancy too.",
    "ingredients": [
      "1 large sweet potato, peeled and cut into 1.5cm cubes",
      "Olive oil for drizzling",
      "6 small corn tortilla wraps",
      "350g cooked turkey or chicken (breast or thigh)",
      "2 roasted red peppers from a jar, cut into slices (we like Karyatis)",
      "75g mature cheddar, grated",
      "75g cherry tomatoes, cut into wedges",
      "2 tbsp chipotle paste",
      "Finely grated zest and juice 1 lime4 tbsp soured cream",
      "Handful fresh coriander leaves to garnish"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°fan/gas 6. Put the sweet potato in a microwave-safe bowl with a drizzle of oil and seasoning, cover loosely with cling film, then cook on full power for 6-8 minutes, or until the potato is soft (see tip)."
      },
      {
        "Step 2": "Lay the tortilla wraps on a chopping board. Divide the sweet potato amongthe wraps and use the back of a fork to squash it down gently. Roughly slice the turkey and arrange over the top, then divide the roasted red peppers and half the cheese among the wraps and season. Roll up each wrap tightly and arrange in a small baking dish. Sprinkle over the rest of the cheese and bake for 12-15 minutes."
      },
      {
        "Step 3": "Meanwhile, in a small bowl mix the tomatoes with the chipotle paste, lime  zest and juice. When the enchiladas are hot and the cheese has melted, serve them with the tomato sauce, soured cream and coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/45.jpg"
  },
  {
    "id": "46",
    "title": "Breakfast burrito",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 25 min, cooking time 15 min",
    "description": "Make a Mexican feast for breakfast with these flavour-packed burritos. Fill your tortilla with spicy beans, a fresh tomato salsa and your favourite breakfast bits and bobs.",
    "ingredients": [
      "4 small free-range eggs",
      "8 rashers of smoked streaky bacon",
      "1 tbsp light olive oil",
      "1 red onion, finely chopped",
      "200g passata",
      "40g ketchup",
      "1 tsp ground cumin",
      "1 tsp sweet smoked paprika",
      "1 tsp Tabasco",
      "1 tsp Worcestershire sauce",
      "1½ x 400g cans black beans (360g total drained weight)",
      "½ red onion, finely chopped",
      "150g mixed tomatoes, finely chopped",
      "1 jalapeño or green chilli, finely chopped",
      "Juice 1 large lime",
      "Soured cream or chipotle mayo (we like Gran Luchito)",
      "4 large tortilla wraps",
      "Bunch fresh coriander, finely chopped",
      "60g mature cheddar, grated",
      "2 small avocados, peeled, stoned and halved",
      "Finely grated zest and juice 1 lime",
      "Mexican chilli sauce and sliced jalapeños"
    ],
    "method": [
      {
        "Step 1": "For the beans, heat the oil in a small saucepan over a medium heat, add the onion and cook for 5 mins until golden brown. Add the passata, ketchup, cumin, paprika, tabasco, Worcestershire sauce and 2 tbsp water, then bring to the boil and gently simmer for 10 min. Add the beans, season with salt and pepper and cook for 5 more minutes. Add a splash more water to loosen, if necessary (see Make Ahead)."
      },
      {
        "Step 2": "For the pico de gallo salsa, mix the red onion, tomatoes, chilli, lime zest and juice. Set aside until needed."
      },
      {
        "Step 3": "Boil the eggs in a pan of boiling water for 6 min for runny yolks, 7 min for soft and 8 for hard boiled. Drain and run under cold water then peel. Meanwhile under a medium high grill, cook the bacon for 2 min each side until crisp."
      },
      {
        "Step 4": "To assemble spread the soured cream/chipotle mayo in the middle of the wraps, sprinkle with a little coriander then cheese. Spread over a thin layer of the beans, 2 slices of crispy bacon, then set the avocado (cut side up) in the middle, sprinkle over the rest of the coriander and the lime zest and juice, season and drizzle over the chilli sauce. Set the egg into the hollow of the avocado (you may need to spoon out a little of the flesh to help the egg fit), then add some more beans behind the egg to make an even sausage shape. Add the pico de gallo, Mexican chilli sauce and jalapeños then fold the top and bottom edges inwards and roll from right to left tucking in the wrap to secure the filling and slice in half."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/46.jpg"
  },
  {
    "id": "47",
    "title": "Mexican chicken and tortilla stew",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 45 min, simmering time 15 min",
    "description": "We’ve used a ready-roast chicken to cut down the cooking time of this Mexican stew recipe while still ensuring high quality flavour.",
    "ingredients": [
      "Splash of vegetable oil",
      "1 chopped red onion",
      " 1½ tbsp fajita seasoning  ",
      "1 sliced orange pepper",
      "400g tin of black beans",
      "198g tin of sweetcorn",
      "2 x 400g tins of chopped tomatoes",
      "1kg higher welfare cooked roast chicken",
      "1 tbsp soured cream",
      "Few sliced radishes",
      "Squeeze of lime juice",
      "A few fresh coriander leaves",
      "Tortilla chips"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large pan over a medium heat. Add the onion and fry, stirring, for 5 minutes. Add the fajita seasoning and continue to cook for 2 minutes. Add the orange pepper and fry for a further 5 minutes until just softened. "
      },
      {
        "Step 2": "Drain and rinse the black beans and sweetcorn, then add to the pan with the chopped tomatoes (rinse out each tomato tin with 100ml hot water and add to the pan too). Stir well and bring to a simmer, then cook for 10-15 minutes until slightly reduced. Remove the meat from the roast chicken and shred. Add most of the chicken to the stew, then season and stir to warm through."
      },
      {
        "Step 3": "Divide the stew among 6 bowls. Top each with 1 tbsp soured cream, the remaining shredded chicken, a few sliced radishes, a squeeze of lime juice and a few fresh coriander leaves. Serve with tortilla chips to dip."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/47.jpg"
  },
  {
    "id": "48",
    "title": "Black bean, sweetcorn and red pepper chimichangas",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 15 min, cooking time 10 min",
    "description": "These cheesy black bean and red pepper chimichangas are sprinkled with extra cheddar and grilled until gooey and crispy. Serve with guacamole and soured cream.",
    "ingredients": [
      "2 x 400g tins black beans, drained and rinsed",
      "2 tbsp chipotle paste",
      "396g tin sweetcorn, drained",
      "100g lancashire cheese, crumbled",
      "3 ready-roasted red peppers from a jar, roughly chopped",
      "Finely grated zest 1 lime, juice of 2, plus wedges to serve",
      "8 tortilla wraps",
      "Vegetable oil for brushing",
      "150g pot guacamole",
      "4 tbsp soured cream",
      "Handful fresh coriander leaves"
    ],
    "method": [
      {
        "Step 1": "Heat the grill to high. Combine the black beans, chipotle paste, two thirds of the sweetcorn, half the cheese and half the red peppers in a bowl. Mash together roughly using a potato masher or fork, then season with plenty of lime juice and a little salt."
      },
      {
        "Step 2": "Divide the black bean mixture evenly among the tortilla wraps. Fold the sidesof each wrap towards the centre, then roll up tightly to form a parcel. Arrange the wraps, folded-side down, in a microwave and ovenproof baking dish and brush with the vegetable oil."
      },
      {
        "Step 3": "Mix together the remaining sweetcorn, cheese and red peppers in a bowl with the lime zest and a squeeze of juice. Season to taste and sprinkle over the wraps."
      },
      {
        "Step 4": "Microwave the whole baking dish on high for 5 minutes, then immediately transfer to the grill and cook for a further 5 minutes until golden and heated through."
      },
      {
        "Step 5": "Spoon over the guacamole and soured cream, sprinkle over the coriander leaves and serve with the lime wedges."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/48.jpg"
  },
  {
    "id": "49",
    "title": "Real black bean chilli con carne with avocado and lime salsa",
    "difficulty": "Easy",
    "portion": "Serves 8",
    "time": "Hands-on time 40 min, simmering time 3 hours (if cooking beans), plus soaking",
    "description": "A real beef and black bean chilli con carne that’s slow-cooked until rich, thick and the meat easily falls apart. It’s proper, comforting sharing food that will feed hungry mouths, happily. If you like it hot, don’t shy away from adding extra Tabasco to the avocado salsa!",
    "ingredients": [
      "225g dried black beans, soaked overnight (see tip)",
      "4 tbsp sunflower oil",
      "1.5kg chuck steak, cut into 2.5cm chunks",
      "1 large onion, chopped",
      "5 garlic cloves, crushed",
      "4 tsp chipotle chilli paste",
      "3 jalapeño chillies, deseeded and finely chopped",
      " 1 tbsp toasted cumin seeds, ground",
      "1 tbsp sweet paprika powder",
      "1½ tsp medium chilli powder (optional)",
      "400g can chopped tomatoes",
      "800ml fresh beef stock",
      "1 tbsp light muscovado sugar",
      "2 tsp dried oregano",
      "6 fresh bay leaves",
      "Steamed white rice to serve",
      "Soured cream to serve",
      "Coarsely chopped fresh coriander or whole leaves to garnish",
      "2 small ripe but firm avocados, peeled, stones discarded and the flesh cut into small dice",
      "1 medium red onion, finely chopped",
      "2 jalapeño chillies, deseeded and finely chopped",
      "20g fresh coriander, coarsely chopped",
      "Juice 1 lime",
      "4 shakes Tabasco chipotle sauce"
    ],
    "method": [
      {
        "Step 1": "Drain the black beans, put them in a pan and cover with cold water. Bring to the boil and boil vigorously for 10 minutes. Lower the heat, cover and cook for 45-50 minutes or until tender, adding 1 tsp salt 5 minutes before the end of cooking. Drain and set aside (see tip)."
      },
      {
        "Step 2": "Meanwhile heat 3 tbsp of the oil in a large flameproof casserole or non-stick pan. Brown the meat in batches over a high heat until well coloured all over. Lift onto a plate as each batch browns and set aside."
      },
      {
        "Step 3": "Add the remaining 1 tbsp oil and, when hot, add the onion and cook gently, stirring, for 10-15 minutes until soft and nicely caramelised. Add the garlic, chipotle paste, jalapeños, ground toasted cumin seeds, paprika and chilli powder, if using. Fry over a medium heat for 1 minute."
      },
      {
        "Step 4": "Return the beef to the pan with the chopped tomatoes, beef stock, sugar, dried oregano and bay leaves. Season lightly, part-cover, then simmer gently for 2½ hours. Add the cooked beans (see tip) to the pan and simmer, uncovered, fora further 20-30 minutes, stirring gently now and then so as not to break up the meat, until the liquid has reduced to a sauce and the beef is meltingly tender (see Get Ahead)."
      },
      {
        "Step 5": "To serve, mix the salsa ingredients in a bowl with a little salt to taste. Taste and adjust the seasoning of the chilli con carne, if necessary. Remove the bay leaves and serve on steamed white rice with soured cream and the salsa, garnished with the chopped fresh coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/49.jpg"
  },
  {
    "id": "50",
    "title": "Cheesy quesadillas with tomato, red pepper and avocado salsa",
    "difficulty": "Easy",
    "portion": "Serves 4 as a light snack",
    "time": "Hands-on time 30 min",
    "description": "These quick quesadillas make a cracking crowdpleaser and only take half an hour to make.",
    "ingredients": [
      "2 chopped ripe avocados",
      "250g chopped cherry tomatoes",
      "1 bunch chopped fresh coriander",
      "1 sliced shallot",
      "Finely grated zest and juice of 1 lime",
      "1 tbsp olive oil",
      "100g grated cheddar",
      "50g sliced roasted red peppers",
      "½ tsp chipotle chilli flakes",
      "4 small corn tortillas",
      "Soured cream, to serve"
    ],
    "method": [
      {
        "Step 1": "Mix the avocados, cherry tomatoes, coriander, shallot, the zest and juice of 1 lime, 1 tbsp olive oil and plenty of salt and pepper in a bowl."
      },
      {
        "Step 2": "In another bowl, mix together the cheddar, roasted red peppers, chipotle chilli flakes and some black pepper. Divide the mixture between 2 small corn tortillas and top with 2 more small corn tortillas."
      },
      {
        "Step 3": "Heat a dry frying pan over a medium heat and toast the quesadillas for 2 minutes on each side until golden, crisp and oozy. Cut the quesadillas into wedges and serve with the salsa and soured cream."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/50.jpg"
  },
  {
    "id": "51",
    "title": "Prawn tacos",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "Soft tortillas are filled with fajita-spiced prawns, soured cream and a pretty pink pickled cabbage mix. They’re fun to make with kids and only take half an hour.",
    "ingredients": [
      "½ red cabbage, finely shredded",
      "Juice 3 limes",
      "100g radishes, sliced",
      "Large handful fresh coriander, leaves roughly chopped",
      "1 ripe avocado",
      "200g sustainable frozen raw prawns, defrosted",
      "2 tsp fajita spice mix (Schwartz, Bart or Old El Paso)",
      "1 tbsp vegetable oil",
      "8 small soft white tortilla wraps",
      "8 tbsp soured cream"
    ],
    "method": [
      {
        "Step 1": "Toss the cabbage in a bowl with a large pinch of sea salt and the juice of2 of the limes. Set aside for 10 minutes to slightly pickle. Mix in the sliced radishes and most of the coriander."
      },
      {
        "Step 2": "Meanwhile, mash the avocado in a small bowl with the remaining lime juice, salt and ground black pepper. "
      },
      {
        "Step 3": "Heat a griddle pan until hot. Toss the prawns in a bowl with the fajita spice mix and oil, then cook for 2 minutes on each side or until cooked through."
      },
      {
        "Step 4": "To serve, warm the tortillas in the microwave (or in a hot oven or dry frying pan), then top with the soured cream, pickled veg, mashed avocado, prawns and remaining coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/51.jpg"
  },
  {
    "id": "52",
    "title": "Mexican chicken taco salad",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min",
    "description": "Try our filling main-course salad of Mexican-spiced chicken, lots of veggies and a creamy chilli dressing.",
    "ingredients": [
      "2 large red peppers, cut into large chunks",
      "4 large salad onions, cut into thirds lengthways or 1 red onion cut into wedges ",
      "4 tsp light olive oil",
      "1-2 tbsp chilli sauce (such as chipotle sauce or Cholula)",
      "Grated zest 2 limes and juice 1, the remaining lime cut into wedges",
      "4 tbsp mayonnaise",
      "1 large crunchy lettuce, roughly shredded",
      "350g mixed tomatoes, roughly chopped",
      "4 large or 6 small corn tortillas (we used Wahaca flour and yellow corn tortillas from Ocado)",
      "Large handful fresh coriander, leaves picked and chopped",
      "1 ready-roasted rotisserie chicken (roughly 900g), cut into chunky portions"
    ],
    "method": [
      {
        "Step 1": "Heat a griddle pan or grill to high. Toss the peppers and onions in the oil and cook for 1-2 minutes on each side until slightly softened and lightly charred. Set aside."
      },
      {
        "Step 2": "Meanwhile make a dressing by mixing the chilli sauce, lime zest and juice, and mayo until smooth, then set aside. Put the lettuce and tomatoes in a large bowl."
      },
      {
        "Step 3": "Griddle/grill the tortillas for 30 seconds or so on each side until lightly toasted, then cut into wedges. Toss the peppers, onions, coriander and a little dressing with the rest of the salad and season with salt and pepper. Tip the dressed salad onto a serving platter, arrange the chicken portions and tortillas on top and serve with the remaining dressing and lime wedges for squeezing on the side."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/52.jpg"
  },
  {
    "id": "53",
    "title": "Nachos with pulled pork and sweetcorn salsa",
    "difficulty": "Medium",
    "portion": "Serves 4-6",
    "time": "Hands-on time 35 min, oven time 1 hour 40-45 min",
    "description": "Layer up nachos with succulent pulled pork, cheddar and a sweet and zingy sweetcorn salsa. Friday night in just got a whole lot better, thanks to our easy nachos recipe.",
    "ingredients": [
      "3 tbsp olive oil",
      "2 large banana shallots, finely sliced",
      "600g British free-range pork shoulder, cut into 2cm cubes",
      "3 fat garlic cloves, crushed",
      "1½ tbsp ground cumin",
      "1 tbsp ground coriander",
      "1 tsp ground cinnamon",
      "1 tsp mild chilli powder",
      "½ tsp ground allspice",
      "2 tsp each dried thyme and dried oregano",
      "3 tbsp tomato purée",
      "3 tbsp red wine vinegar",
      "500ml chicken stock",
      "2 tsp caster sugar",
      "100ml whole milk",
      "½ red onion, finely diced",
      "1 tbsp red wine vinegar",
      "1 tsp caster sugar",
      "198g tin sweetcorn, drained and rinsed",
      "½-1 jalapeño chilli or red chilli, deseeded and finely chopped",
      "1 ripe avocado, peeled and cut into small dice",
      "1 small bunch fresh coriander, finely chopped",
      "Juice ½ lime",
      "200g bag tortilla chips",
      "Extra-mature cheddar, grated",
      "Soured cream and pickled jalapeños (optional)"
    ],
    "method": [
      {
        "Step 1": "To make the pulled pork, heat the oven to 200°C/180°C fan/gas 6. Heat the oil in a large flameproof casserole (one with a lid) on a medium heat, then fry the shallots for 5-6 minutes, stirring often, until slightly softened but not coloured. Turn up the heat, season the pork with salt, then add to the pan and fry for 4-5 minutes, stirring, until the meat has coloured slightly on the outside. Reduce the heat to medium, add the garlic and cook, stirring, for 1-2 minutes, then add all the spices and dried herbs. Stir to coat the meat and fry for 2 minutes until the spices are fragrant. (If they start to catch on the bottom of the pan adda splash of water and keep stirring.)"
      },
      {
        "Step 2": "Stir in the tomato purée and red wine vinegar and cook for 2-3 minutes. Pour in the chicken stock and add the sugar and milk, bring everything to a simmer, then put the lid on and transfer to the oven. Cook for 1½ hours, stirring halfway through, until the pork falls apart easily when pressed with a spoon."
      },
      {
        "Step 3": "When the meat is tender, remove it to a bowl using a slotted spoon and put the pan with the remaining sauce on the hob. Bring back to a simmer for 10 minutes or until reduced by half. Meanwhile, shred the pork with 2 forks, then add it back to the sauce, stir and set aside until ready to assemble the nachos."
      },
      {
        "Step 4": "To make the salsa, put the red onion, vinegar and sugar in a glass or ceramic bowl with a generous scattering of salt and stir to combine. Leave for 10 minutes so the onions lightly pickle, then stir in the remaining ingredients, taste and season again. Chill until ready to serve."
      },
      {
        "Step 5": "To assemble the nachos, heat the oven to 200°C/180°C fan/gas 6. Scatter the tortilla chips in a baking dish or tray, then spoon over the warm pork. Sprinkle with as much grated cheese as you see fit, then heat in the oven for 10-15 minutes until the cheese has melted. Spoon the salsa over the top, then serve with any extra salsa, and the soured cream and jalapeños if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/53.jpg"
  },
  {
    "id": "54",
    "title": "Crispy Mexican tortilla rice bowl",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "Hands-on time 20 min",
    "description": "Cooking for one needn’t be a chore. This flavour-packed Mexican meal is on the table in just 20 minutes but tastes like it took much longer.",
    "ingredients": [
      "1 tbsp rapeseed oil",
      "1 corn tortilla",
      "50g roasted red peppers from a jar, chopped",
      "50g tinned sweetcorn",
      "½ red onion, finely chopped",
      "Small bunch fresh coriander, chopped",
      "Grated zest 1 lime and juice ½ lime ",
      "½ tsp smoked paprika",
      "3 tbsp soured cream",
      "140g pouch Tilda Pulses and Rice (black bean, jerk and coconut)",
      "½ ripe avocado, sliced"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large frying pan over a medium heat. Cut the tortilla in half, then into strips about 1cm wide. Fry in the pan, turning once, for 3-4 minutes until golden and crisp. Set aside on kitchen paper to drain."
      },
      {
        "Step 2": "Make a salsa by mixing the red peppers, sweetcorn, onion, most of the coriander and the lime juice ina bowl, then season with salt and pepper. In a separate small bowl, stir the lime zest and paprika into the soured cream."
      },
      {
        "Step 3": "Empty the pouch of pulses into a serving bowl and mix in half the salsa and half the tortilla strips. Top with the sliced avocado and the rest of the salsa and tortilla strips, then drizzle over the spiced soured cream and scatter with the remaining coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/54.jpg"
  },
  {
    "id": "55",
    "title": "Charred corn and chicken tacos",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "Lightly charred summer sweetcorn is the star of this quick chicken taco recipe. We love the smoky flavour when cooked on a barbecue but the recipe works just as well on a griddle pan too.",
    "ingredients": [
      "4 tbsp olive oil",
      "¼ tsp sweet smoked paprika",
      "1 tbsp chipotle sauce (we used Tabasco chipotle sauce)",
      "3 limes",
      "3 tbsp good quality mayonnaise",
      "2 sweetcorn cobs in their husks",
      "8 small or 4 large, soft corn tortillas",
      "2 ripe avocados, sliced",
      "2 cooked free-range chicken breasts, sliced (see Next Time)",
      "4 spring onions, sliced",
      "150g cherry tomatoes, halved",
      "Handful fresh coriander leaves"
    ],
    "method": [
      {
        "Step 1": "Light a barbecue or heat a griddle pan to high. In a small bowl, mix the oil, paprika, chipotle sauce and the finely grated zest and juice of 1½ limes. Transfer 2 tbsp to a separate bowl and mix with the mayo to make a dressing.Set aside."
      },
      {
        "Step 2": "When the barbecue coals are glowing white or the griddle pan is hot, peel back the husks from the corn, cut off or tie back with string, then brush each cob with some chipotle and lime mixture. Cook, turning and basting with the rest of the chipotle and lime mixture, until beginning to char on all sides (10-15 minutes). Once cool enough to handle, hold each cob vertically on a secure chopping board and carefully slice down the sides with a sharp knife to remove the kernels."
      },
      {
        "Step 3": "Warm the tortillas on the barbecue or in the griddle pan for 1-2 minutes. Top with avocado, chicken (or see Next Time), spring onions, tomatoes, charred corn, a spoonful of dressing and a few coriander leaves. Serve with the remaining limes, cut into wedges, for squeezing."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/55.jpg"
  },
  {
    "id": "56",
    "title": "Mexican chicken burgers",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 40 min, plus marinating",
    "description": "It’s too difficult to choose between fajitas or burgers so we’ve put juicy chipotle-spiced chicken, guacamole and fresh coriander between two buns.",
    "ingredients": [
      "4 British free-range skinless chicken breasts",
      "4 tbsp cold-pressed rapeseed oil or olive oil",
      "2 tsp ground cumin",
      "Juice 3 limes, plus 4 lime wedges to serve",
      "2 garlic cloves, 1 finely sliced, 1 crushed",
      "1 tbsp chipotle paste",
      "2 red onions, finely sliced into rings",
      "2 ripe avocados",
      "1 red chilli, deseeded and finely chopped",
      "Large bunch fresh coriander, roughly chopped",
      "Grilled crusty roll, chopped fresh coriander, soured cream and curly fries (optional)"
    ],
    "method": [
      {
        "Step 1": "Put the chicken breasts between 2 sheets of baking paper and use a meat tenderiser or rolling pin to flatten them to a 2-3cm thickness. Put the chicken in a non-metallic bowl with the oil, cumin, juice of 2 limes, the sliced garlic clove and half the chipotle paste. Marinate for at least 30 minutes, but preferably overnight, in the fridge."
      },
      {
        "Step 2": "Put the onion rings in a bowl of water (to reduce the sharpness). In another bowl, mash the avocados with the crushed garlic, the rest of the lime juice and chipotle paste, the chilli and half the coriander."
      },
      {
        "Step 3": "When the chicken has marinated, heat a large griddle pan. Once the pan is smoking hot, add the chicken and griddle for 5-6 minutes on each side, basting with the marinade. The chicken should be lightly charred and cooked through – cut into the thickest part to check."
      },
      {
        "Step 4": "To serve, layer the grilled rolls with the mashed avocado, onion rings and chicken, sprinkle with the remaining coriander and serve with soured cream, lime wedges and curly fries (if you like)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/56.jpg"
  },
  {
    "id": "57",
    "title": "Mexican fish tacos",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 45 min",
    "description": "Serve all the elements of these fish tacos in separate bowls for a sharing-style family dinner. The cooling guacamole nicely complements the heat from the spice rubbed cod – making it easy to tailor the dish to your taste.",
    "ingredients": [
      "800g sustainable cod fillets, cut into 3cm pieces",
      "About 100g coarse salt",
      "Splash rapeseed or olive oil",
      "12 corn tortillas",
      "Soured cream to serve",
      "½ tsp cayenne pepper",
      "1 tsp smoked paprika",
      "½ tsp garlic powder",
      "1 tsp ground cumin",
      "1 tsp dried oregano",
      "3 tbsp plain flour",
      "½ red onion, finely chopped",
      "1 red chilli, finely chopped",
      "3 very ripe avocados",
      "1 garlic clove, crushed",
      "Juice 1-2 limes",
      "Bunch fresh coriander, chopped",
      "200g cherry tomatoes, quartered",
      "Large bunch each fresh flatleaf parsley, basil and mint, chopped",
      "3 tbsp red wine vinegar",
      "3 tbsp olive oil",
      "1 tbsp caster sugar",
      "2 little gem lettuces, leaves torn",
      "½ red onion, very thinly sliced"
    ],
    "method": [
      {
        "Step 1": "Put the cod fillets onto a plate and cover with the salt. Leave for 15 minutes or so, then rinse off the salt using plenty of cold water and thoroughly pat the fish fillets dry with kitchen paper. Slice the fish into 3cm pieces and put into a bowl."
      },
      {
        "Step 2": "Mix all the spice rub ingredients together in a small bowl, then sprinkle over the cod and turn the fillets to coat evenly."
      },
      {
        "Step 3": "Put the guacamole ingredients into a mini chopper with salt and pepper, whizz to a rough paste and set aside. (Or mash the avocado in a bowl, then stir in the remaining ingredients and seasoning.) Toss together the salad ingredients and season well."
      },
      {
        "Step 4": "Heat a frying pan with a splash of oil. When the pan is really hot, add the fish and fry for 2-3 minutes. Turn the fish carefully, trying not to break it up too much (it will need 4-5 minutes in total), remove and set aside. Add the tortillas and fry for a minute on each side to warm. (If you have a gas hob, lightly char the tortillas in the flame using tongs.)"
      },
      {
        "Step 5": "Layer the fish, guacamole, salad and soured cream in the wraps to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/57.jpg"
  },
  {
    "id": "58",
    "title": "Brazilian black bean soup with raw corn salsa",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 35 min, simmering time 45 min",
    "description": "”Black beans, a core ingredient in Brazilian cooking, have a wonderful colour and such a rich taste that you don’t need to add lots of other ingredients.” – Jane Muir, founder of Mildreds",
    "ingredients": [
      "Sunflower oil for frying",
      "2 onions, finely chopped",
      "2 red chillies, finely chopped",
      "5 large garlic cloves, crushed",
      "1½ tbsp smoked paprika",
      "½ tbsp ground cumin",
      "2 x 400g tins black beans",
      "1 litre vegetable stock",
      "5 bay leaves",
      "3 roasted red peppers from a jar, drained and roughly chopped",
      "1 small sweet potato, peeled and diced into 2cm pieces",
      "Lime wedges to serve",
      "2 corn cobs, kernels sliced off with a sharp knife (or, if not in season,150g frozen sweetcorn, defrosted)",
      "½ red chilli, finely diced",
      "6 spring onions, finely sliced",
      "½ small red onion, finely diced",
      "Bunch fresh coriander, finely chopped"
    ],
    "method": [
      {
        "Step 1": "Heat a splash of oil in a large saucepan, add the onions, chillies and garlic and cook over a medium heat, stirring frequently, until the onions are translucent."
      },
      {
        "Step 2": "Add the spices and cook over a low heat, stirring, for 1-2 minutes, then add the beans in their liquid, stock and bay leaves to the pan. Bring up to a low simmer."
      },
      {
        "Step 3": "Add the peppers and sweet potato and cook gently, uncovered, for 45 minutes, stirring occasionally, until the sweet potato is cooked but not disintegrating."
      },
      {
        "Step 4": "Meanwhile, make the salsa. Mix the corn kernels in a bowl with the remaining ingredients and stir to combine."
      },
      {
        "Step 5": "Before serving, transfer one third of the soup to a food processor and whizz until smooth. Return to the pan and stir into the rest of the soup, then reheat, adding a little water to loosen if necessary."
      },
      {
        "Step 6": "Serve in bowls with a spoonful of corn salsa and lime wedges to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/58.jpg"
  },
  {
    "id": "59",
    "title": "Cornbread with deep-fried crispy onions",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 30 min, oven time 25-30 min",
    "description": "Deep-fried spring onions are taken one step further with a cornmeal crunch, before being topped on a cheesy, spring onion-spiked cornbread.",
    "ingredients": [
      "150g plain flour",
      "200g cornmeal or instant polenta",
      "1 tsp salt",
      "1 tbsp baking powder",
      "2 tsp caster sugar",
      "1 tsp mustard powder",
      " Large pinch cayenne pepper",
      "200g mature cheddar, grated",
      "1 red chilli, chopped",
      "3 spring onions, sliced",
      "50g butter, melted",
      "200ml buttermilk",
      "3 medium free-range eggs, beaten",
      "2 tbsp olive oil",
      "Vegetable oil for deep-frying",
      "75g plain flour",
      "¼ tsp mustard powder",
      "¼ tsp garlic salt",
      "Pinch cayenne pepper",
      "2 medium free-range eggs",
      "125g cornmeal or instant polenta",
      "1 bunch spring onions, sliced in half lengthways",
      "Grated zest and juice 1 lime",
      "3 tbsp mayonnaise",
      "3 tbsp soured cream",
      "1-2 tsp chipotle chilli paste (we like Gran Luchito Mexico Smoked Chipotle Chilli Paste)",
      "Juice 1 lime to taste",
      "20cm square cake tin, fully lined with non-stick baking paper"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/gas 6. Sift the 150g plain flour into a large mixing bowl and stir in the cornmeal/polenta, salt, baking powder, sugar, mustard powder, cayenne, 150g of the grated cheese, the chilli and the sliced spring onions. Make a well in the centre."
      },
      {
        "Step 2": "In a jug, mix the melted butter with the buttermilk, eggs and olive oil and pour into the well. Stir quickly to combine, then pour into the cake tin. Sprinkle with the rest of the cheese, then bake for 25-30 minutes until golden and a skewer pushed into the middle comes out clean."
      },
      {
        "Step 3": "Meanwhile, fry the spring onions. Fill a heavy-based deep pan with 6-8cm oil, then put over a medium heat until it reads 180°C on a digital probe thermometer (or a cube of bread turns golden in 30-40 seconds). Line a baking tray with kitchen paper and set aside."
      },
      {
        "Step 4": "In a wide shallow bowl mix the flour, mustard powder, garlic salt, cayenne pepper and a good pinch of salt. Beat the 2 eggs and put in another bowl, then put the cornmeal/polenta in a third similar bowl. Dust the spring onions all over in the seasoned flour, then coat in the egg, then finally toss in the cornmeal/polenta to coat."
      },
      {
        "Step 5": "Working in batches, fry the spring onions until golden brown (3-4 minutes), then scoop out with a wire basket or tongs and lay on the prepared tray. Immediately sprinkle with lime juice, lime zest and salt. Cook the rest of the onions."
      },
      {
        "Step 6": "Mix all the mayonnaise ingredients in a small bowl and season to taste. Once the cornbread is cooked, top with the crispy onions with the mayo alongside for dipping."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/59.jpg"
  },
  {
    "id": "60",
    "title": "Corned beef and bean hash with chimichurri",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min, oven time 20 min",
    "description": "A tasty, filing and budget-friendly recipe with a Mexican twist. Serve as an easy midweek meal to feed the family with extra lime wedges and chilli.",
    "ingredients": [
      "500g sweet potatoes, cut into medium chunks",
      "Rapeseed oil for frying",
      "Small bunch fresh coriander or parsley (or ½ bunch each), finely chopped",
      "Grated zest 1 lime, juice 2 limes, plus wedges (optional) to serve",
      "1 large red onion, sliced",
      "3 garlic cloves, sliced",
      "1½ tsp sweet smoked paprika",
      "1 tsp ground cumin (optional)",
      "340g tin corned beef, cubed",
      "400g can black beans, drained and rinsed",
      "1-2 jalapeño chillies, chopped, to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 220°C/200°C fan/gas 7. Put the sweet potatoes in a roasting tin, drizzle over 1 tbsp oil, season, then roast for 20 minutes."
      },
      {
        "Step 2": "Meanwhile, mix the herbs with the lime zest and juice to make the chimichurri salsa. Set aside."
      },
      {
        "Step 3": "Heat 1 tbsp oil in a wide frying pan and cook the onion for 6-7 minutes or until golden, then add the garlic, paprika and cumin (if using). Cook, stirring, for 2 more minutes."
      },
      {
        "Step 4": "Add the corned beef and black beans, stirring gently, and cook until heated through and turning crisp. Stir in the roasted sweet potato, then taste and season. Drizzle with the chimichurri and serve with lime wedges and chillies, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/60.jpg"
  },
  {
    "id": "61",
    "title": "Slow-cooked duck tacos with pineapple salsa",
    "difficulty": "Medium",
    "portion": "Serves 4-6",
    "time": "Hands-on time 15 min, oven time 2 hours",
    "description": "Melt-in-your-mouth slow-cooked, tequila-spiked duck, fiery pineapple salsa and creamy chipotle mayo all wrapped up in a soft tortilla. Gather the troops – it’s Mexican night!",
    "ingredients": [
      "Vegetable oil for frying",
      "4 Gressingham duck legs, pierced all over with the tip of a sharp knife",
      "1 medium pineapple, peeled, halved and cored",
      "200ml tequila (we used El Jimador), plus a splash for the salsa",
      "100ml chicken stock",
      "2 tsp chipotle paste",
      "Pinch dried chipotle chilli flakes",
      "1 red onion, chopped",
      "2 jalapeño chillies (or 1 red chilli), deseeded and finely chopped",
      "Bunch fresh coriander, chopped",
      "1 lime, halved",
      "4 tbsp mayonnaise",
      "2 tbsp soured cream",
      "2 tsp chipotle paste",
      "Pack 8 corn tortillas",
      "1 large (or 2 small) ripe avocados",
      "½ iceberg lettuce",
      "Lime wedges for squeezing",
      "Shallow flameproof casserole or large ovenproof frying pan"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C/140°C fan/gas 3. Heat a splash of oil in the casserole/pan over a medium-high heat. Add the duck legs, skin-side down, and brown for 5 minutes."
      },
      {
        "Step 2": "Chop half the pineapple and whizz in a food processor with the tequila, stock, chipotle paste, chilli flakes and seasoning to make a smooth sauce. (Alternatively, use a bowl and a stick blender.)"
      },
      {
        "Step 3": "Pour away any excess fat from the duck and add the whizzed sauce to the casserole or pan. Bring to a fast simmer, then put in the oven and cook, uncovered, for 2 hours."
      },
      {
        "Step 4": "For the pineapple salsa, finely dice the remaining pineapple and put in a bowl with the chopped red onion, chillies and most of the coriander. Add a splash of tequila and the juice of ½ lime, season and set aside."
      },
      {
        "Step 5": "Mix the chipotle mayo ingredients in a bowl and season. To serve, warm the tortillas in the oven. Slice the avocados, shred the lettuce and toss in a serving bowl with the juice of the remaining ½ lime and some salt and black pepper."
      },
      {
        "Step 6": "Using 2 forks, shred the duck meat, then mix back into the sauce (discard the skin and bones). Add a squeeze more lime and seasoning, then serve in the tortillas with the mayo, salad and salsa, remaining coriander and lime wedges for squeezing."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/61.jpg"
  },
  {
    "id": "62",
    "title": "Mexican picadillo pasties",
    "difficulty": "Easy",
    "portion": "Makes 6",
    "time": "Hands-on time 1 hour, oven time 1 hour, plus chilling",
    "description": "Debbie Major ramps up the flavour of a classic Cornish pasty with this Mexican version (just don’t tell them in Penzance)",
    "ingredients": [
      "1 quantity pastry (see Debbie Major’s Cornish pasties)",
      "225g onion, chopped",
      "600g peeled waxy potatoes, diced",
      "225g carrots, diced",
      "450g braising steak, diced",
      "1 medium-hot jalapeño chilli, seeded and finely chopped",
      "3 garlic cloves, finely chopped",
      "1 tsp ground cumin",
      "1 tsp dried oregano",
      "2 tbsp tomato purée",
      "1 tbsp small capers, rinsed and drained",
      "1 tbsp finely chopped green olives",
      "1 medium free-range egg, beaten"
    ],
    "method": [
      {
        "Step 1": "Make and chill the pastry as in the master recipe on p36 (steps 1-4). Mix the remaining pasty ingredients (except the egg) in a bowl with 1 tsp salt and plenty of freshly ground black pepper, then set aside."
      },
      {
        "Step 2": " Once the pastry has chilled, roll out, fill and shape the pasties as in the master recipe (step 6), then chill for 1 hour."
      },
      {
        "Step 3": " Heat the oven to 180°C/160°C fan/gas 4. Remove the pasties from the fridge and brush generously with the beaten egg. Make 3 small slits in the top of each, then bake for 1 hour until richly golden. Transfer to a wire cooling rack. Eat while still warm."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/62.jpg"
  },
  {
    "id": "63",
    "title": "Smoky pork and black bean stew with kale",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "“Black beans and kale are both good sources of the B vitamin folate (also known as folic acid).” – Amanda Ursell, nutritionist.",
    "ingredients": [
      "Mild, light olive oil for frying",
      "400g pork tenderloin, cut into chunks",
      "2 red onions, chopped",
      "1½ tsp paprika",
      "½ tsp ground cinnamon",
      "1 x 28g chicken stock pot (we used Knorr)",
      "400g black beans",
      "2 large handfuls chopped kale",
      "30g butter",
      "Cooked quinoa or wholegrain rice and lemon or lime wedges to serve"
    ],
    "method": [
      {
        "Step 1": "Boil a kettle of water. Heat a splash of olive oil in a large, deep frying pan and fry the pork for 5 minutes until browned all over. Set the meat aside on a plate and add more oil to the pan. Cook the onions for 5-6 minutes until starting to soften, then stir in the spices and cook for 1 minute more."
      },
      {
        "Step 2": "Dissolve the stock pot in a jug with 400ml hot water from the kettle. Return the pork to the pan, add the beans and stock, then bring to a simmer and cook for 5 minutes."
      },
      {
        "Step 3": "Add the kale to the pan and cook for 5 minutes more, then stir in the butter to thicken the sauce a little. Taste, season and serve with quinoa or rice, with lemon or lime wedges to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/63.jpg"
  },
  {
    "id": "64",
    "title": "Mexican veggie and tortilla soup",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min, simmering time 15 min",
    "description": "What if you could have a soup that tasted like nachos? Well now you can. Full of vibrant Mexican flavours, this vegetarian soup is topped with tortilla chips and ready in a flash.",
    "ingredients": [
      "1 red onion, diced",
      "1 red pepper, diced",
      "400g can chopped tomatoes",
      "1-2 tablespoons chipotle hot sauce",
      "1 Knorr Vegetable Stockpot dissolved in 300ml boiling water (we like Knorr)",
      "100g frozen sweetcorn",
      "40g lightly salted tortilla chips",
      "1 can kidney beans, strained",
      "30g cheddar cheese, grated and ½ avocado, diced"
    ],
    "method": [
      {
        "Step 1": "Heat a little oil in a saucepan and fry onion until soft (1-2 minutes). Add pepper and fry a further 1 minutes."
      },
      {
        "Step 2": "Stir in tomatoes, chipotle sauce, stock and sweetcorn. Simmer for 12-15 minutes."
      },
      {
        "Step 3": "Serve in bowls topped with the tortilla chips, and top with cheese and avocado if using."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/64.jpg"
  },
  {
    "id": "65",
    "title": "Smoky sausage chilli",
    "difficulty": "Easy",
    "portion": "Makes enough for two meals for 4 people",
    "time": "Hands-on time 20 min, simmering time 45 min",
    "description": "We’ve doubled the quantities of this sensational smoky sausage chilli so you can eat half now and freeze the other half for another meal.",
    "ingredients": [
      "Oil for frying",
      "4 carrots, chopped",
      "4 celery sticks, chopped",
      "4 garlic cloves, crushed",
      "2 bay leaves",
      "2 tsp ground cumin",
      "2 tsp ground coriander",
      "90g chipotle paste",
      "12 free-range pork sausages, cut into chunks",
      "3 x 400g cans chopped tomatoes",
      "Steamed basmati rice, 1 sliced red chilli, fresh coriander leaves, soured cream, lime wedges and tortilla chips to serve",
      "Flameproof lidded casserole"
    ],
    "method": [
      {
        "Step 1": "Heat a glug of oil in the casserole over a medium heat. Add the carrots, celery, garlic and bay leaves, then fry for 10 minutes until the vegetables are starting to soften. Add the cumin, coriander and chipotle paste, then cook for 2-3 minutes."
      },
      {
        "Step 2": "Add the sausages and fry for 5 minutes (there’s no need to fully brown them), then add the chopped tomatoes and 150ml water. Season with black pepper, then bring to a simmer, put the lid on and cook for 45 minutes until the sausages are cooked through and the sauce is flavoursome – if the sauce is a little too thick for your liking, add a splash of water."
      },
      {
        "Step 3": "Transfer a third of the chilli to a freezerproof container and allow to cool, then freeze (see box, top of page opposite). Serve the remaining chilli with steamed rice, fresh red chilli, fresh coriander leaves, lime wedges and tortilla chips if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/65.jpg"
  },
  {
    "id": "66",
    "title": "Vegan chilli with rice",
    "difficulty": "Easy",
    "portion": "Makes 8 portions (enough for two meals for 4)",
    "time": "Hands-on time 20 min, simmering time 45-50 min",
    "description": "Make this comforting vegetarian chilli, serve half now and freeze the rest for later. You can use the leftovers in our mash potato-topped gardener’s pie.",
    "ingredients": [
      "3 tbsp olive oil",
      "2 red onions, chopped",
      "2 red peppers, chopped",
      "2 celery sticks, chopped",
      "1 butternut squash, cut into chunks (we used 700g ready-cut chunks)",
      "4 garlic cloves, crushed",
      "1 tbsp ground cumin",
      "1 tbsp ground coriander",
      "2 tbsp chipotle paste",
      "680g jar passata",
      "Glug vegan red wine (optional)",
      "28g vegetable stock pot (we used Knorr)",
      "400g tin pinto beans, rinsed and drained",
      "400g tin brown lentils, rinsed and drained",
      "Large handful chopped fresh coriander, plus leaves to garnish",
      "Steamed basmati rice,  plant-based yogurt and lime wedges to serve"
    ],
    "method": [
      {
        "Step 1": "Heat the olive oil in a large heavy-based frying pan with a lid over a low-medium heat. Add the onions, peppers, celery, squash and a large pinch of salt and cook, covered, for 20 minutes."
      },
      {
        "Step 2": "Remove the lid, stir in the garlic, dried spices and chipotle paste and cook for 2 minutes. Stir in the passata, 240ml water, a good glug of red wine, if using, and the stock pot. Bring to the boil, then turn the heat down to low and simmer uncovered for 20 minutes. Add the beans and lentils and cook for 5-10 minutes more to heat through."
      },
      {
        "Step 3": "Pour half into a freezerproof container to cool before freezing (see tips below). Stir the coriander into the remaining chilli, then serve with rice, yogurt, lime wedges and extra coriander leaves."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/66.jpg"
  },
  {
    "id": "67",
    "title": "Easy shakshuka",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 50 min",
    "description": "We think this easy shakshuka – a classic Middle Eastern lunch dish – is brilliant served any time, mopped up with good bread.",
    "ingredients": [
      "100ml olive oil",
      "2 onions, finely sliced",
      "2 red peppers, finely sliced",
      "1-2 red chillies, finely chopped",
      "5 garlic cloves, finely sliced",
      "2 tsp cumin seeds",
      "1 tbsp paprika",
      "2 x 400g tins chopped tomatoes",
      "1 tbsp soft brown sugar",
      "2 bay leaves",
      "A few fresh thyme sprigs",
      "4 large free-range eggs",
      "Handful chopped fresh parsley"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large frying pan over the campfire (or barbecue or hob). Add the onions, peppers, chillies, garlic and spices, then fry gently for 10 minutes until the veg has softened and turned golden. Add the tomatoes, sugar, bay leaves and thyme, stir to combine, then season and simmer for 20-30 minutes until thickened, adding a little water if it looks too thick or starts to catch."
      },
      {
        "Step 2": "Make four indentations in the sauce and crack an egg into each one. Cover the pan with a lid or foil and cook for 3-4 minutes until the whites are set but the yolks are still a little soft. Scatter with chopped parsley and serve from the pan."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/67.jpg"
  },
  {
    "id": "68",
    "title": "Spicy ancho chilli, chicken and chorizo hotpot",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 40 min, oven time 55 min",
    "description": "The ancho chillies give this hotpot a spicy and smoky kick and is incredibly easy to make. If you’re a fan of food that is big on flavour, and spice, then this is the dish for you.",
    "ingredients": [
      "2 ancho chillies (from large supermarkets, delis and coolchile.co.uk), soaked for 10 minutes in hot water",
      "Olive oil for frying",
      "1 onion, sliced",
      "2 tsp ground cumin",
      "2 tsp hot smoked paprika",
      "5cm piece fresh ginger, peeled and finely chopped",
      "200g cooking chorizo, sliced",
      "8 (about 750g) free-range skinless and boneless chicken thighs, chopped into chunks",
      "250ml red wine",
      "2 x 400g tins chopped tomatoes",
      "1 tsp sugar",
      "2 flour tortillas",
      "Zest 1 lemon",
      "Bunch fresh flatleaf parsley, leaves picked",
      "Lidded flameproof casserole"
    ],
    "method": [
      {
        "Step 1": "Drain the ancho chillies (discard the liquid) and finely chop. Heat the oven to 160°C/140°C fan/gas 3."
      },
      {
        "Step 2": "Heat a glug of olive oil in the casserole, add the onion and fry over a medium heat for 5 minutes until starting to soften. Add the cumin and paprika and cook for 2 minutes, stirring all the time."
      },
      {
        "Step 3": "Add the chopped ancho chillies, ginger and chorizo and cook for a further 3-4 minutes, then add the chicken and wine, bring to the boil and simmer for 5-10 minutes until the wine has reduced by half."
      },
      {
        "Step 4": "Add the chopped tomatoes and the sugar. Season with salt and pepper, then cover, transfer to the oven and cook for 45-50 minutes. Remove from the oven and leave to stand for a few minutes."
      },
      {
        "Step 5": "Prepare the crispy tortilla topping. Heat a dry frying pan over a medium heat and add the tortillas. Toast for 3-4 minutes until scorched and crisp. Leave them to cool, then finely slice into thin strips. Toss the strips in a large bowl with the lemon zest, then sprinkle over the casserole with the parsley to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/68.jpg"
  },
  {
    "id": "69",
    "title": "Harissa-spiced lamb tacos",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "Our spicy harissa-spiced lamb tacos – served with an avocado salad – are a great midweek meal that’s ready in just 30 mins.",
    "ingredients": [
      "2 tbsp rapeseed oil",
      "1 onion, finely chopped",
      "1 tsp ground coriander",
      "450g British lean lamb mince",
      "4 tbsp rose harissa",
      "100g sultanas",
      "8 taco shells",
      "80g feta",
      "1 small avocado, sliced",
      "4 little gem lettuces, roughly chopped",
      "Sliced green chilli"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 220°C/200°C fan/gas 7. In a large frying pan, heat 1 tbsp of the oil over a medium heat. Add the onion and fry for 5 minutes until starting to soften. Add the ground coriander and fry for a few minutes, then stir in the lamb mince."
      },
      {
        "Step 2": "Turn up the heat and fry the mince, stirring regularly, until browned and beginning to crisp (about 5 minutes). Stir in the harissa and sultanas. Cook for another 5 minutes until the mince has cooked through, then taste and season."
      },
      {
        "Step 3": "Divide the mixture among the taco shells and arrange them carefully on a baking sheet lined with non-stick baking paper. Crumble over the feta, then bake for 10 minutes."
      },
      {
        "Step 4": "Meanwhile, mix together the avocado and lettuce in a bowl, drizzle with the rest of the rapeseed oil and season to taste. Serve the tacos straight from the oven, scattered with  chilli (if you like a bit of heat), with the salad on the side."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/69.jpg"
  },
  {
    "id": "70",
    "title": "Smoked-lentil tacos with pico de gallo",
    "difficulty": "Medium",
    "portion": "Makes 6",
    "time": "Hands-on time 35 min, simmering time 20 min, plus soaking",
    "description": "”I haven’t eaten meat in a long time, but taking my first bite of these insanely tasty tacos made me feel as if I were. I used my secret weapons: tamari, sun-dried tomatoes and caramelised onions.” – Sarah Britton",
    "ingredients": [
      "250g cherry tomatoes, chopped",
      "Small onion, very finely chopped",
      "1 tsp very finely chopped red chilli",
      "2 tbsp lime juice",
      "Handful fresh coriander, chopped",
      "210g dried green lentils, soaked and drained",
      "1 tbsp coconut oil",
      "3 small onions, sliced",
      "1 tsp fine sea salt",
      "1 large garlic clove, very finely chopped",
      "35g sun-dried tomatoes, chopped",
      "1 tsp hot smoked paprika",
      "1½ tsp dried oregano",
      "2 tsp tamari or soy sauce",
      "300g finely shredded red cabbage",
      "½ tsp fine sea salt, plus extra as needed",
      "1½ tsp lime juice, plus wedges to serve",
      "1 tbsp extra-virgin olive oil",
      "1 tsp maple syrup, plus extra as needed",
      "Handful chopped fresh flatleaf parsley or fresh coriander (leaves and tender stems), or a mixture",
      "1 small red chilli, deseeded and sliced (leave the seeds in if you like more heat)",
      "6 corn tortillas, warmed",
      "1 ripe avocado, sliced",
      "Hot sauce (optional)"
    ],
    "method": [
      {
        "Step 1": "For the pico de gallo, combine the cherry tomatoes, onion, chilli, lime juice and coriander in a small bowl. Season with salt and set aside."
      },
      {
        "Step 2": "Next, cook the lentils. In a stockpot or large pan, cover the soaked lentils with water, bring to the boil, then reduce the heat to low and cook, covered, for about 20 minutes or until tender. Drain and rinse well."
      },
      {
        "Step 3": "Meanwhile, make the slaw. In a large bowl, combine the cabbage, salt and lime juice. Massage the cabbage with the mixture for about a minute until it begins to wilt. Drizzle with the olive oil and maple syrup. Season with more salt, as needed, and stir in the herbs and chilli."
      },
      {
        "Step 4": "Melt the coconut oil for the filling in a frying pan over a medium-high heat. Add the onions and salt, stir to coat, then cook for about 10 minutes or until the onions soften and begin to slightly caramelise."
      },
      {
        "Step 5": "Add the garlic, sun-dried tomatoes, paprika, oregano and tamari/soy sauce. Stir to coat, adding a little water if the pot is too dry. Cook for 2-3 minutes until fragrant, then add the cooked lentils and stir well. Taste and season with salt, if needed, then remove from the heat."
      },
      {
        "Step 6": "To assemble the tacos, divide the smoky lentil mixture among the tortillas, followed by the slaw and pico de gallo. Add the avocado, then some hot sauce, if you like. Serve with lime wedges to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/70.jpg"
  },
  {
    "id": "71",
    "title": "Green veg and chicken tacos with pea guacamole",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 20 min",
    "description": "Enjoy this recipe for your next taco night. Quick and affordable, it’s perfect for those summer evenings when you want something quick, easy and nourishing.",
    "ingredients": [
      "1/2 fennel bulb, finely sliced",
      "80g courgette or baby courgettes, cut into ribbons using a veg peeler",
      "Juice 2 limes, plus wedges to serve",
      "80g frozen peas",
      "1 ripe avocado, roughly chopped",
      "1 cos lettuce, roughly chopped",
      "Large handful fresh coriander leaves, finely chopped",
      "2 ready-roasted free-range chicken breasts, sliced",
      "4-6 small tortilla wraps",
      "100g (½ tub) ready-made tomato salsa to serve"
    ],
    "method": [
      {
        "Step 1": "Mix the sliced fennel and courgette(s) in a serving bowl with half the lime juice. Set aside."
      },
      {
        "Step 2": "For the pea guacamole, put the peas in a bowl, cover with boiling water and leave for 5 minutes. Drain and rinse under cold water, then whizz in a food processor with the avocado and remaining lime juice until smooth. Taste and season well with salt and pepper."
      },
      {
        "Step 3": "Toss the lettuce and chopped coriander with the fennel and courgette. Arrange the chicken and green veg on the tortillas, dollop with some pea guacamole, then serve with the tomato salsa and lime wedges for squeezing."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/71.jpg"
  },
  {
    "id": "72",
    "title": "Smoky bean and sweet potato tortillas with lime-pickled onions",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 minutes, cooking time 35 minutes",
    "description": "Take your veggie Mexican night to new heights with these smoky bean and sweet potato tortillas. They’re wonderfully warming and spicy with a citrus kick from the lime-pickled onions.",
    "ingredients": [
      "1 tbsp olive oil",
      "1 red onion, finely chopped",
      "2 garlic cloves, crushed",
      "Pinch of ground cumin",
      "600g sweet potatoes, peeled and cut into 1cm dice",
      "1-2 tbsp chipotle paste",
      "300ml vegetable stock, hot",
      "2 x 400g tins butter beans, drained and rinsed",
      "400g tin black beans, drained and rinsed",
      "Handful of fresh mint leaves, chopped",
      "Handful of fresh coriander leaves",
      "Tortilla wraps, charred, to serve",
      "Soured cream to serve",
      "Juice of 1 lime",
      "1 large red onion, finely sliced",
      "Sea salt crystals or flakes"
    ],
    "method": [
      {
        "Step 1": "To make the lime-pickled onions, toss the lime juice and sliced onion in a bowl with a good pinch of sea salt. Leave for 30 minutes, tossing occasionally, to soften and turn pink."
      },
      {
        "Step 2": "Heat the oil in a large frying pan over a low-medium heat, then add the chopped onion, garlic and cumin. Cook for 10 minutes, then add the sweet potatoes. Fry gently for 2-3 minutes more, stirring occasionally to make sure the garlic doesn’t burn."
      },
      {
        "Step 3": "Stir in the chipotle paste to coat the vegetables. Season well, then pour over the hot vegetable stock. Bring to the boil. Turn the heat down to a simmer, then cook for 10-15 minutes until the potatoes are tender and the stock is reduced. Taste and season."
      },
      {
        "Step 4": "Add all the beans to the pan. Keep on the heat for a further 5 minutes, stirring, then remove and toss in the mint and coriander. Take to the table, still in the pan, then serve with the charred tortilla wraps, lime-pickled onions and soured cream."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/72.jpg"
  },
  {
    "id": "73",
    "title": "Smoky coriander beef fajitas",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min",
    "description": "When you’ve only got minutes to spend in the kitchen, speedy steak fajitas are the perfect dinner. We’ve used jarred peppers and ready-made Mexican sauces to make this weeknight recipe even easier.",
    "ingredients": [
      "2 tbsp vegetable oil for frying",
      "2 large onions, thickly sliced",
      "2 garlic cloves, crushed",
      "300g British beef rump steak, sliced into strips",
      "Small bunch fresh coriander, stalks roughly chopped and leaves picked",
      "2 tsp ground cumin",
      "1 tbsp ground coriander",
      "100g chargrilled red peppers from a jar, cut into 1cm strips",
      "4 large tortillas, warmed",
      "240g mini pack Tex-Mex dips (such as soured cream, guacamole and tomato salsa)",
      "Sliced jalapeño chillies and lime wedges (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large frying pan or wok over a high heat. Fry the onions for 3-4 minutes, then add the garlic and steak and fry for a minute more."
      },
      {
        "Step 2": "Add the coriander stalks and spices, then stir-fry for another minute. Add the chargrilled peppers and cook until just warmed through, then scatter with the coriander leaves."
      },
      {
        "Step 3": "Serve the steak with the warm tortillas and dips, along with jalapeños and lime wedges, if you like, so everyone can build their own fajita."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/73.jpg"
  },
  {
    "id": "74",
    "title": "Chipotle chicken chilli with avocado",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 35 min, simmering time 65 min",
    "description": "The secret ingredient in this chipotle chicken chilli? A bottle of Corona. It takes this spicy Mexican one-pot to a whole new level.",
    "ingredients": [
      "Olive oil for frying",
      "2 onions, chopped",
      "3 garlic cloves, finely chopped",
      "1 tbsp ground cumin",
      "6 British free-range skinless boneless chicken thighs, cut into 3cm pieces",
      "330ml bottle Mexican lager (we used Corona)",
      "400g tin chopped tomatoes",
      "500ml fresh chicken stock",
      "Small bunch fresh coriander, stalks finely chopped, leaves roughly chopped",
      "90g chipotle paste",
      "2 x 400g tins kidney beans, drained and rinsed",
      "½ tbsp chilli flakes",
      "1 large ripe avocado",
      "Juice 1 lime, plus 6 wedges",
      "1 small red chilli, finely sliced",
      "12 small white flour tortillas",
      "1 red onion, finely sliced, soaked in cold water, then drained",
      "Soured cream"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a largepan over a medium heat and fry the chopped onions for 10 minutes until softened, then add the garlic and cumin and fry for a minute. Add the chicken and fry, stirring, for 5 minutes until lightly browned. Pour in the beer, bring to the boil, then simmer for 15 minutes until reduced by three quarters."
      },
      {
        "Step 2": "Add the tomatoes, stock, coriander stalks and chipotle paste, then simmer gently for 40 minutes until the sauce has thickened. Add the beans and chilli flakes, then cook for 10 minutes. Add most of the chopped coriander leaves, taste and season."
      },
      {
        "Step 3": "To serve, peel and slice the avocado into a bowl, then toss with the lime juice and chilli. Set a griddle/frying pan over a high heat, then char the tortillas for 20-30 seconds each. Pile the chilli, soaked onion and avocado on each tortilla, scatter with the rest of the coriander leaves, then serve with lime wedges and soured cream."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/74.jpg"
  },
  {
    "id": "75",
    "title": "Braised beef chilli",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 20 min, oven time 3½ hours",
    "description": "Ancho chillies, dark chocolate and paprika add wonderful flavours to this slow-cooked beef chilli. Serve it with fresh bean salsa for an impressive one-pot dish.",
    "ingredients": [
      "Olive oil for frying",
      "2 red onions, thinly sliced",
      "1 tbsp ground cumin",
      "1 tsp smoked sweet paprika",
      "1 tbsp ground coriander",
      "1.5kg beef shin, diced",
      "3 green peppers, sliced",
      "2 dried ancho chillies, soaked in hot water for 10 minutes, then roughly chopped",
      "1 tbsp tomato purée",
      "500ml beef stock (we like )",
      "400g tin chopped tomatoes",
      "30g very dark chocolate (80 per cent cocoa solids), in pieces",
      "Large bunch fresh coriander, leaves roughly chopped",
      "1 red onion, finely chopped",
      "200g black eye beans, drained and rinsed",
      "100g tinned sweetcorn, drained",
      "Bunch fresh coriander, leaves roughly chopped",
      "Juice of 1 lime",
      "1 red chilli, deseeded and chopped",
      "Steamed rice",
      "Soured cream"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 150°C/130°C fan/gas 2. Heat a glug of oil in a large lidded flameproof casserole over a medium heat. Fry the onions for 5 minutes, then add the spices and cook for 2-3 minutes more."
      },
      {
        "Step 2": "Add the beef, turn up the heat and fry for 5-8 minutes to brown, stirring regularly. Add the peppers and fry for a further 5 minutes."
      },
      {
        "Step 3": "Stir in the chillies, tomato purée, stock and tomatoes, bring to the boil, then cover with the lid and cook in the oven for 3 hours. Remove the lid and cook for a further 30 minutes."
      },
      {
        "Step 4": "Just before serving, combine the salsa ingredients, taste and season."
      },
      {
        "Step 5": "Once the beef is cooked, stir in the chocolate and coriander. Taste and season, then serve with rice, soured cream and the salsa."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/75.jpg"
  },
  {
    "id": "76",
    "title": "Veggie chilli with nachos",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 25 min, simmering time 30 min, oven time 15 min",
    "description": "This isn’t just any veggie recipe, it’s a hearty Mexican chilli made with plenty of spices and topped with a crunchy layer of cheesy nachos.",
    "ingredients": [
      "Glug olive oil or sunflower oil",
      "1 red onion, roughly chopped",
      "3 mixed peppers, sliced",
      "2 dried ancho chillies, soaked in hot water for 10 minutes, then roughly chopped",
      "2 tsp ground coriander",
      "2 tsp ground cumin",
      "1 tsp smoked paprika",
      "1 tbsp dried oregano",
      "3 fat garlic cloves, sliced",
      "460g passata",
      "1 tbsp red wine vinegar",
      "1 tbsp palm sugar or maple syrup",
      "500ml vegetable stock, hot (we like Knorr)",
      "400g can black beans, rinsed and drained",
      "Bunch fresh coriander, stalks finely chopped, leaves roughly chopped",
      "Juice ½ lime, plus 6 wedges to serve",
      "200g bag tortilla chips",
      "100g lincolnshire poacher, strong cheddar or vegetarian alternative, grated",
      "4 spring onions, chopped",
      "3 pickled jalapeños from a jar, chopped"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a flameproof casserole and cook the onion for 5 minutes. Add the peppers for 10 minutes more. Add the chopped ancho chillies, spices, oregano and garlic, then fry for 2-3 minutes. Stir in the passata, vinegar, sugar/syrup and stock, then bring to the boil. Turn the heat to medium and cook uncovered for 30 minutes."
      },
      {
        "Step 2": "Heat the oven to 220°C/200°C fan/gas 7. Add the beans, chopped coriander stalks and the lime juice to the chilli on the hob. Cook for 5 minutes, then remove from the heat and cover the top with layers of tortilla chips and grated cheese. Bake for 10-15 minutes until golden brown and the cheese has melted."
      },
      {
        "Step 3": "Just before serving, mix the coriander leaves, spring onions and jalapeños in a small bowl, then scatter over the chilli. Serve with lime wedges to squeeze over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/76.jpg"
  },
  {
    "id": "77",
    "title": "Red pepper and courgette enchiladas",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on-time 35min, oven time 20 min",
    "description": "These vegetarian enchiladas are perfect for Friday night feasting. Gather the troops and serve them up with lashings of guac and chips.",
    "ingredients": [
      "1 large or 2 small red peppers, deseeded and cut into strips",
      "2 courgettes, cut into batons",
      "1 red onion, cut into wedges",
      "Olive oil to drizzle",
      "1 red chilli, finely sliced",
      "1 tsp each ground coriander and ground cumin, toasted in a pan for 1 minute",
      "Handful fresh coriander, chopped",
      "1 onion, finely chopped",
      "2 garlic cloves, crushed",
      "800g ripe tomatoes, chopped",
      "4 flour tortillas",
      "100g grated cheddar",
      "100g grated mozzarella"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/gas 6. Toss the peppers, courgettes and red onion in a little oil in a large bowl. Heat a frying pan over a high heat and fry the veg in batches until tender."
      },
      {
        "Step 2": "Toss the fried veg in a bowl with the chilli, ground spices and coriander. Tip back into the pan with a little oil and cook for 4-5 minutes."
      },
      {
        "Step 3": "In a wide saucepan, heat a little oil and gently fry the chopped onion for 6-7 minutes. Add the garlic and cook for 1 minute, then add the tomatoes and cook for 15-20 minutes."
      },
      {
        "Step 4": "Divide the veg among the tortillas and roll up. Spoon a third of the sauce into an ovenproof dish, put the tortillas on top, then pour over the remaining sauce and scatter with the cheese. Bake for 15-20 minutes until golden and bubbling."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/77.jpg"
  },
  {
    "id": "78",
    "title": "Beef enchiladas",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 30 min, oven time 30 min",
    "description": "Looking for a way to use up weekend leftovers? Transform half a batch of beef and vegetable stew into cheesy chipotle-spiced enchiladas with this Mexican-style recipe.",
    "ingredients": [
      "half a batch of this beef and vegetable stew",
      "a glug of vegetable oil",
      "1 onion, roughly chopped",
      "1 tsp ground cumin",
      "1 tsp ground coriander",
      "4 tsp chipotle paste",
      "400g tin of chopped tomatoes",
      "a splash of beef stock",
      "2 large flour tortillas",
      "4 tbsp soured cream",
      "30g grated cheddar",
      "a green salad, to serve",
      "1 litre ovenproof dish"
    ],
    "method": [
      {
        "Step 1": "In a large frying pan, heat a glug of vegetable oil and fry the onion for 5-8 minutes until softening. Add ground cumin, ground coriander and chipotle paste, fry for a few minutes, then stir in a tin of chopped tomatoes. Simmer for 15 minutes."
      },
      {
        "Step 2": "Heat the oven to 200°C/180°C fan/gas 6. Meanwhile, pour the half-batch of beef stew into a saucepan and gently heat through. If the sauce has thickened up a lot, add a splash of beef stock or water. Put a large frying/griddle pan over a high heat and toast the tortillas, one at a time, until lightly charred on both sides."
      },
      {
        "Step 3": "Divide the stew between the tortillas, then roll them up. Put the tortilla rolls in a 1 litre ovenproof dish. Pour over the hot tomato and chipotle sauce, then dollop over 4 tbsp soured cream. Top with grated cheddar and bake for 30 minutes until golden and bubbling. Leave to stand for 5 minutes, then serve with a green salad."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/78.jpg"
  },
  {
    "id": "79",
    "title": "Fried kale with black bean chilli and guacamole",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 40 min",
    "description": "Spice up your weekend with this Mexican-style brunch recipe. It’s quick, easy and full of nutritional ingredients that’ll keep you going for the whole day.",
    "ingredients": [
      "2 x 400g tins black beans, drained and rinsed",
      "200ml hot vegetable stock",
      "1-2 red chillies, deseeded and finely chopped",
      "Good dollop of Greek yogurt, plus extra to serve",
      "2 tbsp olive oil",
      "200g curly kale",
      "1 garlic clove, crushed",
      "Splash of white wine vinegar (optional)",
      "4 medium free-range eggs",
      "75g grated cheddar",
      "Hot chilli sauce (we like Lingham’s) or ketchup to serve",
      "2 large ripe avocados",
      "110g vine tomatoes, deseeded and roughly chopped",
      "½-1 green chilli, deseeded and finely chopped",
      "1-2 spring onions, finely sliced",
      "Juice of 1-2 limes"
    ],
    "method": [
      {
        "Step 1": "Put the black beans in a pan with the hot vegetable stock and half the red chillies, then cook for 20-25 minutes until almost broken down. Stir in the Greek yogurt and season well, then set aside."
      },
      {
        "Step 2": "Meanwhile, for the guacamole, peel, stone and mash the avocados with a fork until creamy but still a bit chunky. Stir in the tomatoes, green chilli and spring onions, then season with salt, pepper and the lime juice."
      },
      {
        "Step 3": "Heat the oil in a sauté pan over a medium heat and stir-fry the curly kale with the garlic, remaining red chilli and a splash of water for 10-12 minutes until tender. Season well."
      },
      {
        "Step 4": "Bring a pan of water to the boil, with a splash of vinegar if your eggs are not spanking fresh (see Know-how). One by one, carefully crack the eggs into the water. Take the pan off the heat and let the eggs cook for 3-4 minutes until the whites are just firm."
      },
      {
        "Step 5": "Divide the kale among 4 plates, scatter over the grated cheddar and top each portion with a poached egg. Serve with the guacamole, black bean chilli, yogurt and, if you like, ketchup or hot sauce."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/79.jpg"
  },
  {
    "id": "80",
    "title": "Spicy turkey enchiladas",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Takes 20 minutes to make, 30 minutes to cook",
    "description": "Turn leftover turkey into this comforting and quick-to-make enchilada recipe.",
    "ingredients": [
      "1 tbsp olive oil, plus extra for oiling",
      "1 small onion, finely chopped",
      "2 large garlic cloves, crushed",
      "2 tbsp chipotle chilli paste (see know-how)",
      "2 x 400g tins chopped tomatoes",
      "250ml fresh turkey or chicken stock",
      "Splash of red wine vinegar",
      "8 small corn tortillas",
      "400g leftover turkey, shredded",
      "2 tsp smoked paprika",
      "Pinch of cayenne pepper",
      "1½ tsp ground cumin",
      "5-6 pickled jalapeño slices, chopped, plus a splash of the pickling liquid",
      "300ml soured cream",
      "40g cheddar, grated"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a frying pan over a low heat and gently fry the onion for 10 minutes until golden and translucent. Add the garlic and chipotle paste and fry for 2 minutes more. Add the tomatoes, 200ml of the stock and the red wine vinegar. Season with a pinch of sugar, sea salt and ground black pepper, then simmer for 15-20 minutes."
      },
      {
        "Step 2": "Preheat the oven to 180°C/fan 160°C/gas 4. In another lightly oiled frying pan, fry each tortilla for 30 seconds on one side until golden, re-oiling the pan each time. Set aside. Put the turkey in the empty pan and warm through with the spices, remaining stock and pickling liquid. Remove from the heat and stir in the jalapeño slices."
      },
      {
        "Step 3": "Divide the turkey mixture equally among the tortillas, then roll them up. Spread one third of the tomato sauce on the bottom of a large ovenproof dish, then nestle in the enchiladas in one layer. Top with the rest of the sauce, dot all over with dollops of soured cream and scatter with cheese. Bake for 20 minutes until bubbling and piping hot. Leave to stand for 5 minutes, then serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/80.jpg"
  },
  {
    "id": "81",
    "title": "Cheddar, jalapeño, chilli and sweetcorn muffins",
    "difficulty": "Easy",
    "portion": "Makes 12",
    "time": "Hands-on time 20 min, oven time 20 min",
    "description": "Savoury baking doesn’t get much easier than this – grab one of Debbie Major’s cheddar and jalapeño muffins when you’re in a rush or pack one in your lunchbox for a spicy snack.",
    "ingredients": [
      "175g plain flour",
      "4½ tsp baking powder",
      "½ tsp salt",
      "150g dried polenta",
      "100g finely grated mature cheddar",
      "¼ tsp chilli flakes",
      "284ml pot of buttermilk (or whole milk)",
      "2 medium free-range eggs",
      "75g melted butter",
      "160g drained tinned sweetcorn",
      "2 deseeded, chopped jalapeño chilli",
      "1 sliced jalapeño chilli",
      "25g grated cheddar"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/gas 6. Line a muffin tray with 12 paper cases. Sift the flour, baking powder and salt into a bowl and stir in the dried polenta,  cheddar and chilli flakes."
      },
      {
        "Step 2": "Pour a 284ml pot of buttermilk (or whole milk) into a jug and beat in the eggs and melted butter."
      },
      {
        "Step 3": "Mix the milk mixture into the dry ingredients with 160g drained tinned sweetcorn and 1 deseeded, chopped jalapeño chilli. Slice another chilli."
      },
      {
        "Step 4": "Divide the batter among the paper cases, sprinkle with 25g grated cheddar and top with chilli slices. Bake for 20 minutes until golden and risen."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/81.jpg"
  },
  {
    "id": "82",
    "title": "Parmesan taco shells",
    "difficulty": "Easy",
    "portion": "Makes 4 shells",
    "time": "Hands-on time 10 min, oven time 8 min",
    "description": "Let’s taco ’bout how moreish these cheesy shells are. Perfect for packing with fresh ingredients such as avocado and crunchy veg slaw with coriander and a squeeze of lime. Mexi-can-we-have-some-more?",
    "ingredients": [
      "100g cheddar, finely grated",
      "50g parmesan, finely grated"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/gas 6. Line two baking sheets with baking paper. Put the cheeses into a mixing bowl and toss together. Spread the cheese into 4 circles, about 15cm in diameter on the baking sheets and bake for about 8-10 minutes."
      },
      {
        "Step 2": "While the cheese is cooking, have two large mixing bowls to hand. When the cooking time is up, carefully lift off the baking paper with the melted cheese circles on and place the paper on wire racks to cool for 1 minute. Carefully use a spatula to remove the cheese circles one by one from the baking paper and drape them over the edges of the bowls to shape them. Leave them to cool for 5 minutes, or until completely crisp, then stuff with your favourite taco fillings."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/82.jpg"
  },
  {
    "id": "83",
    "title": "Beef fajitas with avocado and sweetcorn salsa",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "Forget Friday night takeaways – this beef fajitas recipe takes just 30 minutes to make and will feed the whole family.",
    "ingredients": [
      "2 tbsp olive oil",
      "2 x 250g British free-range rump steaks",
      "4 red peppers, sliced",
      "2 onions, sliced",
      "2 garlic cloves, finely chopped",
      "1 tbsp fajita seasoning",
      "2 ripe avocados",
      "100g sweetcorn kernels, sliced off the cob, blanched (or tinned, rinsed and drained)",
      "Juice 1 lime, plus wedges or squeezing",
      "4-8 flour tortillas (depending on size)",
      "Roughly chopped fresh coriander, grated cheddar and soured cream (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat a frying pan over a high heat until smoking hot. Brush 1 tbsp olive oil over both sides of the steaks and season with salt and pepper. Fry the steaks for 2½ minutes on each side (for medium rare). Remove the steaks to a board and allow to rest, loosely covered with foil."
      },
      {
        "Step 2": "Add the remaining oil to the pan and fry the peppers, onions and garlic for 5-7 minutes, stirring often. Add the fajita seasoning for the final minutes and cook until the vegetables are tender but still with bite, then remove from the heat."
      },
      {
        "Step 3": "Slice the steak into 1cm strips. Put the avocados into a small bowl and mash with a fork to a rough paste. Mix in the sweetcorn and lime juice. Put the tortillas on 4 plates and divide the vegetables and meat among them. Serve with the avocado and sweetcorn salsa and lime wedges to squeeze over, with chopped coriander, grated cheddar and a dollop of soured cream if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/83.jpg"
  },
  {
    "id": "84",
    "title": "Vegetarian huevos rancheros",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 45 min, simmering time 10 min",
    "description": "Eggs, chilli, salsa and guacamole served on top of a soft corn tortilla – Sophie Michell’s brunch recipe is the perfect start to the weekend.",
    "ingredients": [
      "1 tsp olive oil, plus extra for frying the eggs",
      "1 onion, chopped",
      "½ tsp ground cumin",
      "Pinch dried chilli flakes",
      "400g can black beans, drained and rinsed",
      "2 corn tortillas",
      "2 medium free-range eggs",
      "50g feta, crumbled",
      "1 avocado, peeled and stoned",
      "Small handful chopped fresh coriander, plus extra to garnish",
      "Juice 1 lime",
      "½ garlic clove",
      "4 ripe tomatoes, finely chopped",
      "½ red onion, finely chopped",
      "Small handful chopped fresh coriander",
      "Dash Tabasco sauce"
    ],
    "method": [
      {
        "Step 1": "Heat 1 tsp olive oil in a small saucepan over a medium heat. Fry the onion, cumin and chilli flakes for 7-8 minutes until the onion is translucent. Add the beans and 100ml cold water, then season and simmer for about 10 minutes."
      },
      {
        "Step 2": "For the guacamole, put all the ingredients in a blender and whizz until smooth. Season, then set aside."
      },
      {
        "Step 3": "Combine all the salsa ingredients in a bowl. Season, then set aside."
      },
      {
        "Step 4": "When you’re ready to eat, heat the oven to low. Fry the tortillas in a hot dry frying pan for a few minutes on each side until golden. Keep warm in the oven while you fry the eggs."
      },
      {
        "Step 5": "Heat a little oil in a medium frying pan over a medium-high heat, then fry the eggs to your liking. When the eggs are ready, get out 2 plates. Put a tortilla on each plate, then spoon some beans on top. Make a well in the middle of the beans, then put a fried egg inside. Sprinkle with the feta and extra coriander, then serve with the guacamole and salsa."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/84.jpg"
  },
  {
    "id": "85",
    "title": "Lighter chicken enchiladas",
    "difficulty": "Easy",
    "portion": "Serves 8",
    "time": "Hands-on time 1 ¼ hours, oven time 40 min",
    "description": "After a healthy makeover these enchiladas contain 229kcals less than the traditional recipe; a guiltless dinner with a spicy punch.",
    "ingredients": [
      "1 large onion, cut into 2cm wedges",
      "2 large red peppers, cut into thin strips (about 1.5 cm)",
      "2 British free-range skinless boneless chicken breasts, cut into 2cm strips lengthways",
      "Olive oil for brushing",
      "8 small soft flour tortillas",
      "435g tin refried beans",
      "60g reduced-fat cheddar-style cheese, grated",
      "Chopped fresh coriander and crisp green salad to serve",
      "1 tbsp olive oil",
      "1 large onion, finely chopped",
      "3 garlic cloves, finely chopped",
      "1kg tomato passata",
      "2 tbsp Mexican spice mix (we used Old El Paso Seasoning Mix For Smoky BBQ Fajitas)",
      "2 small fresh jalapeño (or regular green) chillies, deseeded and very finely chopped",
      "2 tbsp olive oil",
      "2 tbsp plain flour",
      "150ml fresh chicken stock, hot",
      "150g fat-free Greek yogurt (we like Total)"
    ],
    "method": [
      {
        "Step 1": "For the tomato sauce, heat the oil in a medium saucepan, then fry the chopped onion for 10 minutes, stirring occasionally, until translucent, adding the garlic for the final 2 minutes. Add the passata and spice mix, then gently simmer for 15 minutes. Add the chillies, then season well and take off the heat."
      },
      {
        "Step 2": "Heat a griddle pan over a high heat until smoking. Lightly brush the onion wedges, peppers and chicken with oil, then griddle in batches for 3-4 minutes on each side until the veg are tender, the chicken is cooked through and everything has grill marks. Set aside on a plate."
      },
      {
        "Step 3": "Put the tortillas, one at a time, onto the hot griddle and warm for 10-20 seconds on each side, or until they start to char slightly, then put on a plate covered with a tea towel."
      },
      {
        "Step 4": "Heat the oven to 200°C/180°C fan/gas 6. For the béchamel sauce, heat the oil in a medium pan, then vigorously beat in the flour with a balloon whisk to form a smooth paste. Remove the pan from the heat and gradually whisk in the hot chicken stock, bit by bit. When it’s all incorporated, repeat with the Greek yogurt, whisking until smooth and thick enough to coat the back of a spoon."
      },
      {
        "Step 5": "To assemble, spread 1 tbsp tomato sauce over the middle of a tortilla. Spoon a line of refried beans down the centre. Top the beans with an eighth of the chicken and veg. Enclose the filling with an overlap, then put in a lightly oiled baking dish (about 20cm x 30cm), seam-side down. Repeat with the rest of the tortillas (see Make Ahead)."
      },
      {
        "Step 6": "Pour the remaining tomato sauce over the tortillas, then pour the béchamel over (not quite to the edges). Bake for 35 minutes until bubbling. Heat the grill to high, scatter the cheese over the enchiladas, then cook for 5 minutes until golden. Sprinkle with coriander, then serve with salad."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/85.jpg"
  },
  {
    "id": "86",
    "title": "Smoky sweetcorn fritters with tarragon yogurt",
    "difficulty": "Easy",
    "portion": "Serves 4 (makes 12 fritters)",
    "time": "Hands-on 35 min",
    "description": "Smoky sweetcorn fritters are vegetarian food done right – served warm from the pan with a dollop of tarragon yogurt and a crisp salad.",
    "ingredients": [
      "90g self-raising flour",
      "100ml milk",
      "1 large free-range egg",
      "½ tsp sweet smoked paprika (also called pimentón dulce)",
      "2 x 340g tins sweetcorn in water, drained",
      "5 spring onions, finely sliced",
      "2 garlic cloves, crushed",
      "1 small red chilli, deseeded and very finely chopped",
      "6 tbsp vegetable oil for frying ",
      "150g natural yogurt",
      "Small handful tarragon, roughly chopped",
      "Juice ½ lemon, plus wedges to serve",
      "Green salad to serve"
    ],
    "method": [
      {
        "Step 1": "Put the flour into a medium mixing bowl, then add the milk slowly, mixing it in using a balloon whisk. Add the egg and stir until fully incorporated, then stir in the paprika, sweetcorn, spring onions, crushed garlic and chopped red chilli.  "
      },
      {
        "Step 2": "Heat 2 tbsp oil in a large frying pan over a medium-high heat. Spoon 3-4 ladlefuls of batter into the pan at a time, to make 3-4 fritters, then fry for 3-4 minutes on each side, flipping them over when they’re golden underneath. Remove to a plate lined with kitchen paper while you make the rest, adding oil to the pan each time. "
      },
      {
        "Step 3": "Mix the yogurt with the tarragon and lemon juice in a bowl and serve alongside the fritters, with a green salad and lemon wedges for squeezing."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/86.jpg"
  },
  {
    "id": "87",
    "title": "Ultimate chilli",
    "difficulty": "Easy",
    "portion": "Serves 6-8",
    "time": "Hands-on 20 min, oven 1 hour 15 min",
    "description": "Donal Skehan’s ultimate chilli recipe combines rib-eye steak with kidney beans, chickpeas and spices to make a hearty dish that feeds a crowd.",
    "ingredients": [
      "2 tbsp rapeseed oil",
      "1 large onion, finely chopped",
      "3 garlic cloves, finely chopped",
      "3 small carrots, finely chopped",
      "2 celery stalks, finely chopped",
      "2 red peppers, finely chopped",
      "2 tsp hot chilli powder",
      "1 tsp smoked paprika",
      "2 tsp ground cumin",
      "Good pinch of cinnamon",
      "500g rib-eye steak, finely chopped, fat removed",
      "2 x 400g tins chopped tomatoes",
      "1 tbsp Worcestershire sauce",
      "1 tbsp treacle",
      "1 x 400g tin each kidney beans and chickpeas, drained and rinsed",
      "Crusty bread and crème fraîche to serve"
    ],
    "method": [
      {
        "Step 1": "Put a large pot or flameproof casserole over a medium heat and add the oil. Add the onion, garlic, carrots, celery and peppers, then stir in the chilli powder, paprika, cumin and cinnamon. Fry for 7-8 minutes, stirring now and then, until the vegetables are tender."
      },
      {
        "Step 2": "Add the meat to the pan and fry gently until lightly browned (about 5 minutes), stirring regularly. Pour in the chopped tomatoes and 250ml water (swill in the empty tomato tins, then add to the chilli to get all the tomato juice out)."
      },
      {
        "Step 3": "Add the Worcestershire sauce and treacle. Bring to the boil, then reduce the heat and simmer for about 45 minutes, stirring every now and then. Add the kidney beans and chickpeas and simmer for another 15 minutes."
      },
      {
        "Step 4": "Season with salt and black pepper to taste, then serve in deep bowls with the guacamole and tomato salsa salad (right), and crusty bread and a dollop of crème fraîche, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/87.jpg"
  },
  {
    "id": "88",
    "title": "Spicy guacamole",
    "difficulty": "Easy",
    "portion": "Serves 6-8 as a side dish",
    "time": "Hands-on 10 min",
    "description": "Serve Donal Skehan’s guacamole recipe with a hearty bowl of chilli, as a dip for tortilla chips or simply spread on toast.",
    "ingredients": [
      "2 ripe avocados",
      "Juice of 2 limes",
      "1 small red onion, finely chopped",
      "1-2 tsp Tabasco sauce",
      "2 tbsp extra-virgin olive oil",
      "Bunch of fresh coriander, roughly chopped"
    ],
    "method": [
      {
        "Step 1": "Halve the avocados lengthways and remove the stones. Scoop out the green flesh, chop roughly and place in a medium-size bowl."
      },
      {
        "Step 2": "Stir in the lime juice to stop it discolouring, then add the rest of the ingredients. Season to taste with a good pinch of salt and freshly ground black pepper and that’s it. Enjoy!"
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/88.jpg"
  },
  {
    "id": "89",
    "title": "Tomato salsa salad",
    "difficulty": "Easy",
    "portion": "Serves 6-8 as a side dish",
    "time": "Hands-on 15 min",
    "description": "Donal Skehan’s tomato salsa salad recipe is great served on the side of a meaty chilli or as part of a Mexican feast.",
    "ingredients": [
      "4 medium-size vine-ripened tomatoes, chopped into chunks,",
      "or 12 cherry tomatoes, quartered",
      "2 red peppers, finely chopped",
      "½ red onion, finely chopped",
      "1 garlic clove, crushed",
      "Small handful of fresh coriander, finely chopped",
      "Juice of 1 lime",
      "1 tbsp extra-virgin olive oil "
    ],
    "method": [
      {
        "Step 1": "Add all the ingredients to a medium-size bowl with plenty of sea salt and freshly ground black pepper, then toss well to combine."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/89.jpg"
  },
  {
    "id": "90",
    "title": "Spicy Mexican tortilla soup with avocado salsa",
    "difficulty": "Easy",
    "portion": "Serves 6-8",
    "time": "Hands-on time 25min, simmering time 30 min, oven time 5 min",
    "description": "A vegetarian soup recipe, full of Mexican flavour that makes best use of store cupboard ingredients; perfect for weeknight supper.",
    "ingredients": [
      "2 tbsp olive oil",
      "1 large onion, finely chopped",
      "2 garlic cloves, sliced",
      "½ dried ancho chilli, soaked in boiling water for 15 minutes, then drained (see tips)",
      "1 tsp sweet smoked Spanish paprika (pimentón)",
      "1 tsp ground cumin",
      "1 litre vegetable stock",
      "2 x 400g tins chopped tomatoes",
      "400g tin kidney beans, drained and rinsed",
      "400g tin black beans, drained and rinsed",
      "200g frozen sweetcorn",
      "Soured cream and lime wedges to serve",
      "3 soft flour tortillas",
      "Olive oil to brush",
      "2 ripe avocados",
      "Extra-virgin olive oil to drizzle",
      "Juice 2 limes",
      "Small bunch fresh coriander, leaves picked and stems chopped",
      "1 fresh jalapeño (or green) chilli, seeds removed, finely sliced"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C/180°C fan/ gas 6. Heat the olive oil in a large, deep saucepan over a low-medium heat, then add the onion and garlic and cook gently, stirring now and then, for 8 minutes or until very soft. Split the ancho chilli open, scrape out the flesh inside (discard the skin) and add it to the pan with the paprika and cumin. Cook for 1-2 minutes until fragrant."
      },
      {
        "Step 2": "Add the vegetable stock and tinned tomatoes and bring to the boil, then cook for 15 minutes or until ￼￼the liquid has reduced slightly. Add the beans and sweetcorn and cook for 5 minutes more."
      },
      {
        "Step 3": "Meanwhile cut the tortillas into 8 small triangles and brush on both sides with a little olive oil. Lay the triangles in a single layer on a baking sheet, then toast in the oven for 4-6 minutes until golden and crisp – keep an eye on them as they can burn easily (there’s no need to turn them)."
      },
      {
        "Step 4": "For the salsa, cut the avocados into small cubes, put in a bowl, drizzle with the extra-virgin olive oil and squeeze over the lime juice. Add the coriander and chilli, then season well with salt and pepper and mix. 4 Serve the soup hot in bowls with the salsa, a dollop of soured cream and some tortilla chips, with extra lime wedges on the side."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/90.jpg"
  },
  {
    "id": "91",
    "title": "Quick chilli con carne",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min, cooking time 20-25 min",
    "description": "When you fancy a chilli con carne but don’t have the time for slow cooking – this is the quick chilli recipe for you.",
    "ingredients": [
      "1 tbsp olive oil",
      "2 large onions, finely chopped",
      "3 garlic cloves, crushed",
      "500g British beef mince",
      "1 tbsp ground cumin",
      "1 tsp smoked paprika (pimentón), hot or sweet, depending on how hot you like your chilli con carne",
      "¼ tsp ground cinnamon",
      "400g tin chopped tomatoes",
      "250ml fresh beef stock",
      "400g tin red kidney beans, drained and rinsed",
      "Coriander leaves, lime wedges, soured cream and warmed tortillas or steamed rice"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large sauté pan over a medium-high heat and add the onions. Cook for 10 minutes, stirring often, until softened and translucent. Add the garlic and fry, stirring, for 2 minutes more until fragrant, then tip out into a bowl."
      },
      {
        "Step 2": "Turn up the heat to high, add the beef to the pan and season well, pressing it down with a wooden spoon and breaking it up so it browns all over. When it’s browned, tip out the juices from the pan and discard, then return the onions to the pan with the cumin, paprika and cinnamon. Cook, stirring, for 2-3 minutes until fragrant, then add the tomatoes with a pinch of sugar and the beef stock."
      },
      {
        "Step 3": "Bring to a simmer and cook, stirring occasionally, for 20-25 minutes until the beef has taken on the flavours of the spices and the sauce is reduced and thick. Add the kidney beans and cook for 5 minutes more, then taste, season and serve with your choice of accompaniments."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/91.jpg"
  },
  {
    "id": "92",
    "title": "Tres leches cake with white russian syrup",
    "difficulty": "Medium",
    "portion": "Serves 9-12",
    "time": "Hands-on time 45 min, oven time 30-35 min",
    "description": "A classic cake that you can find in Mexico, central and south America – but this time combined with the flavours of a white russian cocktail. It’s a great recipe to add to your dinner party repertoire.",
    "ingredients": [
      " Sunflower oil or butter for greasing",
      "4 medium free-range eggs",
      "125g caster sugar",
      "100g unsalted butter, melted",
      "100g plain flour",
      "Coffee beans to serve",
      "Cocoa powder for dusting",
      "170g can evaporated milk",
      "150ml condensed milk",
      "180ml whole milk (we like a creamy milk such as gold top)",
      "30ml vodka",
      "70ml Kahlúa",
      "200ml double cream"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C/160°C fan/ gas 4. Lightly oil or grease a 20cm square cake tin and line the bottom with baking paper (see tip). Separate the eggs, putting the whites in a large mixing bowl with the sugar. Whisk with an electric mixer to stiff peaks (about 4-5 minutes), then whisk in the yolks. Using a metal spoon, fold in the melted butter and finally the flour with a pinch of salt, taking care not to knock the air out of the mixture."
      },
      {
        "Step 2": "Gently pour the batter into the lined tin, then bake in the middle of the oven for 30-35 minutes until the cake is risen, golden and springy to the touch. Remove from the oven."
      },
      {
        "Step 3": "Mix all the ingredients for the syrup, apart from the double cream, in a bowl. When the cake is still warm, leave it in its tin and gently poke holes all over it with a skewer. Spoon over half the syrup slowly, letting it sink in before continuing (reserve the rest of the syrup in the fridge). Leave the cake to cool completely in the tin, then cover with cling film and leave to stand for at least 1 hour or overnight."
      },
      {
        "Step 4": "When ready to serve, mix the rest of the chilled syrup with the cream and divide among deep plates or shallow bowls. Remove the cake from the tin and slice into squares, then sit the squares in the cream mixture. Scatter with the coffee beans and dust with cocoa powder, then serve immediately."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/92.jpg"
  },
  {
    "id": "93",
    "title": "Ernesto’s winning chilli",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 30 min, simmering time 40 min",
    "description": "Ernest Puga Cardoso’s winning entry to the Great chilli cook off- you can be assured this recipe packs a flavoursome punch.",
    "ingredients": [
      "1 tbsp vegetable oil",
      "1 onion, finely chopped",
      "2 garlic cloves, chopped",
      "1 red pepper, finely chopped",
      "2 medium vine tomatoes, chopped",
      "1 tsp hot chilli powder",
      "1 tsp paprika",
      "1 tsp ground cumin",
      "500g 10% fat British Aberdeen Angus beef mince",
      "100ml red wine",
      "1 tsp dried oregano",
      "1 tsp dried thyme",
      "3 tsp tomato paste",
      "400g tin chopped tomatoes",
      "240ml quality fresh beef stock",
      "2 bay leaves",
      "1 medium cinnamon stick ",
      "400g tin kidney beans, drained and rinsed",
      "400g tin sweetcorn",
      "30g dark chocolate (85% cocoa solids), broken into pieces",
      "Ripe avocado, soured cream, fresh coriander sprigs and soft flour tortillas to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a medium pan over a low heat. Add the onion and cook for 5 minutes, stirring occasionally, until translucent. Add the garlic, pepper and vine tomatoes and cook, stirring, for 6-8 minutes until the tomatoes have softened."
      },
      {
        "Step 2": "Make a space in the centre of the mixture, then add the chilli powder, paprika and cumin. Mix well, then cook for around 5 minutes."
      },
      {
        "Step 3": "Meanwhile, season and cook the mince in a separate pan over a high heat for 8 minutes or until browned."
      },
      {
        "Step 4": "Drain the mince, then add it to the tomato mixture, along with the wine. Stir over a high heat until the wine evaporates. Stir in the oregano and thyme, then the tomato paste. Reduce the heat to low and cook for 1 minute. Add the tinned tomatoes and stock. Cook for 5 minutes; stir occasionally."
      },
      {
        "Step 5": "Add the bay and cinnamon, then cover the pan with a lid and simmer for 30 minutes, stirring now and then."
      },
      {
        "Step 6": "Remove the lid and stir in the beans and sweetcorn, then cook, uncovered, for 10 minutes. Taste and season, then stir in the chocolate until it has melted. Remove the pan from the heat, then discard the bay leaves and cinnamon stick. Serve in bowls topped with avocado slices, soured cream, coriander sprigs and a grind of black pepper, with soft flour tortillas on the side, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/93.jpg"
  },
  {
    "id": "94",
    "title": "Beef chilli with dark chocolate",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 30 min, simmering time 40 min",
    "description": "Ernesto Puga Cardoso won our Great Chilli Cook-Off competition with this beef and dark chocolate chilli recipe.",
    "ingredients": [
      "1 tbsp vegetable oil",
      "1 onion, finely chopped",
      "2 garlic cloves, chopped",
      "1 red pepper, finely chopped",
      "2 medium vine tomatoes, chopped",
      "1 tsp hot chilli powder",
      "1 tsp paprika",
      "1 tsp ground cumin",
      "500g 10% fat British Aberdeen Angus beef mince",
      "100ml red wine",
      "1 tsp dried oregano",
      "1 tsp dried thyme",
      "3 tsp tomato paste",
      "400g tin chopped tomatoes",
      "240ml quality fresh beef stock",
      "2 bay leaves",
      "1 medium cinnamon stick",
      "400g tin kidney beans, drained and rinsed",
      "400g tin sweetcorn",
      "30g dark chocolate (85% cocoa solids), broken into pieces",
      "Ripe avocado, soured cream, fresh coriander sprigs and soft flour tortillas to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a medium pan over a low heat. Add the onion and cook for 5 minutes, stirring occasionally, until translucent. Add the garlic, pepper and vine tomatoes and cook, stirring, for 6-8 minutes until the tomatoes have softened."
      },
      {
        "Step 2": "Make a space in the centre of the mixture, then add the chilli powder, paprika and cumin. Mix well, then cook for around 5 minutes."
      },
      {
        "Step 3": "Meanwhile, season and cook the mince in a separate pan over a high heat for 8 minutes or until browned."
      },
      {
        "Step 4": "Drain the mince, then add it to the tomato mixture, along with the wine. Stir over a high heat until the wine evaporates. Stir in the oregano and thyme, then the tomato paste. Reduce the heat to low and cook for 1 minute. Add the tinned tomatoes and stock. Cook for 5 minutes; stir occasionally."
      },
      {
        "Step 5": "Add the bay and cinnamon, then cover the pan with a lid and simmer for 30 minutes, stirring now and then."
      },
      {
        "Step 6": "Remove the lid and stir in the beans and sweetcorn, then cook, uncovered, for 10 minutes. Taste and season, then stir in the chocolate until it has melted. Remove the pan from the heat, then discard the bay leaves and cinnamon stick. Serve in bowls topped with avocado slices, soured cream, coriander sprigs and a grind of black pepper, with soft flour tortillas on the side, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/94.jpg"
  },
  {
    "id": "95",
    "title": "Smoky beef chilli with black beans",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 40 mins, simmering time 3 hours, plus soaking",
    "description": "Jennifer Joyce’s smoky beef chilli recipe is full of fresh Mexican flavours and packed with black beans and a real chilli heat.",
    "ingredients": [
      "2 pasilla or guajillo chillies (see tips)",
      "800ml tomato passata",
      "900g beef shin, cut into 3 cm cubes",
      "4 tbsp olive oil",
      "2 large onions, roughly chopped",
      "6 garlic cloves, finely chopped",
      "2 tbsp smoked sweet paprika (pimentón)",
      "3 tbsp ground cumin",
      "1 tbsp chipotle purée",
      "60ml cider vinegar",
      "50g soft brown sugar",
      "1 tsp sea salt",
      "2 X 400g tins black beans, drained and rinsed",
      "Finely chopped red onion",
      "Chopped avocado",
      "Fresh coriander leaves",
      "Grated red leicester cheese",
      "Tortilla chips"
    ],
    "method": [
      {
        "Step 1": "Boil the kettle and heat a frying pan over a high heat, add the dried chillies and cook until they puff up, turning once, for about 30 seconds.  Remove and put in a medium bowl, cover with boiling water and leave to soak.  Weight them down with a small plate if they float to the top and leave until soft, about 15 minutes. Put the chillies in a blender and pour 100ml of the tomato passata in to help it blend until very smooth, then set aside."
      },
      {
        "Step 2": "Season the beef with salt and pepper. Heat 1 tablespoon of the olive oil in a large saucepan with a lid or casserole over medium-high heat. Cook the beef, in batches, for 1–2 minutes each side or until browned all over, then remove and set aside. "
      },
      {
        "Step 3": "Reduce the heat to medium-low, add the remaining oil, onion and garlic, season with salt and pepper and cook for 5–6 minutes or until softened. Add the spices and chipotle purée to the onion mixture and cook for a few minutes."
      },
      {
        "Step 4": "Add the chilli paste, remaining passata, vinegar, sugar, beef and the teaspoon of salt. Cover with a lid and cook for 3 hours on a very low heat or until the beef is tender. Add the beans and warm through. Top with the onion, avocado, coriander, cheese and serve with tortilla chips, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/95.jpg"
  },
  {
    "id": "96",
    "title": "Drunken caterpillar chilli con carne",
    "difficulty": "Medium",
    "portion": "Serves 4-6",
    "time": "Hands on time 1 hour 15 min, simmering time 4 hours",
    "description": "This ‘caterpillar’ chilli recipe uses pig cheek as well as beef shin and beef mince making this Mexican-inspired dish extra hearty.",
    "ingredients": [
      "1 red onion, peeled",
      "8 garlic cloves, peeled",
      "4 fresh oregano sprigs",
      "Extra-virgin olive oil, to drizzle",
      "1 tsp dark muscovado sugar",
      "400g tin plum tomatoes or fresh tomatoes (see tips)",
      "400g tin black beans, drained and rinsed",
      "2 whole mild chillies such as pasilla, mulato or ancho, or a combination",
      "½ star anise",
      "1 tsp cumin seeds",
      "500g boneless beef shin, trimmed, or heel of beef",
      "250g pig’s cheek",
      "Vegetable or sunflower oil",
      "250g quality beef mince",
      "300ml porter, or other dark beer, such as Guinness",
      "1 tsp chilli piquin powder or other chilli powder",
      "1 tsp powdered chipotle chilli (about half a large chipotle chilli)",
      "1 tsp sweet smoked paprika",
      "1 tsp sal de gusano (chilli salt made with crushed caterpillars) or Maldon smoked salt",
      "1 tsp treacle",
      "250-500ml fresh beef stock",
      "Fresh coriander leaves",
      "Sour cream",
      "Pickled jalapeños",
      "Tortilla chips"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200’C/180 fan/gas 6. Top, tail and quarter the onion and separate the layers. Put in a roasting tray with the garlic, half the oregano, a good drizzle of extra-virgin oil, the muscovado sugar and the tomatoes. Toss together until coated, cover with foil and cook for 40 minutes, then remove the foil and cook another 20 minutes. Transfer to a blender and pulse; you want a chunky consistency not a purée, and set aside."
      },
      {
        "Step 2": "Mash half the beans into a paste, leave the others whole and set aside. Put a large frying pan on high heat and toast the whole mild chillies, star anise and cumin seeds for a minute or two until smoking a little. Transfer to a blender or pestle and mortar and grind into powder, then set aside."
      },
      {
        "Step 3": "Cut the beef and pork cheek into rough 4cm chunks. Heat a large pan or casserole on a high heat and add a glug of flavourless oil. Brown the meat in batches until nicely browned, turning occasionally, for about 5 minutes, then set aside as you go. Cook the mince in the same pan until brown, about 2-3 minutes. Add the rest of the meat back in and pour in the beer. Boil until the liquid is reduced by half, about 6-8 minutes."
      },
      {
        "Step 4": "Add in the reserved tomato and onion mix, the remaining dry ingredients, reserved oregano, treacle and 250ml beef stock. Cover and cook on the lowest heat for 4 hours on the hob. Stir the meat occasionally to prevent it from burning and sticking, If it is looking too dry add a little more stock. Check the meat after 4 hours, it should be so tender it gives no resistance when you shred it."
      },
      {
        "Step 5": "Remove the big chunks of meat from the pan and shred using two forks. Return to the pan, stir to combine, add the black beans and black bean paste, add more stock if you want a looser consistency, adjust the chilli heat and seasoning to taste. Serve with coriander, sour cream, pickled jalapeños and tortilla chips, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/96.jpg"
  },
  {
    "id": "97",
    "title": "Barbecue sweet potatoes with garlic and herb dressing",
    "difficulty": "Easy",
    "portion": "Serves 6 as a side",
    "time": "Hands-on time 15 min, barbecue or oven time 1 hour",
    "description": "Simply wrap sweet potatoes in foil then leave to slowly cook in your barbecue embers while you make a gorgeous garlic and herb soured cream topping.",
    "ingredients": [
      "6 medium sweet potatoes, unpeeled",
      "Extra-virgin olive oil to drizzle",
      "6 fat garlic cloves, unpeeled",
      "300g soured cream or natural yogurt",
      "½ red onion",
      "Finely grated zest and juice",
      "1 lemon",
      "Small bunch fresh coriander, chopped",
      "Small bunch fresh flatleaf parsley, chopped",
      "Small bunch fresh mint, chopped, plus extra leaves to serve"
    ],
    "method": [
      {
        "Step 1": "Put each sweet potato on a large piece of foil. Drizzle over olive oil and season well. Wrap tightly and put in the barbecue embers for 45-60 minutes. Alternatively, roast in an oven heated to 200°C/180°C fan/gas 6 for 1 hour 20 minutes."
      },
      {
        "Step 2": "Meanwhile, wrap the garlic cloves in a little foil, drizzle with olive oil, and leave in the embers for 15-20 minutes until soft (or cook in the oven, as above, for 20 minutes). Finely slice the red onion and put in a non-metallic bowl with most of the lemon juice and a pinch of salt."
      },
      {
        "Step 3": "When the garlic is cool enough to handle, squeeze the flesh from the skins into a large bowl and drizzle with a little more olive oil. Mix in the soured cream or yogurt gradually to distribute the garlic evenly."
      },
      {
        "Step 4": "When ready to serve, add the chopped herbs, lemon zest and the remaining lemon juice, season and taste. Remove the onions from the lemon juice, squeezing them dry."
      },
      {
        "Step 5": "Open the sweet potato parcels, squash the flesh open a bit, spoon over the garlic and herb dressing, scatter with the onions and extra mint leaves, then serve in the foil."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/97.jpg"
  },
  {
    "id": "98",
    "title": "Griddled cheesy cornbreads",
    "difficulty": "Easy",
    "portion": "Makes 6",
    "time": "Hands-on time 5 min, barbecue time 5-6 min",
    "description": "Use these cheesy flatbreads for dipping into houmous, as a side to salads and soups, or wrapping around beef koftas.",
    "ingredients": [
      "150g self-raising flour, plus extra for dusting",
      "100g polenta or cornmeal",
      "1 tsp sea salt",
      "250g natural yogurt",
      "100g mature cheddar, grated"
    ],
    "method": [
      {
        "Step 1": "Put the flour, polenta or cornmeal and sea salt in a mixing bowl, add the yogurt and cheese, then mix with a fork. Bring it all together with your hands into a soft, not wet, dough (add a splash of water if it’s too dry)."
      },
      {
        "Step 2": "Tip out onto a lightly floured work surface, knead for 2-3 minutes until smooth, then divide into 6 pieces and roll each into a 10cm circle. Cook the cornbreads on a medium-hot barbecue for 2-3 minutes on each side until puffed and charred."
      },
      {
        "Step 3": "Serve with these homemade beef koftas."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/98.jpg"
  },
  {
    "id": "99",
    "title": "Leftover chicken quesadillas",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 15 min",
    "description": "This quesadilla recipe is a great way to use up leftover roast chicken and makes a perfect lunch to take to work.",
    "ingredients": [
      "75g cooked chicken or pancetta or a mix of both (or same weight in veg)",
      "75g grated mature cheddar and edam",
      "4 spring onions, sliced",
      "1 jalapeno chilli, finely chopped",
      "Large handful fresh coriander, chopped",
      "Olive oil",
      "2 flour tortillas"
    ],
    "method": [
      {
        "Step 1": "Combine the meat and/or veg with the cheese spring onions, chilli and coriander. Season well."
      },
      {
        "Step 2": "Heat a glug of oil in a large frying pan. Put one tortilla in the pan and top with the filling, leaving a narrow border around the edge. Put another flour tortilla on top, then press down gently. Cook over a medium heat, pressing down on the quesadilla, for 3 minutes or until the underside is deep golden. Carefully flip the quesadilla over with a fish slice and cook on the other side in the same way until the underside is toasted and the cheese is melted. Serve cut into wedges."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/mexican_api/99.jpg"
  }
]