[{},
  {
    "id": "1",
    "title": "Dark chocolate bark with sea salt, rosemary, pistachios and candied citrus",
    "difficulty": "Easy",
    "portion": "Makes 6 generous shards",
    "time": "Hands-on time 15 min, plus cooling",
    "description": "Close your eyes and feel the Mediterranean sun beating down on you as you take a bite out of vegan dark chocolate bark studded with pistachios, rosemary-flavoured salt and little bursts of candied peel.",
    "ingredients": [
      "200g dark chocolate",
      "1 tsp flaky sea salt",
      "2 rosemary sprigs",
      "Handful shelled pistachios",
      "2 tbsp mixed peel or candied lemon, chopped"
    ],
    "method": [
      {
        "Step 1": "Bring a small pan of water to a simmer and put a heatproof bowl on top (ensuring the base of the bowl doesn’t touch the water). Finely chop the chocolate and add it to the bowl, then wait 5-10 minutes until it’s completely melted."
      },
      {
        "Step 2": "Meanwhile, line a small baking dish or container (which will dictate the shape and size of your bark) with baking paper. Put the salt in a spice grinder or pestle and mortar, then finely chop the leaves from 1 of the rosemary sprigs. Grind the chopped leaves with the salt."
      },
      {
        "Step 3": "Pour the melted chocolate into the lined dish or container, tilting it so the chocolate runs into each corner equally. Put the remaining rosemary sprig on top, then scatter the pistachios, rosemary salt and mixed peel all over the top."
      },
      {
        "Step 4": "Leave to cool for 10 minutes, then cover and put in the fridge for 2 hours to set completely. Break into shards and keep in an airtight container for up to a week."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/1.jpg"
  },
  {
    "id": "2",
    "title": "Pressure cooker refried beans",
    "difficulty": "Easy",
    "portion": "Serves 4-8 as a side",
    "time": "Hands-on time 15 min. Simmering time 30 min",
    "description": "Using dried instead of tinned beans is cheaper and offers up more flavour, but most of us don’t bother due to the time it takes. A pressure cooker is the solution – better for your time, wallet and for the environment. These refried beans beat anything you can buy and are the perfect introduction to pressure  cooking and dried pulses (a match made in heaven).",
    "ingredients": [
      "500g dried pinto beans",
      "1 tsp dried oregano",
      "1 tsp ground cumin",
      "1 tsp fine sea salt",
      "2 tbsp olive oil or lard",
      "1 large onion, finely chopped",
      "1 jalapeno, finely chopped",
      "3 garlic cloves, chopped",
      "Diced tomatoes, pickled jalapenos and fresh coriander to serve",
      "Pressure cooker"
    ],
    "method": [
      {
        "Step 1": "inse the beans then put them in the pressure cooker with 1.6 litres water. Stir in the oregano, cumin and salt. Add the lid and bring to high pressure then cook for 30 minutes. Allow the steam to release naturally then open and check if they’re done (they should be very tender). Return to high pressure and cook for another 5-10 minutes if needed."
      },
      {
        "Step 2": "Once the beans are cooked, drain them, reserving the cooking water in a jug. Return the pressure cooker to a medium heat (or set to the sauté function if electric), add the oil or lard then cook the onion, jalapeno and garlic with a pinch of salt for about 5 minutes, until softened. Stir in the drained beans then cook for a few minutes, adding a little of their cooking water while mashing with a potato masher until you reach the desired consistency (if you prefer them smoother you can whizz with a hand blender then continue cooking). Season to taste then serve topped with tomatoes, pickled jalapenos and coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/2.jpg"
  },
  {
    "id": "3",
    "title": "Beetroot, spinach and coconut curry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min. Simmering time 20 min",
    "description": "Healthy, fresh tasting and with a rich finish thanks to coconut milk, this is an easy curry to knock together on a busy weeknight. The tamarind and lime cut through the creaminess to create flavour harmony.",
    "ingredients": [
      "2 tbsp vegetable oil",
      "1 onion, finely sliced",
      "1 green chilli, finely sliced",
      "2 tbsp ginger garlic paste",
      "2 tbsp mild curry powder",
      "1 tsp ground turmeric",
      "½ tsp ground coriander",
      "500g plum tomatoes, chopped",
      "250g cooked beetroot, chopped",
      "400ml tin coconut milk",
      "1 tbsp tamarind paste",
      "100g baby spinach",
      "Handful coriander leaves, chopped",
      "1 lime, cut into wedges, to serve (optional)",
      "Flatbreads or rice to serve"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large saucepan over a low-medium heat. Tip in the onion and chilli and cook slowly for 10-12 minutes, stirring occasionally, until soft. Add the ginger garlic paste and dried spices and cook for a few more minutes, stirring often."
      },
      {
        "Step 2": "Add the tomatoes and cook for 2 minutes, then add the cooked beetroot and coconut milk and simmer for 15 minutes. Stir in the tamarind, spinach and half of the chopped coriander and simmer for a final 5 minutes."
      },
      {
        "Step 3": "Divide among bowls and sprinkle over the remaining coriander. Serve with wedges of lime on the side (if using) and rice or flatbreads."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/3.jpg"
  },
  {
    "id": "4",
    "title": "Traditional pretzels",
    "difficulty": "Easy",
    "portion": "Makes 13",
    "time": "Hands-on time 40 min, plus 1 hour resting. Oven time 10-12 min",
    "description": "Learn to make classic twisted pretzels with this authentic recipe from food writer and historian Regula Ysewijn. They’re easier to make than you’d think!",
    "ingredients": [
      "270g strong white bread flour, plus extra to dust",
      "2 tbsp rapeseed or olive oil",
      "1 tsp caster sugar",
      "1 tsp instant dry yeast",
      "180ml water",
      "½ tsp salt"
    ],
    "method": [
      {
        "Step 1": "Mix the flour, oil, sugar and yeast in a large bowl or the bowl of a stand mixer fitted with a dough hook. Pour in 90ml water and start kneading. When completely absorbed, pour in another 90ml water and knead for 5 minutes. Set aside to rest for 5 minutes"
      },
      {
        "Step 2": "Add the salt and knead for 10 minutes until it has come together in a smooth and elastic dough that is neither too dry nor terribly wet. Cover the dough and set aside for 1 hour until it has doubled in size."
      },
      {
        "Step 3": "the end of the resting time, line 2-3 baking trays with baking paper and heat the oven to 210°C fan/gas 8."
      },
      {
        "Step 4": "Knock the air out of the dough and divide it into 13 equal pieces. Have a small bowl of water handy. Take a piece of dough in your hand and stretch, then moisten your hands with a little water and roll the dough into a 60cm strand that is just under 1cm wide."
      },
      {
        "Step 5": "Sprinkle each lined tray with some flour to prevent the dough from sticking. Shape the strand into a pretzel straight onto the tray by twisting the ends of the strand together once or twice, depending on your preference. Moisten your index finger and thumb and stick the twisted ends onto the middle of the loop. You can correct the shape if needed once the krakeling is on the tray."
      },
      {
        "Step 6": "Bake the pretzels for 10-12 minutes until they have a golden blush, then transfer to a wire rack to cool. Keep in an airtight container."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/4.jpg"
  },
  {
    "id": "5",
    "title": "Homemade crispy chilli oil",
    "difficulty": "Easy",
    "portion": "Makes 250ml",
    "time": "Hands-on time 30 min, plus overnight infusing ",
    "description": "This is a full-flavoured, in-your-face crispy chilli oil, with plenty of fire, spice and floral numbness from the Sichuan peppercorns. Use it as a base recipe to then tweak, amend and experiment with until you’ve found your perfect combination.",
    "ingredients": [
      "250g vegetable or sunflower oil",
      "2 slices fresh ginger",
      "3 banana shallots, finely sliced",
      "5 garlic cloves, finely sliced",
      "3 tbsp Sichuan peppercorns",
      "3 star anise",
      "1 cinnamon stick",
      "1 tsp fennel seeds",
      "50g gochugaru (Korean red pepper flakes)",
      "25g chilli flakes, or crushed dried chillies",
      "½ tbsp sweet paprika",
      "2 dried bay leaves",
      "2 tsp salt",
      "1 tsp caster sugar",
      "Thermometer",
      "Sterilised jar"
    ],
    "method": [
      {
        "Step 1": "Pour the oil into a saucepan with a spout. Add the ginger, shallots and garlic, then place over a medium heat and gradually bring to 160°C. Meanwhile, put the Sichuan peppercorns, star anise, cinnamon stick and fennel seeds in a dry frying pan and toast over a medium heat for a few minutes until fragrant. Crush the peppercorns and fennel seeds in a pestle and mortar."
      },
      {
        "Step 2": "Mix the toasted spices with the remaining ingredients in a heatproof container that holds at least a litre, as the oil will bubble up a lot when you pour it in. Mould the mixture into a pyramid, then make an indent in the tip – this is what you’ll pour your oil into."
      },
      {
        "Step 3": "As the oil heats up, the ginger, shallots and garlic will sizzle and begin to colour. As soon as they turn golden, remove them with a slotted spoon. Discard the ginger and leave the shallots and garlic to crisp up as they cool."
      },
      {
        "Step 4": "Once the oil is up to temperature, very carefully pour around a quarter of it into the chilli mixture – it will instantly bubble up and produce a lot of steam. Give everything a good mix, then continue to pour the oil slowly, until the bowl or jar is filled. Leave to cool for 10 minutes, add the fried garlic and shallots, then transfer to a sterilised jar. Seal and leave to infuse at room temperature overnight."
      },
      {
        "Step 5": "The next day, carefully remove and discard the star anise, cinnamon and bay leaves. Keep the chilli oil in the fridge for up to a month."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/5.jpg"
  },
  {
    "id": "6",
    "title": "Ultimate vegan lasagne",
    "difficulty": "Easy",
    "portion": "Serves 8",
    "time": "Hands-on time 45 min. Oven time 45 min",
    "description": "Lasagne is usually a celebration of all things meaty and creamy, with a rich ragù and creamy bechamel layered between silky pasta sheets. With just a few swaps, however, it becomes a wonderful vegan dish thrumming with Italian flavour.",
    "ingredients": [
      "1 large red onion",
      "2 celery sticks",
      "2 carrots, peeled",
      "1 medium fennel bulb",
      "1 tbsp olive oil",
      "2 bay leaves",
      "3 garlic cloves, finely chopped",
      "250ml vegan red wine",
      "3 tbsp tomato purée",
      "1 tbsp balsamic vinegar",
      "1 tsp sugar",
      "400g tin chopped tomatoes",
      "500g passata",
      "350ml vegetable stock",
      "450g frozen or fresh meat-free mince",
      "Bunch basil, roughly chopped, with a few leaves reserved to garnish",
      "500g pack dried egg-free lasagne sheets",
      "4 tbsp plain flour",
      "5 tbsp vegan spread",
      "675ml unsweetened soya, almond or oat milk",
      "1 heaped tsp dijon mustard",
      "Pinch freshly grated nutmeg",
      "2 tbsp nutritional yeast flakes",
      "60g vegan parmesan alternative (we used Violife Prosociano), finely grated",
      "33cm x 22cm lasagne dish"
    ],
    "method": [
      {
        "Step 1": "Using a food processor, whizz the onion, celery, carrots and fennel until finely chopped but not puréed – you may need to do this in a couple of batches and scrape down the sides as needed. Heat the oil in a large deep saucepan, add the chopped vegetables with the bay leaves and garlic, then cover and cook over a medium heat for 5-6 minutes until softened. Remove the lid and cook for a few more minutes, stirring regularly, to allow some of the liquid to evaporate."
      },
      {
        "Step 2": "Pour in the red wine, tomato purée, balsamic vinegar and sugar, then bring to a simmer and cook for 2-3 minutes until reduced by at least half before adding the tomatoes, passata, stock and mince. Season with lots of black pepper and simmer for 15-20 minutes until the sauce is thickened. Remove from the heat and stir in the chopped basil."
      },
      {
        "Step 3": "Meanwhile, make the white sauce by whisking together the flour and spread in a medium saucepan over a medium heat. Whisk in the milk bit by bit, then continue to cook and whisk until thickened and smooth (about 4 minutes). Remove from the heat, season with a pinch of salt and pepper, then stir in the dijon, nutmeg, yeast flakes and cheese alternative, reserving a handful of the cheese for the top."
      },
      {
        "Step 4": "Spread around a quarter of the tomato sauce across the base of the lasagne dish, then top with a layer of lasagne sheets, breaking any pieces to fit, then repeat with another layer of sauce and pasta. For the third layer, spread another portion of the tomato sauce, followed by half of the white sauce. Top with pasta, then create a final layer of tomato sauce. Top with a final layer of pasta, then pour over the remaining white sauce. Scatter with the reserved cheese alternative and basil leaves."
      },
      {
        "Step 5": "Bake for 45-50 minutes or until a knife easily sinks through the layers in the middle of the lasagne. Leave to rest for at least 10 minutes before serving (lasagne always tastes better warm rather than hot)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/6.jpg"
  },
  {
    "id": "7",
    "title": "Vegan Victoria sponge cake",
    "difficulty": "Easy",
    "portion": "Serves 14-16",
    "time": "Hands-on time 25 min. Oven time 30 min",
    "description": "Light, springy and seriously moreish, this vegan Victoria sponge is packed with fresh lemon flavour, vegan buttercream and raspberry jam.",
    "ingredients": [
      "100ml sunflower oil, plus extra to grease",
      "100g ready-made apple purée (we used Clearspring)",
      "200ml unsweetened soy milk",
      "Finely grated zest 1 lemon, plus 1 tbsp juice",
      "175g caster sugar",
      "300g self-raising flour",
      "¾ tsp baking powder",
      "10g freeze-dried raspberry pieces",
      "70g plant butter (we used Flora)",
      "Finely grated zest 1 lemon, plus 1 tbsp juice",
      "140g icing sugar, sifted, plus extra to dust",
      "4 tbsp raspberry jam",
      "2 x 20cm loose bottomed cake tins"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/gas 4. Grease and line the cake tins with oil and baking paper. In a jug, whisk together the apple purée, soy milk, lemon zest and juice and oil. Set aside for 5 minutes."
      },
      {
        "Step 2": "In a separate bowl, sift together the sugar, flour, a pinch of salt and baking powder, then add the raspberry pieces, saving some to garnish. Pour in the milk mixture and stir until smooth, then divide the mixture between the cake tins and smooth the surface. Bake for 25-30 minutes until golden and springy, then transfer to a wire rack to cool completely."
      },
      {
        "Step 3": "To make the filling, beat the butter with the lemon zest and juice until creamy, then add the icing sugar and continue to beat until pale and fluffy."
      },
      {
        "Step 4": "To assemble, put one of the cakes upside-down on a serving platter, so the flattest side is facing the platter. Spread the top of it with the buttercream, then top with jam. Put the second cake on top (with the flattest side facing up) and dust with icing sugar. Decorate with the reserved raspberry pieces."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/7.jpg"
  },
  {
    "id": "8",
    "title": "Vegan quiche",
    "difficulty": "Easy",
    "portion": "Serves 6-8",
    "time": "Hands-on time 35 min. Oven time 1 hour 15 min",
    "description": "Vegan quiche? Yes, it’s possible – and very tasty, too. Tofu takes centre stage, creating the same set custard texture as traditional eggs, with plenty of umami-rich mushrooms, garlic, tahini and vegan cheese ensuring the flavour is on point.",
    "ingredients": [
      "1 tbsp olive oil, plus extra to grease",
      "250g plain flour, plus extra to dust",
      "125g salted plant butter (we used Flora salted plant butter), cubed",
      "150g mixed mushrooms, cut into bite-size chunks",
      "1 tbsp fresh thyme leaves",
      "280g pack extra-firm tofu (we used Tofoo), drained and roughly chopped",
      "150ml single soy cream alternative (we used Alpro)",
      "75ml unsweetened soy, almond or oat milk",
      "2 tsp roasted garlic purée",
      "Pinch ground turmeric",
      "4 tbsp instant mashed potato flakes (check they are dairy free)",
      "2 tbsp tahini paste",
      "100g smoked vegan cheese alterative, coarsely grated",
      "Large handful baby leaf spinach",
      "3 spring onions, white parts only, sliced",
      "23cm loose-bottomed deep tart tin"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 170°C fan/gas 5 and lightly oil the tart tin. Put the flour and plant butter in a food processor and pulse until it forms a breadcrumb-like texture. Add 4 tbsp cold water and pulse again until it forms a firm dough (you may need to add a little more water, 1 tsp at a time). Bring together into a ball."
      },
      {
        "Step 2": "Lightly flour your work surface and roll out the dough into a disc about 30cm in diameter. Brush off any excess flour then press into the greased tin. Using a pair of scissors, trim the excess pastry, leaving about 5mm of overhang, then press this over the edge of the tin. Use a fork to prick the pastry base all over, then line with a sheet of baking paper and fill with baking beans (or uncooked rice). Bake for 25 minutes, then remove from the oven and remove the paper and baking beans. Return to the oven for 15 minutes until the pastry is a light golden and feels sandy to the touch."
      },
      {
        "Step 3": "Meanwhile, heat the oil in a large frying pan over a medium-high heat, then add the mushrooms and thyme with a pinch of salt. Cook for 5-6 minutes, stirring often until deep golden. Remove from the heat."
      },
      {
        "Step 4": "In the food processor (there’s no need to clean it after making the pastry), whizz the tofu, soy cream, milk, garlic purée and turmeric until smooth. Season with lots of pepper, then add the potato flakes, tahini and two thirds of the cheese. Whizz until well combined."
      },
      {
        "Step 5": "Mix together the tofu purée with the baby spinach and half the mushrooms. Spoon into the pastry case, smoothing the top. Add the reserved cheese, spring onions and remaining mushrooms. Press them lightly into the filling. Bake for 35-40 minutes until the filling is golden and just set. Remove from the oven and leave to cool before serving."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/8.jpg"
  },
  {
    "id": "9",
    "title": "Vegan chocolate brownies",
    "difficulty": "Easy",
    "portion": "Makes 16",
    "time": "Hands-on time 20 min, plus cooling. Oven time 30 min",
    "description": "Traditional brownies rely on eggs to help them rise and create that gooey, fudgy texture – but plant-based superstar chia does the job just as well. Give these vegan brownies a try and see why they’re one of our favourite plant-based bakes.",
    "ingredients": [
      "325ml unsweetened soy, almond or oat milk",
      "1 tsp instant coffee powder",
      "1 tbsp ground chia seeds",
      "2 tsp vanilla extract",
      "1 tsp lemon juice",
      "150g vegan dark chocolate, around 70% cocoa solids",
      "5 tbsp olive oil",
      "160g self-raising flour",
      "35g cocoa powder",
      "½ tsp bicarbonate of soda",
      "175g caster sugar",
      "Icing sugar to dust",
      "20cm x 20cm square baking tin"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/gas 4 and line the tin with baking paper. In a jug, which together the soy milk, coffee, chia, vanilla and lemon juice. Set aside for 10 minutes."
      },
      {
        "Step 2": "Put the chocolate and oil in a heatproof bowl set over a pan of simmering water (ensure the base of the bowl doesn’t touch the water). Heat until melted, stirring occasionally, then set aside."
      },
      {
        "Step 3": "Sift the flour, cocoa powder, bicarbonate of soda and caster sugar together in a large bowl. Pour in the milk mixture and melted chocolate with a pinch of salt, then stir well until combined and pour into the lined tin."
      },
      {
        "Step 4": "Bake for 30-35 minutes until the brownies have set but still have a wobble in the middle. Allow to cool completely in the tin for at least an hour, or ideally overnight. Cut into squares and serve with a dusting of icing sugar."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/9.jpg"
  },
  {
    "id": "10",
    "title": "Vegan blueberry pancakes",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 25 min",
    "description": "A breakfast worth getting up for, these plant-based pancakes are light, fluffy and speckled with tangy blueberry flavour.",
    "ingredients": [
      "125g self-raising flour",
      "½ tsp bicarbonate of soda",
      "2 tbsp caster sugar",
      "150ml unsweetened soy, almond or oat milk",
      "½ tsp ground cinnamon",
      "½ tsp vanilla extract",
      "40g dried blueberries, chopped",
      "40g pecans, chopped, see Tips",
      "1½ tbsp sunflower oil",
      "Maple syrup, vegan yogurt, extra pecans and/or fresh blueberries to serve"
    ],
    "method": [
      {
        "Step 1": "Sift the flour, bicarbonate of soda and sugar into a mixing bowl. Add the rest of the ingredients (except the oil and toppings) and mix thoroughly."
      },
      {
        "Step 2": "Heat a large nonstick frying pan over a medium heat and add about ½ tbsp oil. Put dollops of the batter into the pan (about 2 tbsp at a time), spacing them at least 5cm apart."
      },
      {
        "Step 3": "Cook for 1 minute, until little bubbles appear on the surface, then use a spatula to flip them over and cook for a further minute until golden and the centres have puffed up a little. Continue cooking in batches until you’ve used all the oil and batter. Serve scattered and drizzled with the toppings."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/10.jpg"
  },
  {
    "id": "11",
    "title": "Vegan sausage casserole",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 1 hour",
    "description": "A one-pot beauty full of earthy root veg, creamy beans and the unmistakably wintry flavour of chestnuts, this vegan sausage casserole proves you don’t need meat to create something hearty, warming and seriously tasty.",
    "ingredients": [
      "2 tbsp sunflower oil",
      "8-12 vegan sausages",
      "1 large onion, roughly chopped",
      "3 large carrots, peeled and cut into 3cm chunks",
      "1 small (500g) swede or celeriac, peeled and cut into 2cm chunks",
      "3 celery sticks, thickly sliced, plus any celery leaves to garnish",
      "2 parsnips, peeled and cut into 2cm chunks",
      "2 bay leaves",
      "1½ tbsp chopped fresh herbs such as thyme, rosemary and/or sage",
      "1 tbsp tomato purée",
      "175ml vegan red wine",
      "1 tbsp wholegrain mustard",
      "Pinch freshly grated nutmeg",
      "1 vegetable stock cube",
      "400g tin butterbeans, rinsed and drained",
      "150g vacuum-packed cooked chestnuts"
    ],
    "method": [
      {
        "Step 1": "Heat half the oil in a large casserole pan over a medium heat. Add the sausages and cook for 8-10 minutes until nicely browned all over. Set aside."
      },
      {
        "Step 2": "Add the remaining oil to the pan with the onion. Cook for 5 minutes until beginning to soften then add the remaining veg and cook, covered, for 10 minutes, stirring occasionally. Stir in the bay leaves, chopped herbs and tomato purée and cook for another minute."
      },
      {
        "Step 3": "Pour in the wine, bring to the boil and simmer for a few minutes to reduce. Season with lots of pepper, the mustard and a grating of nutmeg, then add the stock cube and pour in 500ml boiling water. Don’t worry if it doesn’t completely cover the veg. Pop the lid back on and allow to simmer gently for 15 minutes."
      },
      {
        "Step 4": "Stir in the butterbeans and chestnuts, then nestle the sausages on top. Cover and cook for a further 12-15 minutes until everything is tender and the parsnips have started to break down and thicken the sauce. Add a splash more hot water if it’s too thick. Stir through the celery leaves and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/11.jpg"
  },
  {
    "id": "12",
    "title": "Air fryer potato wedges",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 10 min, air frying time 20 min",
    "description": "Use your air fryer to create absolutely knockout potato wedges and roasties that are fluffy inside and super-crisp on the outside. These mini ones are lightly spiced, just begging to be dipped into mayo or ketchup. Great for a party.",
    "ingredients": [
      "600g new potatoes",
      "2 tbsp rapeseed oil",
      "1 tbsp cornflour",
      "1 tsp sea salt",
      "1 tsp smoked paprika",
      "½ tsp garlic powder",
      "1 tsp freshly ground black pepper",
      "Ketchup, mayo or your dipping sauce of choice to serve"
    ],
    "method": [
      {
        "Step 1": "Quarter each potato lengthways, trying to keep each wedge an equal size (so any smaller potatoes might only need to be halved). Put the wedges in a bowl of cold water as you work, swishing the water around them to remove excess starch. Drain well and pat dry."
      },
      {
        "Step 2": "Mix the remaining ingredients together to make a loose paste, then spoon over the wedges. Give everything a toss to coat evenly, then set aside for 5 minutes."
      },
      {
        "Step 3": "Heat the air fryer to 200°C. Put the wedges in the air fryer basket, ideally in a single layer with room around each one for ultimate crispiness. Cook for 18-20 minutes, giving them a shake halfway. Serve with plenty of sauce for dipping."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/12.jpg"
  },
  {
    "id": "13",
    "title": "Potato, pineapple and cashew curry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 10 min. Simmering time 35 min",
    "description": "This vegan coconut curry is packed with filling potato and cashews. It’s sweet, sour and fragrant all at once. Serve as is, or with plain rice or flatbreads.",
    "ingredients": [
      "1 red onion, coarsely grated",
      "1 tbsp tomato purée",
      "1½ tbsp finely grated garlic",
      "1½ tbsp finely grated ginger",
      "1 tsp chilli powder or more to taste",
      "½ tsp ground turmeric",
      "½ tsp ground cumin",
      "½ tsp ground coriander",
      "Pinch ground cloves",
      "2 tbsp sunflower oil",
      "1 cinnamon stick",
      "400ml tin coconut milk (at least 55% coconut extract)",
      "500ml vegetable stock",
      "3 bay leaves",
      "1 lemongrass stalk, halved and bashed",
      "1 tbsp tamarind paste",
      "2 tbsp smooth peanut butter",
      "1 tsp soft light brown sugar",
      "150g cashews",
      "400g new potatoes, cut into 3cm chunks",
      "250g fresh pineapple, cut into bite-size chunks",
      "3-4 tbsp roughly chopped coriander"
    ],
    "method": [
      {
        "Step 1": "In a medium bowl, mix together the onion, tomato purée, garlic, ginger and ground spices to create a coarse paste. Heat the oil in a deep saucepan over a medium heat. Once hot, add the paste and the cinnamon stick and cook, stirring regularly, for 3-4 minutes until noticeable drier and just starting to catch on the bottom of the pan."
      },
      {
        "Step 2": "Add the coconut milk, vegetable stock, bay leaves, lemongrass, tamarind paste, peanut butter, sugar, cashews and 2 tsp salt. Bring to a simmer and cook, bubbling gently, for 10 minutes until the liquid has reduced and thickened slightly."
      },
      {
        "Step 3": "Add the potatoes then bring back to a simmer and cook for 15-20 minutes, or until the potatoes are tender. Stir in the pineapple, allow to come back to a simmer and cook for 2 more minutes. Serve sprinkled with coriander."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/13.jpg"
  },
  {
    "id": "14",
    "title": "Cauliflower with olives, preserved lemons and giant couscous",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min. Oven time 45 min",
    "description": "This fragrant vegan one-pot with cauliflower and giant couscous nods to a Moroccan classic. Perfect served as is for a light lunch or supper.",
    "ingredients": [
      "6 tbsp olive oil",
      "1 medium cauliflower, separated into small florets, rinsed in cold water and drained",
      "1 onion, finely sliced",
      "1 tbsp finely grated garlic",
      "1 small (50g) preserved lemon, pips discarded and finely chopped",
      "800ml vegetable stock, hot",
      "100g pitted green olives",
      "400g tin chickpeas, drained",
      "350g giant couscous",
      "3-4 tbsp chopped coriander",
      "Large pinch saffron",
      "1 tsp ground ginger",
      "½ tsp ground cumin",
      "½ tsp mild paprika",
      "¼-½ tsp cayenne pepper (depending on how spicy you like things)",
      "½ tsp ground turmeric"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C fan/gas 6. To make the spice paste, mix the spices in a small bowl with 2 tbsp water and set aside."
      },
      {
        "Step 2": "Heat 4 tbsp of the oil in a wide, shallow lidded pan over a low heat. Add the rinsed cauliflower florets along with a sprinkle of salt and cook, with the lid on, for 10-12 minutes, occasionally turning the florets over until caramelised. Transfer to a bowl, leaving as much of the oil in the pan as possible."
      },
      {
        "Step 3": "Increase the heat to medium and add the remaining oil. Add the onion and a pinch of salt and cook for 7-10 minutes until very soft but not starting to colour. Add the grated garlic and cook for 2 minutes more, then add the spice paste and chopped preserved lemon and cook for another minute. Add the stock, olives and chickpeas along with 1½ tsp salt. Now add the couscous, mixing well to ensure it is distributed evenly."
      },
      {
        "Step 4": "Lay the browned cauliflower florets on top. Bring to a simmer, then cover with the lid and put in the oven for 20 minutes until the cauliflower is totally tender, the couscous puffed up and most of the stock is absorbed. Give everything a good mix around, then sprinkle over the fresh coriander and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/14.jpg"
  },
  {
    "id": "15",
    "title": "Easy rhubarb cordial",
    "difficulty": "Easy",
    "portion": "Makes approx. 300ml (enough to serve 10)",
    "time": "Hands-on time 10 min, plus 2-3 days infusing. Simmering time 2 hours",
    "description": "This homemade rhubarb cordial highlights both the sweet and vegetal flavours of rhubarb. It’s a nice light, bright and spritzy drink that should go well with just about everything as it’s not too sweet. Follow our serving suggestion to make a simple rhubarb cocktail.",
    "ingredients": [
      "500g rhubarb, cut into 1cm slices",
      "200g granulated sugar",
      "300ml non-alcoholic spirit (Roberta uses Feragaia) or gin to serve (optional)",
      "Soda water to serve",
      "Rhubarb ribbons to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Put 300g of the rhubarb in a container and freeze. Put the remaining rhubarb in a jar or container with the sugar and 100ml water, giving it a good stir, then cover and put in the fridge for 2-3 days – it’s a long time to wait, but this will allow the sugar to dissolve and the rhubarb’s colour and flavour to infuse into the liquid."
      },
      {
        "Step 2": "After 2-3 days, put the frozen rhubarb in a metal bowl. Cover tightly with foil, then set it over a pan of simmering water. Leave the rhubarb to defrost and then cook like this for 2 hours – the freezing process breaks down the cells in the rhubarb which then allows the juice to leach out of it once heated."
      },
      {
        "Step 3": "Strain the juice from the frozen and cooked rhubarb into a sterilised jar or bottle, then strain the syrupy liquid from the other rhubarb into it, mixing the two liquids together. Keep in the fridge for up to a week. To serve, mix 30ml of the rhubarb cordial with 30ml of non-alcoholic spirit or gin, then top with soda water. Garnish with a ribbon of rhubarb (if you like)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/15.jpg"
  },
  {
    "id": "16",
    "title": "Paul A Young’s vegan chocolate truffles",
    "difficulty": "Easy",
    "portion": "Makes 40 truffles",
    "time": "Hands-on time 20 min, plus cooling and chilling",
    "description": "“These dark chocolate truffles taste wonderful – intense, rich and smooth without being too strong. And they contain no dairy at all, so what you get is the purity of the cocoa.” Chocolatier Paul A Young.",
    "ingredients": [
      "75g stevia or erythritol",
      "½ tsp sea salt",
      "200g dark chocolate (100% cocoa solids), chopped",
      "2 tsp extra-virgin olive oil",
      "100g cocoa powder"
    ],
    "method": [
      {
        "Step 1": "Put the sweetener and salt in a small saucepan with 200ml water (see Paul’s tips). Over a high heat, bring the mixture to a simmer. Put the chocolate in a heatproof bowl and pour over half the hot liquid. Whizz with a stick blender to emulsify, then add the rest of the liquid and whizz again until glossy."
      },
      {
        "Step 2": "Add the olive oil and whizz again, then allow the ganache to cool to room temperature before refrigerating for 1 hour."
      },
      {
        "Step 3": "Use a teaspoon to scoop out 40 pieces of ganache (see Paul’s tips). Scatter the cocoa powder over a high-sided tray and toss the truffles through to coat. Allow the truffles to fully set in the cocoa powder for 5 minutes, then gently shake in a sieve to release any loose powder."
      },
      {
        "Step 4": "The truffles will keep (chilled) for 5 days in an airtight container. Take them to someone’s house as a gift, or let them come to room temperature for 10 minutes, then enjoy."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/16.jpg"
  },
  {
    "id": "17",
    "title": "Vegan cabbage cacciatore",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min. Simmering time 30 min",
    "description": "Try this vegan cacciatore, a plant-based twist on the traditional Italian stew. Wedges of savoy cabbage absorb loads of rich, tomatoey flavour. It’s great served with crusty bread, or with rice or mashed potato if you want something more substantial.",
    "ingredients": [
      "1 medium savoy cabbage",
      "Olive oil to fry",
      "1 onion, sliced",
      "1 celery stick, sliced",
      "1 red pepper, deseeded and chopped into 2cm pieces",
      "4 garlic cloves, sliced",
      "2 tbsp tomato purée",
      "150ml red wine",
      "400g tin chopped tomatoes",
      "150g button mushrooms",
      "1 sprig of rosemary",
      "1 tsp dried oregano",
      "50g black olives",
      "1 tbsp capers",
      "Handful parsley or basil, chopped"
    ],
    "method": [
      {
        "Step 1": "Remove any damaged outer leaves from the cabbage, wash to remove any dirt and slice into 4 wedges. Put a large lidded saucepan over a high heat and, once smoking, add a drizzle of vegetable oil and the cabbage wedges, cut-side down. Cook for a few minutes until nicely charred, then flip to char the other cut side for another few minutes. Remove and set aside."
      },
      {
        "Step 2": "Add another drizzle of oil to the pan, turn down the heat to medium, then add the onions, celery, red pepper and garlic and cook for 6 minutes until soft. Stir in the tomato purée and cook for 2 minutes."
      },
      {
        "Step 3": "Nestle the cabbage wedges back into the pan then pour in the wine. Simmer until reduced by half (about 4 minutes) then add 200g water, the tinned tomatoes, mushrooms, rosemary, oregano, olives and capers and season with salt and pepper. Cover and simmer for 20 minutes, until the sauce has thickened slightly and you can insert a knife into the thick stem of a cabbage wedge with little resistance. Serve scattered with chopped parsley or basil."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/17.jpg"
  },
  {
    "id": "18",
    "title": "Vegan butternut squash risotto with millet",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 25 min. Simmering time 20 min",
    "description": "Butternut squash, sage and hazelnuts are an iconic flavour combination synonymous with the colder months and work really well in this simple, plant based dinner. Using millet – a gluten-free grass seed – instead of rice to create the risotto adds to the earthy, nutty flavours.",
    "ingredients": [
      "½ (500g) butternut squash",
      "Extra-virgin olive oil to drizzle and fry",
      "2 garlic cloves, sliced",
      "750ml of vegetable stock",
      "100g of millet, see Tips",
      "1 sage sprig, leaves picked",
      "2 tbsp hazelnuts, roughly chopped",
      "1 tsp white miso paste (make sure it’s gluten-free if you need it to be)",
      "Pinch nutritional yeast flakes",
      "2 tbsp oat fraiche (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 200°C fan/gas 7. Remove the peel from around half the squash, leaving the other half unpeeled, then chop into 2cm pieces, keeping the peeled and unpeeled pieces of squash separate. Put the unpeeled squash on a baking tray, toss with a little oil, season with salt and pepper and roast for 25 minutes."
      },
      {
        "Step 2": "Meanwhile, put a medium lidded saucepan over a medium heat with a dash of oil then add the peeled butternut squash and sliced garlic. Cook for 5 minutes until starting to soften, then pour in 250ml of the vegetable stock. Cover and simmer until soft (about 12–15 minutes)."
      },
      {
        "Step 3": "Bring the remaining 500ml vegetable stock to the boil in a separate saucepan, then add the millet. Turn the heat down and gently simmer for 15 minutes. Heat a drizzle of oil in a small frying pan and add the sage leaves and chopped hazelnuts. Cook for a few minutes until golden and crisp, then drain on kitchen paper."
      },
      {
        "Step 4": "Once the squash and garlic are soft, drain (reserving the stock) and transfer to a blender. Add the miso and nutritional yeast, then whizz into a smooth sauce, adding back in a splash of the stock as needed. Stir the butternut purée through the millet, taste for seasoning, then divide between bowls and top with the roasted squash, hazelnuts, sage leaves and a spoonful of oat fraiche (if using)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/18.jpg"
  },
  {
    "id": "19",
    "title": "Marmite parsnips with poppy seeds",
    "difficulty": "Easy",
    "portion": "Serves 4-6 as a side",
    "time": "Hands-on time 5 min. Oven time 45 min",
    "description": "Marmite’s deeply savoury flavour mellows out into something sweeter and almost smoky once heated, making it the perfect match for roast parsnips.",
    "ingredients": [
      "6 parsnips",
      "1 tbsp vegetable oil",
      "1 tbsp marmite",
      "1 tbsp poppy seeds"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/gas 4. Trim the tops of the parsnips then give them a good scrub under running water. Cut them lengthways into quarters (or sixths if they’re particularly big) and put them on a baking tray. Mix the oil with the marmite to loosen it slightly, then massage the mixture onto the wedges as evenly as possible."
      },
      {
        "Step 2": "Cook for 40 minutes, stirring every 10 minutes or so as the marmite can catch and burn (although a little charring and blackening is a good thing). Season with salt and pepper, then sprinkle over the poppy seeds."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/19.jpg"
  },
  {
    "id": "20",
    "title": "Vegan tart with miso, frangipane and onions",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "Hands-on time 40 min, plus chilling. Oven time 37-43 min.",
    "description": "This rich vegan tart makes a great Christmas main for a plant-based guest. Savoury frangipane is topped with kale and sweet, sticky miso onions.",
    "ingredients": [
      "1 tsp olive oil",
      "½ or 1 small red onion, finely sliced",
      "½ tsp brown rice miso paste",
      "1 tsp rice or white wine vinegar",
      "Pinch sugar",
      "Small handful kale",
      "1 tsp Free and Easy egg replacer (from Asda, Waitrose and Ocado)",
      "1 small garlic clove, crushed",
      "25g ground almonds",
      "50g plain flour, plus extra to dust",
      "1 tbsp olive oil",
      "10cm fluted tart tin",
      "Baking beans"
    ],
    "method": [
      {
        "Step 1": "Make the pastry first: put the flour in a bowl with a pinch of salt. Add the oil and rub it into the flour with your fingertips until it resembles breadcrumbs. Add 1 tbsp cold water, then use a butter knife to mix until it comes together. Lightly knead the dough into a ball, then roll out on a lightly floured worktop and use to line a 10cm fluted tart tin. Chill for 20 minutes."
      },
      {
        "Step 2": "Heat 1 tsp oil in a small pan over a medium heat. Add the sliced onion and a pinch of salt and cook gently for about 20 minutes, stirring occasionally. Stir in the miso paste, vinegar and sugar, then cook for another 5 minutes. Put the kale in a colander in the sink and pour over boiling water from the kettle to wilt it, then leave to drain and cool."
      },
      {
        "Step 3": "Heat the oven to 180°C fan/ gas 6. Line the pastry case with crumpled baking paper and fill with baking beans or uncooked rice. Bake on a tray for 12 minutes, then remove the paper and beans and bake for another 5-6 minutes until the pastry is crisp and lightly browned."
      },
      {
        "Step 4": "Meanwhile, put the egg replacer in a bowl with 1 tbsp water and whisk until light and fluffy. Use a metal spoon to fold in the garlic and ground almonds to make a fragipane, then season with a pinch of salt and some ground black pepper. Tip the frangipane into the tart case, then spoon over the miso onions and kale, pressing them in lightly. Bake for 20-25 minutes until the frangipane is puffed up and golden."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/20.jpg"
  },
  {
    "id": "21",
    "title": "Confit parsnip and carrot crumble",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "Hands-on time 15 min. Oven time 1 hour 10 min",
    "description": "Got a vegan guest for Christmas? This vegetable crumble for one makes a hearty and impressive Christmas main. Slow-cooked root veg and beans sit in a creamy, plant-based sauce, finished with a flavoursome crumble topping.",
    "ingredients": [
      "1 carrot, cut into 3cm chunks",
      "1 parsnip, cut into 3cm chunks",
      "1 star anise",
      "1 small bay leaf",
      "1 garlic clove, peeled but left whole",
      "1 strip orange peel",
      "200-300ml olive oil",
      "1 slice seeded bread (preferably a crust)",
      "2 tbsp rolled oats",
      "1 tbsp nutritional yeast flakes",
      "100g cooked haricot or cannellini beans",
      "2 tbsp oat fraiche (we used Oatly)",
      "Individual pie or oven dish"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/ gas 4. First, confit the veg: put the carrot, parsnip, star anise, bay, garlic and orange peel in a small oven dish, then pour over enough oil to submerge everything. Cover tightly with foil and put in the oven for 35-40 minutes until the veg is completely tender when pierced with a knife."
      },
      {
        "Step 2": "Meanwhile, whizz the bread to a coarse crumb in a food processor (you could also tear or chop it into small chunks). Tip into a bowl, then stir in the oats and half the nutritional yeast. Season with a pinch of salt and pepper and set aside."
      },
      {
        "Step 3": "Scoop the confit veg out of the oil and into a bowl (reserve the oil; see Don’t Waste It). Crush the confit garlic into a paste with a fork, then stir it into the veg along with the beans, oat fraiche and remaining nutritional yeast. Season, then tip into an individual oven or pie dish. Add 3 tbsp of the infused oil to the bread mixture and stir to combine. Use this to top the vegetable filling. Cover and chill or freeze until ready to cook (see Make Ahead)."
      },
      {
        "Step 4": "When ready to cook, heat the oven to 180°C fan/gas 6. Bake the crumble on a tray for 30 minutes (or 40 minutes if cooking from frozen) until golden and crisp. Leave to stand for 5-10 minutes before serving."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/21.jpg"
  },
  {
    "id": "22",
    "title": "Caramelised onion, pear and chestnut stuffing",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 25 min. Oven time 15-20 min",
    "description": "Get ready for Christmas with this freeze-ahead chestnut stuffing recipe from Chantelle Nicholson. Silky, caramelised onions combined with chestnuts, pears and bread make the ultimate comforting stuffing (and it’s vegan, too).",
    "ingredients": [
      "50ml rapeseed oil, plus extra to grease and drizzle",
      "2 onions, halved and finely sliced",
      "2 pears, cored",
      "½ bunch thyme, leaves picked, plus extra to serve",
      "250g bread, ideally stale, whizzed into breadcrumbs",
      "8 vacuum-packed cooked chestnuts, chopped, plus extra to serve",
      "Whole nutmeg for grating"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C fan/ gas 6. Heat the oil in a non-stick frying pan over a medium heat. Once hot, add the onions and a big pinch of salt and fry for 15-20 minutes, stirring occasionally, until a deep golden colour."
      },
      {
        "Step 2": "Cut 5-6 long thin slices off one of the pears, then chop the rest. Add the chopped pears and thyme leaves to the pan and cook for 10 minutes more, then transfer to a bowl and mix in the breadcrumbs and chestnuts. Season to taste with salt, pepper and a good grating of nutmeg."
      },
      {
        "Step 3": "Grease a small baking dish or tray with oil, then transfer the stuffing into it, in an even layer. Lay the pear slices on top, scatter over a few more chopped chestnuts and thyme leaves, drizzle with a little more oil, then bake for 15-20 minutes."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/22.jpg"
  },
  {
    "id": "23",
    "title": "Ultimate vegan gravy",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 30 min. Oven time 40 min, plus simmering time 1 hour.",
    "description": "Chef Harriet Mansell has created the ultimate vegan gravy recipe, with all the depth and umami of its meaty counterpart. The gravy makes the most of roast and fried alliums, smoked oil and umami-rich miso and mushrooms, but what really elevates it is the roasted yeast, adding an intensity even  meaty gravies struggles to achieve.",
    "ingredients": [
      "16 shallots",
      "2 leeks, cleaned",
      "2 garlic bulbs, cloves separated and peeled",
      "Rapeseed oil to fry and drizzle",
      "250g fresh yeast (see Know How)",
      "2 tbsp smoked rapeseed oil (see tips)",
      "250g white mushrooms, sliced",
      "1 tsp white miso paste (make sure it’s gluten-free if needed)",
      "Pinch mixed spice",
      "Splash ruby port",
      "Splash cider brandy (optional)",
      "1 tbsp balsamic vinegar",
      "4 celery sticks, roughly chopped",
      "Handful dried mushrooms, roughly chopped",
      "½ bunch thyme",
      "½ bunch chives",
      "Handful chervil or parsley",
      "Pinch freshly grated nutmeg",
      "1 tbsp cornflour, mixed with 1 tbsp water (optional"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C fan/gas 4. Divide the shallots, leeks and garlic into two even piles. Roughly chop one pile and finely slice the other. Add the roughly chopped veg onto a baking tray, drizzle with oil and season with salt. Put in the oven to roast for 40 minutes until a deep golden brown."
      },
      {
        "Step 2": "Meanwhile, line a separate large baking tray with baking paper, then crumble the fresh yeast into it, drizzling over half the smoked rapeseed oil. Put in the oven and cook for 30-40 minutes, stirring occasionally. The yeast will initially melt but will then begin to brown and form a crust (it looks a little like crispy chicken skin)."
      },
      {
        "Step 3": "While the veg and yeast roast, add a generous drizzle of oil to a large saucepan over a medium heat. Once hot, add the finely sliced vegetables and cook for 15-20 minutes, stirring occasionally, until golden and caramelised. Add half the mushrooms and continue cooking until they release their liquid and begin to colour too."
      },
      {
        "Step 4": "Once the mushrooms and sliced veg are cooked, put the roasted vegetables in the saucepan with the fried veg. Pour in just enough water to cover, then add the miso, mixed spice, port, cider brandy (if using), balsamic vinegar and the remaining smoked rapeseed oil. Bring to a simmer with the lid on, then add the roasted yeast, which will thicken the liquid and make it look creamy. Simmer (covered) for 30 minutes to get as much flavour out of the solids into the liquid as you can."
      },
      {
        "Step 5": "Add the remaining mushrooms, half the celery, the dried mushrooms and half the thyme sprigs. Cover and continue to simmer for another 20-30 minutes."
      },
      {
        "Step 6": "Add the remaining celery and thyme along with the chives, chervil (or parsley) and the nutmeg, then remove from the heat. Give the gravy a stir, then season to taste with salt and pepper. Strain through a fine sieve, squishing the solids with a spoon to get as much liquid/flavour out of them as possible, either into a gravy jug (if serving right away) or a lidded container to cool and then keep in the fridge or freezer. If you like your gravy thicker, you can whisk in the slaked cornflour whilst the (strained) gravy is still very hot."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/23.jpg"
  },
  {
    "id": "24",
    "title": "Leek and watercress risotto",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "This verdant leek risotto is kept fresh, light and peppery thanks to a simple watercress purée stirred through right before serving. Replacing the usual butter with oil also keeps this dish vegan.",
    "ingredients": [
      "2 tbsp olive oil",
      "2 large leeks, trimmed and finely sliced",
      "1 litre vegetable stock",
      "80g watercress",
      "40g spinach leaves",
      "Bunch (30g) parsley",
      "30g salted almonds, plus extra, roughly chopped, to garnish",
      "5 tbsp extra-virgin olive oil, plus extra to serve",
      "Juice ½ lemon",
      "200g risotto rice (arborio or carnaroli)",
      "100ml white wine"
    ],
    "method": [
      {
        "Step 1": "Heat the olive oil in a large saucepan over a medium heat then add the leeks and a pinch of salt. Cook for 6 minutes, stirring occasionally, until softened."
      },
      {
        "Step 2": "Meanwhile, pour the stock into a separate saucepan and heat until barely simmering. Set aside a few watercress sprigs to garnish, then put the rest of it in a food processor with the spinach, parsley, almonds and extra-virgin olive oil. Whizz until a coarse paste forms, scraping down the sides as needed. Add a spoonful of stock to loosen, then stir in the lemon juice. Set aside."
      },
      {
        "Step 3": "Add the rice to the leeks, turn up the heat slightly and stir to coat the rice in the oil and toast the grains lightly. Pour in the wine, simmer and stir until almost completely reduced, then add a ladleful of stock. Constantly stir the rice until it has absorbed all the stock, then repeat this process, a ladleful at a time, until the rice is tender but with a slight bite in the centre. You may not need to use all the stock – start tasting when you have around 200ml of stock left. This should take around 15-20 minutes."
      },
      {
        "Step 4": "Tip the green puree into the rice, stir to incorporate, then remove from the heat and allow to stand for 5 minutes. Season to taste, divide between serving bowls and garnish with watercress sprigs, almonds and an extra drizzle of olive oil."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/24.jpg"
  },
  {
    "id": "25",
    "title": "Pickled bramble martini",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "Hands on time 5 min, plus pickling time.",
    "description": "This pickled bramble martini is a hedgerow treat. Quick pickle blackberries in wine vinegar, then add a little of the liquor to a martini for a taste of autumn.",
    "ingredients": [
      "10 blackberries",
      "1 tsp caster sugar",
      "1 tsp salt",
      "4 tbsp white wine vinegar",
      "Dash of dry vermouth",
      "60ml gin",
      "Thyme sprig (to serve)",
      "Martini glass or coupe"
    ],
    "method": [
      {
        "Step 1": "Put the blackberries in a small bowl. In another small bowl, combine the caster sugar, salt and white wine vinegar, then pour it over the fruit. Leave for at least 15 minutes."
      },
      {
        "Step 2": "Fill a cocktail shaker with ice, add a dash of dry vermouth, stir, then drain away almost all the liquid (or leave it in if you prefer your martini ‘wet’). Pour in the gin, stir well, then strain into a martini glass or coupe."
      },
      {
        "Step 3": "Add 1 tbsp of the pickling liquid, then garnish with one of the pickled blackberries and a thyme sprig."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/25.jpg"
  },
  {
    "id": "26",
    "title": "The Dusty Knuckle’s sourdough starter",
    "difficulty": "Easy",
    "portion": "Makes 1 healthy sourdough starter",
    "time": "Hands-on time about 20 min, plus 7 days fermenting",
    "description": "Make a healthy and lively sourdough starter from scratch with our step-by-step starter recipe from The Dusty Knuckle Bakery. This stiff starter is perfect for making the bakery’s linseed baguettes.",
    "ingredients": [
      "Wholewheat flour",
      "Water",
      "Digital scales",
      "Jam jar with a loose-fitting (not airtight) lid"
    ],
    "method": [
      {
        "Step 1": "DAY 1 Mix 40g wholewheat flour and 40g water in a clean jam jar until there are no dry bits. Put on the lid. Remember the rules around temperature here, and use the water temperature to counter your room temperature (see Know How)."
      },
      {
        "Step 2": "DAY 2 Repeat DAY 1, adding 40g wholewheat flour and 40g water."
      },
      {
        "Step 3": " DAY 3 Repeat DAY 1, adding 40g wholewheat flour and 40g water. By the end of DAY 3 you will have 240g starter in your jar."
      },
      {
        "Step 4": "DAY 4 You should start seeing some bubbles appear and there should be a nice yogurty, slightly acidic smell. Now to make the starter stiff. Discard all but 1 tbsp starter (see Know How) and feed the remaining starter with 200g strong white bread flour and 150g water. This may be harder to mix in the jar – you can always scoop it out and mix it by hand in a bowl."
      },
      {
        "Step 5": "DAY 5 Discard 200g (leaving you with 150g) and feed the remaining starter with 180g strong white bread flour and 120g water."
      },
      {
        "Step 6": "Leave alone for DAY 6"
      },
      {
        "Step 7": "DAY 7 Your starter is now a week old! It should grow in size slowly over the day, and when you come to feed it, it should have grown noticeably in the jar. It should be smelling acidic and delicious. You are now ready to make bread."
      },
      {
        "Step 8": "You have two options for maintaining your starter. If you’re not planning to bake regularly, put your starter in the fridge and give it a feed (DAY 5 instructions) once a week. You’ll need to take it out of the fridge 3 days before you want to make bread, feeding it daily to bring it back to life."
      },
      {
        "Step 9": "Alternatively, keep the starter out of the fridge, but feed it daily (DAY 5 instructions). You’ll need to bake regularly, every day or whenever you want! If you miss a feed, don’t panic – give it a few days of feeding to get it back to normal."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/26.jpg"
  },
  {
    "id": "27",
    "title": "The Dusty Knuckle’s linseed baguettes",
    "difficulty": "A challenge",
    "portion": "Makes 4 baguettes, each serving 2",
    "time": "Hands-on time 1 hour, plus a week to make the starter, 8-10 hours resting, overnight chilling and 1 hour proving. Oven time 18 min",
    "description": "Learn how to make The Dusty Knuckle’s crunchy-on-the-outside, chewy-on-the-inside linseed baguettes with a step-by-step recipe from the acclaimed London bakery.",
    "ingredients": [
      "100g wholemeal flour",
      "375g strong white bread flour, plus extra to dust",
      "370g warm water (see Know How)",
      "135g stiff starter",
      "15g fine sea salt",
      "100g cooked porridge, overnight oats, cooked bulgur wheat or cooked rice (see tips)",
      "100g soaked golden or brown linseeds (see Make Ahead)",
      "Vegetable oil for greasing",
      "Rice flour to dust",
      "Digital thermometer",
      "Dough scraper",
      "Baking stone"
    ],
    "method": [
      {
        "Step 1": "Mix the flours and 300g of the warm water in a bowl until there are no wet or dry bits. Scrape down the bowl, cover, then set aside for 2-4 hours to allow your flour to hydrate fully."
      },
      {
        "Step 2": "Weigh out your starter and add it with the remaining 70g warm water to the flour bowl. Squish, squeeze and squelch your dough. It will go weird and slimy, but don’t worry – this is normal. When it’s all combined, scrape down the bowl, cover it and set aside for 30 minutes. Add your salt to the bowl and mix this through, squeezing the dough again until the salt is totally incorporated. Add the porridge and soaked linseeds and work these into the dough mix – you want to give this a good 8 minutes. Use a scraper or your hands to get under the dough and lift it up, then lightly oil the inside of the bowl. Cover the bowl with a lid or a clean tea towel and leave it somewhere warm for 1 hour. Take a mental picture of how much the dough fills the bowl – by the end, you want it to have almost doubled."
      },
      {
        "Step 3": "For the next 4 hours you are going to give the dough a ‘fold’ every hour. This just means grabbing the edge of the dough with a wet hand, stretching it up as high as it will go and folding it over on itself, working around the bowl as many times as the dough will let you – until it feels tight and as if it might tear. Over 4 hours, this means you’ll have given the dough 3 folds. With each fold, you should be starting to see more life in the dough. This process is what we call the bulk fermentation and it’s where the magic is happening."
      },
      {
        "Step 4": "After the last fold, let the dough rest for a final 30(ish) minutes. You should have a shiny, coherent, strong dough that wobbles when you carefully prod it. If it feels wet and sticky, give it another fold and leave it for a further 30 minutes. If it feels strong, just not that lively, leave out the extra fold but still give it more resting time. This is the fermentation period, and you can’t really rush it – just let it do its thing. You’ll get a feel for this sweet spot the more you bake. Put the dough in the fridge overnight. This will help develop the flavour, let it rest and get lovely and strong. (It can stay in the fridge for up to 24 hours.)"
      },
      {
        "Step 5": "The next day, gently tip the dough out onto a flour-dusted worktop and, without disturbing it much, cut it into 4 quarters – use a dough scraper to do this if you have one. With each quarter of dough, fold the points to the centre to make a very rough, long rectangle. You need to be gentle, but if you’re slow and too careful the dough will stick to your fingers and it’ll quickly get stressful. Flip the dough so the seams are facing down and the top is smooth, then let it rest for 30 minutes to come up to room temperature."
      },
      {
        "Step 6": "Now flip the dough back over again so the seams are facing up – you want the rectangle to be oriented so the longest side is horizontal in front of you. Grab the top edge and fold it into the middle of the dough, then grab the bottom edge and fold it over to meet the new top edge. Gently seal along this length with your thumbs. Roll the dough over so the seam is on the bottom. Next, cup both hands over the dough, your fingers resting on the work surface at the top and the heel of your hand on the surface at the bottom. Roll the dough, working your hands away from each other, so you’re lengthening the baguette Push your hands down harder as you reach the ends so you get that lovely pointed shape. The trick is not to go over it too many times – once is ideal."
      },
      {
        "Step 7": "Heavily dust a tea towel with rice flour and lay it in a shallow baking tray or something of a similar shape so it just hangs over one side and there’s plenty left on the other. Lay your first baguette seam-side down along the edge of the tray with a little overhang, so the side supports it. Pull a fold of the tea towel up around it so it’s cradled on both sides. Put another baguette alongside and repeat. Do this for all 4 baguettes, nestling them against each other, then let them rest for 1 hour."
      },
      {
        "Step 8": "Heat your oven to 220°C fan/gas 9 or as hot as it will go, and boil a kettle. Put a baking tin in the bottom of your oven and a baking sheet (or a baking stone, if you have one) on the middle shelf to heat up. Cut 4 slightly larger than baguette-size pieces of baking paper and flip out the baguettes onto them with the seams facing up. These will act as a score – the loaf will open through the seam. The outcome is quite a rustic look, far from your traditional French stick."
      },
      {
        "Step 9": "Working as quickly as you can, open the oven, take out your hot baking sheet or stone and use the baking paper strips as little hammocks to transfer each baguette onto the baking sheet/ stone. Pour some boiling water into the baking tin at the bottom and put the baguettes in the middle of the oven. Bake for 18 minutes or until lovely and dark."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/27.jpg"
  },
  {
    "id": "28",
    "title": "Runner bean and apple chutney",
    "difficulty": "Easy",
    "portion": "Makes about 1.5-1.75 litres",
    "time": "Hands-on time 15 min",
    "description": "Transform a glut of late summer veg into Gill Meller’s runner bean and apple chutney. This tangy pickle will last you well into winter. Root, Stem, Leaf, Flower by Gill Meller is out now (£27, Hardie Grant).",
    "ingredients": [
      "500g runner beans, de-stringed and cut into 1cm lengths",
      "1kg bramley apples, peeled, quartered, cored and roughly chopped",
      "500g ripe tomatoes, roughly chopped",
      "2 onions, roughly chopped",
      "150g sultanas",
      "2 tsp coriander seeds, bashed",
      "1 tsp caraway seeds, bashed",
      "2 green cardamom pods, bashed",
      "350g light brown soft sugar",
      "500ml cider vinegar",
      "1 tsp fine sea salt",
      "Preserving pan or large non-reactive saucepan; sterilised preserving jars",
      "Pestle and mortar for bashing"
    ],
    "method": [
      {
        "Step 1": "Put all the ingredients in a preserving pan over a medium heat (see Easy Swaps). Slowly bring the mixture up to a simmer, stirring regularly until the sugar has dissolved."
      },
      {
        "Step 2": "Reduce the heat and gently simmer the chutney for 1½–2 hours, stirring every so often to stop it sticking to the base of the pan. The chutney will thicken as it cooks; you’ll know it’s ready when you can draw a wooden spoon across the bottom of the pan and it leaves a path behind it for a few seconds before the chutney collapses back down and covers the base. Be extra-careful it doesn’t catch and burn at this point."
      },
      {
        "Step 3": "Remove the chutney from the heat and spoon carefully into jars, still warm from sterilising (see Know-how). Seal with the lids and cool. Store in a cool, dark place for several months before eating – although you can eat it earlier, if you like. Once open, store in the fridge and use within a month."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/28.jpg"
  },
  {
    "id": "29",
    "title": "Pumpkin curry",
    "difficulty": "Easy",
    "portion": "Serves 4 as a main or 6 as a side",
    "time": "Hands-on time 15 min, simmering time 20 min",
    "description": "Gourds, squashes and pumpkins of all shapes and sizes are used in dishes across the Indian subcontinent. This colourful pumpkin curry, full of mustard seeds, curry leaves, tamarind and jaggery (cane sugar), takes inspiration from the flavours of southern India.",
    "ingredients": [
      "3 tbsp mustard oil or vegetable oil",
      "1 tbsp black mustard seeds",
      "1 tsp cumin seeds",
      "10 curry leaves, ideally fresh (see Tips)",
      "1 onion, finely chopped",
      "2 green chillies, finely chopped",
      "2 tbsp ginger-garlic paste",
      "½ tsp ground turmeric",
      "1 tsp kashmiri chilli powder",
      "1 tsp ground coriander",
      "800g pumpkin, peeled, deseeded and cut into 5cm chunks",
      "1 tbsp tamarind paste",
      "½ tbsp jaggery, grated, or light brown sugar",
      "Bunch coriander, finely chopped"
    ],
    "method": [
      {
        "Step 1": "Pour the oil into a large lidded saucepan and put over a medium heat. Once shimmering hot, add the mustard seeds, cumin seeds and curry leaves and cook for 30 seconds or until the seeds begin to crackle."
      },
      {
        "Step 2": "Add the onion and green chillies with a pinch of salt, cook for 8 minutes, stirring regularly, then add the ginger-garlic paste and cook for another 2 minutes. Add the turmeric, chilli powder and coriander, stir to combine, then add the pumpkin. Stir to coat the pumpkin in the onions and spices, then add 300ml water and the tamarind paste and cover. Bring to a simmer and cook for 8-10 minutes, stirring regularly, or until the pumpkin is tender. Depending on the type, size and variety of pumpkin you’re using, it may take a little longer – you want the pumpkin to be soft but still holding its shape. If the mixture begins to stick, add a splash more water, although bear in mind this is quite a dry dish without much sauce."
      },
      {
        "Step 3": "Add the jaggery (or brown sugar), stir to combine, then stir through half the coriander. Serve with the rest of the coriander sprinkled on top with rice, chapatis or other Indian dishes as part of a larger spread."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/29.jpg"
  },
  {
    "id": "30",
    "title": "Coconut dhal and chapatis",
    "difficulty": "Easy",
    "portion": "Serves 6, with 3 chapatis per person",
    "time": "Hands-on time 45 min. Cooking time 45 min",
    "description": "Nearly all the ingredients for this fragrant vegan coconut dhal come from the store cupboard. Serve with homemade chapatis for a filling, budget dinner.",
    "ingredients": [
      "250g red lentils",
      "2 tbsp vegetable oil",
      "2 medium onions, finely chopped",
      "4 garlic cloves, crushed",
      "½ tsp dried chilli flakes, or more to taste",
      "2 tsp mustard seeds (optional)",
      "2 tsp ground cumin",
      "2 tsp ground coriander",
      "1 tsp ground turmeric",
      "1 tsp ground ginger",
      "400g tin chopped tomatoes",
      "400g tin coconut milk",
      "1 tbsp tamarind paste",
      "250g frozen spinach (optional)",
      "Juice ½ lemon or lime",
      "500g chapati or wholemeal flour, plus extra to dust",
      "1 tsp salt",
      "250-300ml water",
      "Vegetable oil or ghee for frying"
    ],
    "method": [
      {
        "Step 1": "Rinse the lentils thoroughly in cold water and leave to drain in a sieve until ready to use. Heat the oil in a large saucepan and add the onions. Stir intermittently over a low-medium heat for 10-15 minutes, or until the onions are soft and golden."
      },
      {
        "Step 2": "Add the garlic and spices and cook, stirring, for a few minutes, until you hear the mustard seeds pop and the spices have cooked out – take care not to burn them. Add the red lentils and stir them round to coat them in the oil, before adding the tomatoes and coconut milk. Swish round the empty tins with about 100ml water and add the water to the pan."
      },
      {
        "Step 3": "Season generously with salt, then stir in the tamarind paste and frozen spinach (if using) and leave to simmer gently for about 25-30 minutes, stirring intermittently, or until the lentils are soft. You may need to add more water."
      },
      {
        "Step 4": "Meanwhile, make the chapatis. Mix the flour and salt in a large bowl. Add the water, a little at a time, mixing it in with your fingers as you go, until the mixture comes together to form a dough. Knead the dough for a few minutes in the bowl and leave to rest for a few minutes more."
      },
      {
        "Step 5": "On a work surface lightly dusted with flour, roll the dough into a sausage shape and divide it into 18 pieces. Flatten each piece of dough with the heel of your hand, before rolling it very thinly into discs, roughly 15cm in diameter. Add more flour to prevent the dough sticking as needed."
      },
      {
        "Step 6": "Heat a sparing slick of oil or ghee in a frying pan over a medium-high heat. Fry a chapatti for about 30 seconds on each side, or until it puffs up and dark spots appear on the surface. Repeat with the remaining chapatis. Serve alongside the dal, squeezing over the lemon or lime juice."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/30.jpg"
  },
  {
    "id": "31",
    "title": "British plum umeboshi",
    "difficulty": "Easy",
    "portion": "Makes around 500g",
    "time": "Hands-on time 20 min, plus 2 weeks fermenting",
    "description": "Umeboshi are Japanese pickled ume plums (actually a type of apricot), which give a complex, salty-sweet-sour kick to dishes. Can’t get hold of ume? Try our easy British plum umeboshi recipe – it’s the perfect intro to pickling fruit.",
    "ingredients": [
      "500g small firm plums",
      "150ml vodka",
      "30-50g sea salt flakes",
      "1 litre jar"
    ],
    "method": [
      {
        "Step 1": "Inspect your plums and set aside any that are bruised, split or withered for another recipe – you need fruit in peak condition. Discard any stalks, rinse the fruit in water, then leave to dry."
      },
      {
        "Step 2": "Sterilise a 1 litre jar (see Know How) and set aside. Pour the vodka into a small bowl. Ensure your hands, knife and chopping board are very clean, then, one by one, dip the plums in the vodka and wipe dry with kitchen paper – this gets rid of any bacteria remaining on the surface of the plums. (The vodka is fine to pour back in the bottle and use as normal.) Halve the plums and remove the stones."
      },
      {
        "Step 3": "Weigh the plum halves and work out 10% of this weight in salt – for example, if you have 400g plum halves, you’ll need 40g salt. Beginning with a layer of salt, layer the plums into the sterilised jar, sprinkling each layer with more salt. End with a final layer of salt, then seal the jar."
      },
      {
        "Step 4": "Leave the plums to ferment in a cool, dark place for 2 weeks, turning the jar upside down from time to time, and opening and closing the lid every few days (this ensures the salt is evenly dispersed and that any built-up gases can escape). The salt should draw out the juice from the plums to create a brine. After 2 weeks, the plums are ready to use. Once opened, keep them in the fridge and use within 3 months."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/31.jpg"
  },
  {
    "id": "32",
    "title": "Plum and vanilla jam",
    "difficulty": "Easy",
    "portion": "Makes 1.5kg jam",
    "time": "Hands-on time 30 min",
    "description": "This speedy plum jam with hints of vanilla and cinnamon uses a clever time-saving trick in the cooking process. Delicious, fragrant plum preserve in a hurry? Yes please.",
    "ingredients": [
      "500g glucose syrup",
      "500g caster sugar",
      "150ml water",
      "1 tsp salt",
      "2 cinnamon sticks",
      "2 star anise",
      "1 vanilla pod, split lengthways",
      "Pared zest 1 orange",
      "1.5kg plums, halved and pitted",
      "1 tbsp liquid pectin (from most large supermarkets)",
      "15g food-grade citric acid (see Know How) or 5 tbsp freshly squeezed lemon juice",
      "Sugar/probe thermometer",
      "Sterilised jars and lids",
      "Preserving pan"
    ],
    "method": [
      {
        "Step 1": "Put the glucose, sugar, water, salt, cinnamon, star anise, vanilla pod and orange zest in a large preserving pan (or a large, deep heavy-based saucepan). Put over a medium-high heat and bring to the boil, stirring occasionally, to dissolve the sugar and create a spiced syrup. Use a thermometer to keep an eye on the temperature."
      },
      {
        "Step 2": "As the syrup reaches 140°C it will start to turn golden. As soon as it hits that temperature, very carefully add the plums (don’t tip them in all at once, otherwise you risk splashing boiling syrup on yourself). The syrup will harden but don’t worry – just continue to heat until it remelts, stirring gently to coax it along (but trying not to break up the plums too much). Continue to cook over a high heat for around 10 minutes or until the syrup is liquid, bubbling, bright purple and returns to 120°C."
      },
      {
        "Step 3": "Stir in the pectin and citric acid (or lemon juice), then remove from the heat. Leave to cool slightly, then lift out and discard the cinnamon, star anise, orange peel and vanilla pod. Decant into sterilised jars, then seal (see Know How)."
      },
      {
        "Step 4": "Store the jars in the fridge for up to 4 weeks (see Know How). Once opened, eat within 2 weeks."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/32.jpg"
  },
  {
    "id": "33",
    "title": "Smoky jollof rice",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 15 min. Simmering time 1 hour 20 min",
    "description": "Jollof rice gets a smoky flavour boost in this delicious jollof recipe from Lerato Umah-Shaylor. One helping is never enough.",
    "ingredients": [
      "300g long-grain or basmati rice, thoroughly rinsed",
      "250-400ml vegetable or chicken stock",
      "2 tsp fine sea salt",
      "2 plantains, sliced and fried, to serve (optional)",
      "6 medium vine-ripened tomatoes or a 400g tin plum tomatoes",
      "2-3 romano or red peppers, deseeded and roughly chopped",
      "1 large onion, roughly chopped",
      "5cm piece of ginger, peeled and roughly chopped",
      "5 garlic cloves, roughly chopped",
      "1-2 red or yellow scotch bonnet peppers, stalks removed and roughly chopped (wear gloves), or pierced and left whole",
      "90ml coconut, rapeseed or vegetable oil",
      "1 small red onion, finely sliced",
      "2 tbsp tomato puree",
      "2 tsp curry powder",
      "2 tsp smoked paprika",
      "1 bay leaf",
      "1 tsp dried thyme",
      "4-6 thyme sprigs, some thyme leaves picked and kept for garnish",
      "Food processor"
    ],
    "method": [
      {
        "Step 1": "Put all the puree ingredients in a food processor, except the scotch bonnets, if using whole, and whizz into a thick and aromatic puree."
      },
      {
        "Step 2": "Put the oil in a wide large saucepan, for which you have a tightly fitting lid, and set over a medium heat. Add the red onion and a pinch of fine sea salt. Cook for 15 minutes, stirring often, until softened and golden. If it starts to get dry, add a little splash of water to prevent the onion from burning."
      },
      {
        "Step 3": "Stir in the tomato puree and cook for 2-3 minutes, until the puree starts to separate. Add the spices and herbs and cook for 2 minutes, stirring continuously."
      },
      {
        "Step 4": "Gently pour in the blended puree, stirring well, then cover and cook for up 20 25 minutes, until the puree is reduced to a drier sauce. Keep a close eye on it and stir occasionally."
      },
      {
        "Step 5": "Add the rice and stock (about 250ml for basmati rice and up to 400ml for long-grain rice), ensuring there is enough water to just submerge the rice. Season with the fine sea salt and stir just once. Add the scotch bonnets, if using whole. Bring to a boil, then reduce the heat, cover and simmer over a low-medium heat for up to 30 minutes. The sauce must be visibly simmering to ensure the rice cooks properly."
      },
      {
        "Step 6": "Once the rice is cooked, remove the pan from the heat and leave covered to steam for a few minutes. Fluff with a fork, scatter over the reserved thyme leaves and enjoy your wonderful creation with a fresh salad and/or fried plantains, because jollof and plantains are a match made in heaven."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/33.jpg"
  },
  {
    "id": "34",
    "title": "Pide dough",
    "difficulty": "Easy",
    "portion": "Makes 3 x 150g dough balls",
    "time": "Hands-on time 15 min, plus about 3 hours resting and rising",
    "description": "Josh Katz’s pide dough recipe makes three balls of springy dough. Use the dough to make pide (Turkish-style oval pizzas), pizzas or flatbreads.",
    "ingredients": [
      "5g fresh yeast",
      "35ml warm (26-29°C) water",
      "½ tsp runny honey",
      "175g strong bread flour",
      "125g ‘00’ flour",
      "3g fine salt",
      "½ tbsp olive oil, plus extra to grease",
      "135ml ice-cold water",
      "Stand mixer with dough hook"
    ],
    "method": [
      {
        "Step 1": "Combine the yeast, warm water and honey in a bowl and whisk to dissolve the yeast. Set aside for 10 minutes to give the yeast time to activate. The mixture should start to bubble and foam – if it doesn’t, discard the yeast and start again with a different batch."
      },
      {
        "Step 2": "Put the flours in the bowl of a stand mixer fitted with a dough hook, add the salt, oil and cold water. Run the mixer on its lowest speed for about 1 minute, then add the yeast mixture and mix for 5-7 minutes until the dough comes together as a smooth mass (it should be soft but not sticky). If the dough feels too sticky, add a little more flour and continue to mix. Transfer the dough to a lightly oiled bowl, cover with a damp cloth and rest for 1-1½ hours or until the dough has roughly doubled in size."
      },
      {
        "Step 3": "Turn out the dough onto a lightly floured work surface and knead for 2-3 minutes, then form into 3 equal balls weighing 150-160g. Transfer the balls to a lightly oiled tray, arranging them roughly 5-7cm apart. Double-wrap loosely with cling film and leave to rise for 1-2 hours, or until the balls have roughly doubled in size (see Make Ahead). The dough is now ready to shape as a base for pides, flatbreads or pizzas."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/34.jpg"
  },
  {
    "id": "35",
    "title": "Strawberry collins",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "20 minutes",
    "description": "We love using mezcal in cocktails, and this strawberry collins from Los Mochis restaurant in London pairs it with grapefruit soda and lime juice for a zingy and refreshing mix. A perfect use of on-the-turn strawberries.",
    "ingredients": [
      "225g strawberries",
      "225ml of water",
      "100g sugar",
      "50ml mezcal espadin",
      "20ml strawberry syrup (from above)",
      "30ml lime juice, plus a wedge to rub around the glass",
      "Grapefruit soda to top up"
    ],
    "method": [
      {
        "Step 1": "Rinse the strawberries under cold running water, then pick off the green tops. Slice and put in a medium saucepan with the water."
      },
      {
        "Step 2": "Bring the water to the boil, then reduce to a medium simmer and let the strawberries cook for 15 minutes. Skim and discard any foam that rises to the top."
      },
      {
        "Step 3": "Strain the strawberry liquid through a fine sieve into another clean saucepan (discard the strawberries). Add the sugar then bring back to the boil, stirring to help dissolve the sugar. Simmer the syrup for 5 minutes until the sugar is completely dissolved, skimming any additional foam that rises to the top."
      },
      {
        "Step 4": "Remove from the heat and allow to cool completely. Pour into a container, seal and refrigerate."
      },
      {
        "Step 5": "To make the cocktail, rub a lime wedge around the rim of a highball (collins) glass, then dip in salt. Fill the glass a third of the way up with ice then pour over the mezcal, lime juice and strawberry syrup. Give it a stir and top up with grapefruit soda."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/35.jpg"
  },
  {
    "id": "36",
    "title": "Crispy shallots",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 5 min. Frying time 15-20 min.",
    "description": "Crispy shallots add colour, crunch and flavour to all manner of dishes. Sprinkle these golden bits on soups, pasta, hot dogs or curries.",
    "ingredients": [
      "400ml vegetable oil",
      "600g thinly sliced shallots"
    ],
    "method": [
      {
        "Step 1": "Warm 400ml veg oil in a smallpan over low-medium heat until just shimmering, then add the thinly sliced shallots and fry, stirring often, for 15-20 minutes until golden. Remove the shallots from the oil using a slotted spoon (reserve the oil for later use) and transfer to a plate lined with kitchen paper."
      },
      {
        "Step 2": "Season the shallots with salt and store in a sealed container for up to 5 days."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/36.jpg"
  },
  {
    "id": "37",
    "title": "Taco slaw with pink pickled onions",
    "difficulty": "Easy",
    "portion": "Serves 4-6 as a side",
    "time": "Hands-on time 15 min, plus pickling",
    "description": "You need a zingy taco slaw to cut through the smoky richness of tacos – and this easy, colourful carrot slaw with quick-pickled onions has zest and crunch to spare.",
    "ingredients": [
      "1 red onion, finely sliced",
      "Juice of 5 limes",
      "1 garlic clove, finely chopped",
      "1 tsp cumin seeds",
      "½ tsp chipotle flakes (optional)",
      "½ tsp sugar",
      "1/4 white cabbage, finely shredded",
      "2 carrots, finely shredded",
      "1 jalapeño chilli, finely chopped",
      "Handful coriander, finely chopped",
      "1 tbsp rapeseed oil"
    ],
    "method": [
      {
        "Step 1": "Put the sliced red onion in a heatproof bowl, cover with boiling water for 20 seconds, then drain well and return to the bowl. Squeeze in the lime juice, then add the garlic, cumin seeds, chipotle flakes (if using), sugar and a big pinch of salt. Stir well, then set aside for at least 20 minutes to quick-pickle."
      },
      {
        "Step 2": "While the onion pickles,put the shredded cabbage and carrot in a colander. Add the finely chopped jalapeño and a good pinch of salt then scrunch together and set aside for 10 minutes to drain."
      },
      {
        "Step 3": "Squeeze the cabbage mixture to remove excess water, then put in a mixing bowl. Add the pickled onions, along with the pickling lime juice. Sprinkle in a handful of finely chopped coriander, drizzle in the rapeseed oil, give everything a mix, then taste and add extra salt if needed."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/37.jpg"
  },
  {
    "id": "38",
    "title": "Corn on the cob peanut curry",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 15 min. Simmering time 25 min",
    "description": "Masterchef star Nisha Parmar shares her family recipe for corn cob and peanut curry. A creamy, vegan coconut and tomato sauce is laced with curry leaves and peanuts. “All the coastal flavours of Kenya, with Indian undertones and satay vibes, ” says Nisha.",
    "ingredients": [
      "4 corn on the cobs",
      "4 tbsp vegetable oil",
      "1 tsp cumin seeds",
      "1 tsp mustard seeds",
      "10 curry leaves (optional)",
      "1 medium onion, finely diced",
      "1 tbsp crushed garlic",
      "1 tbsp crushed ginger",
      "1 tsp finely chopped green chilli (or more to taste)",
      "2 tsp ground cumin",
      "2 tsp ground coriander",
      "1 tsp ground turmeric",
      "1 tsp garam masala",
      "200g tinned tomatoes, whizzed until smooth",
      "75g unsalted peanuts, crushed, plus extra to garnish",
      "400g tin coconut milk",
      "Coriander, chopped, to serve",
      "Chapatis to serve"
    ],
    "method": [
      {
        "Step 1": "Cook the corn in boiling water for 8 minutes, then drain. Once cool enough to handle, cut each cob into 4 equal pieces (for the picture they were cut bigger)."
      },
      {
        "Step 2": "In a large deep saucepan over a medium heat, add the oil, cumin seeds and mustard seeds, then sizzle until they crackle. Quickly add the curry leaves (if using) followed by the diced onion and a pinch of salt, then cook gently for about 10 minutes until the onion is lightly browned."
      },
      {
        "Step 3": "Add the garlic, ginger and green chilli, cook for 1 minute, then tip in all the ground spices and stir for another minute. Add the whizzed tomatoes, along with a splash of water if the mixture looks too dry. Simmer for 10 minutes."
      },
      {
        "Step 4": "Tumble in the corn cobs, scatter over the peanuts and gently stir to coat everything in the tomato masala. Pour in the coconut milk, give everything another gentle stir, then simmer for 15 minutes until both sauces are combined and you have a deep orange, creamy sauce. Season to taste with salt, garnish with fresh coriander and another sprinkling of peanuts, then serve with chapatis."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/38.jpg"
  },
  {
    "id": "39",
    "title": "Pink pickled onions",
    "difficulty": "Easy",
    "portion": "Makes enough to fill a 250ml sterilised jar",
    "time": "Hands-on time 5 min, plus pickling",
    "description": "Learn how to make pink pickled onions with this easy recipe. Use the bright pink, tangy onions to adorn burgers, salads and tacos.",
    "ingredients": [
      "1 red onion, very finely sliced into half moons",
      "Juice 5 limes",
      "½ tsp cumin seeds",
      "½ tsp caster sugar",
      "1 garlic clove, finely chopped"
    ],
    "method": [
      {
        "Step 1": "Put the sliced onions in a heatproof bowl and boil a kettle. Pour boiling water over the onions, leave them to sit for 20 seconds, then drain."
      },
      {
        "Step 2": "Return the drained onions to the bowl and add the lime juice, cumin seeds, sugar, garlic and a big pinch of salt. Stir to combine, ensuring the onions are fully submerged in lime juice, then cover and leave to pickle for at least 20 minutes. Store in the fridge and eat within 1 week."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/39.jpg"
  },
  {
    "id": "40",
    "title": "Padron peppers",
    "difficulty": "Easy",
    "portion": "Serves 4 as a snack or tapas",
    "time": "Hands-on time 5 min",
    "description": "A Spanish classic, these blistered little peppers offer an unbridled taste of sunshine on a plate and can be cooked from scratch in an instant. Just watch out for the occasional hot one…",
    "ingredients": [
      "2 tbsp olive oil",
      "250g padron peppers",
      "Juice 1/2 lemon"
    ],
    "method": [
      {
        "Step 1": "Place a large frying pan over a high heat and add the olive oil. Once shimmering hot, tip in the padron peppers and cook for 3-5 minutes, tossing regularly, until blistered all over."
      },
      {
        "Step 2": "Squeeze over the lemon juice, add a big pinch of salt and transfer to a serving dish. Enjoy as part of a larger array of tapas dishes, or alone with an ice-cold glass of sherry."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/40.jpg"
  },
  {
    "id": "41",
    "title": "Limoncello spritz",
    "difficulty": "Easy",
    "portion": "Makes 1",
    "time": "Hands-on time 5 min",
    "description": "Limoncello spritz is a zippy, lemony livener from Salvi’s in Manchester. Mix limoncello, Prosecco and soda over ice for a seriously summery cocktail.",
    "ingredients": [
      "Ice",
      "75ml limoncello",
      "125ml prosecco,",
      "Soda water, a dash",
      "1 lemon, long strip of peel only (ideally sorrento lemon if you can get one)"
    ],
    "method": [
      {
        "Step 1": "Fill a large glass to the top with ice. Add the  limoncello and prosecco, then add a dash of soda water. Cut a long strip of peel from a lemon (ideally sorrento if you can get one), twist it over the drink to release its oils, then add as a garnish."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/41.jpg"
  },
  {
    "id": "42",
    "title": "Vegan kimchi",
    "difficulty": "Easy",
    "portion": "Makes 1.5 litres (including the cabbage and juices) ",
    "time": "Hands-on time 15 min, plus 6-8 hours soaking and at least 3 days fermenting ",
    "description": "Make vegan kimchi with Ching He Huang’s step-by-step recipe. Swap traditional fish sauce for red miso to make this funky, fermented cabbage dish vegan friendly.",
    "ingredients": [
      "2 chinese cabbages",
      "65g sea salt flakes",
      "1 daikon/mooli, peeled and sliced into julienne strips (matchsticks) – see Know How",
      "3 spring onions, trimmed and cut into 5cm slices",
      "2.5cm piece fresh ginger, peeled",
      "8 garlic cloves, peeled",
      "2 shallots, peeled",
      "6 tbsp gochugaru (Korean red pepper flakes), or more if you like it spicier – see Know How",
      "2 tbsp red miso paste (from Waitrose and online suppliers – see Ching’s tip)",
      "2 tsp caster sugar",
      "1 tbsp glutinous rice powder (optional; also known as glutinous rice flour – see Know How)",
      "Sesame seeds, toasted in a dry pan, to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Reserve 1-2 outer leaves of the cabbages. Wrap them in damp kitchen paper and put in the fridge until needed. Shred the remaining cabbage and put in a large, deep pot or bowl. Add the salt and toss well. Add enough cool water to cover the cabbage and stir until the salt has dissolved. Put a plate on top to keep the cabbage submerged, then leave at room temperature for 6-8 hours or overnight (stir halfway through if possible)."
      },
      {
        "Step 2": "Drain the cabbage, reserving the brine. Rinse the cabbage, squeeze out any excess water, then return it to the bowl, adding the daikon/mooli and spring onions. Put the ginger, garlic, shallots, gochugaru, red miso paste and sugar in a food processor. Add the rice powder, if using. Pulse until the mixture forms a paste, then spoon the paste over the vegetables. Using tongs or gloves, mix and massage the vegetables and paste together until well coated. Pack the mixture into a sterilised 2 litre jar, leaving 3-5cm space at the top (see Ching’s tips for success). Add enough of the reserved brine to just cover the vegetables, pressing them down a bit. Place the whole cabbage leaf or leaves over the top, pressing down – this should help keep the kimchi submerged under the brine (or see Ching’s tips for success)."
      },
      {
        "Step 3": "Cover loosely (to allow air to escape) and put the jar in a baking dish or large bowl to collect any juices that escape (see Ching’s tips for success). Leave the jar in the kitchen, out of direct sunlight, for 3 days. During this time, you can press down on the kimchi daily with the back of a wooden spoon to keep it all submerged."
      },
      {
        "Step 4": "After 3 days the kimchi will be ready, but it won’t achieve its full flavour and complexity for about another 2 weeks, so I suggest you seal the jar and transfer it to the fridge, where the kimchi will continue to slowly ferment (see Ching’s tips for success)."
      },
      {
        "Step 5": "To serve, scoop out using a slotted spoon, transfer to a side dish and dress with toasted sesame seeds. It’s delicious on top of noodle soups or stews – or added to a stir-fry. Enjoy!"
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/42.jpg"
  },
  {
    "id": "43",
    "title": "Pomegranate-glazed aubergines and courgette tabbouleh",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min",
    "description": "Pair pomegranate-glazed aubergines and an easy courgette tabbouleh for a low-effort, big-flavour dinner. Roast or barbecue the aubergines.",
    "ingredients": [
      "2 large aubergines, halved lengthways",
      "2 tbsp pomegranate molasses",
      "1 tbsp maple syrup",
      "1 tsp cumin seeds, crushed",
      "Olive oil for drizzling",
      "180g quinoa, ideally a mixture of white, red and black",
      "3 tbsp extra-virgin olive oil",
      "Juice ½ lemon",
      "1 small garlic clove, chopped",
      "200g cherry tomatoes, sliced",
      "1 courgette, coarsely grated",
      "30g parsley, roughly chopped",
      "4 mint sprigs, leaves picked and roughly chopped",
      "3 tbsp tahini",
      "Squeeze lemon juice",
      "3 tbsp ice-cold water"
    ],
    "method": [
      {
        "Step 1": "Prepare the barbecue for direct heat (for cooking right over the coals; or see alternative cooking instructions above). Score the aubergine flesh in a criss cross without cutting the skin. In a small bowl, mix the pomegranate molasses, maple syrup and cumin seeds with a drizzle of oil. Drizzle the aubergines with oil and barbecue skin-side down for 10 minutes until tender. Flip, then brush the flesh side with most of the glaze. Adjust the coals, then cook indirectly for 8-10 minutes with the lid down, flipping halfway through, until sticky and charred. Set aside on a plate and brush with the remaining glaze."
      },
      {
        "Step 2": "Meanwhile, for the tabbouleh, follow the pack instructions to cook the quinoa, then rinse and drain well. Put the olive oil, lemon juice (setting aside a squeeze for the dressing) and garlic in a large bowl and whisk to combine, then add the tomatoes, courgette, mint and quinoa. Season and mix."
      },
      {
        "Step 3": "Stir the remaining squeeze of lemon into the tahini, then gradually whisk in the water to make a smooth sauce. Divide the quinoa among plates, top each with an aubergine half and drizzle with dressing to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/43.jpg"
  },
  {
    "id": "44",
    "title": "Green coriander chutney",
    "difficulty": "Easy",
    "portion": "Makes 280ml (serves 8 with leftovers)",
    "time": "Hands-on time 5 minutes",
    "description": "Whizz up a batch of green coriander chutney (Dhaniyey ki hari chutney) in ust 10 mins. This zingy fresh chutney has a chilli kick. Spoon it over grilled prawns, fish or chicken.",
    "ingredients": [
      "100g fresh coriander leaves and stalks",
      "20g fresh mint leaves (optional)",
      "1½ garlic cloves (optional)",
      "2 Thai green chillies (stalks removed)",
      "1 tsp salt",
      "½ tsp sugar",
      "Juice of ½ lemon"
    ],
    "method": [
      {
        "Step 1": "In a pestle and mortar or mini food processor, blend 100g fresh coriander leaves and stalks, 20g fresh mint leaves (optional), 1½ garlic cloves (optional) and 2 Thai green chillies (stalks removed) until you get a soft, spoonable consistency."
      },
      {
        "Step 2": "Add 1 tsp salt, ½ tsp sugar and the juice of ½ lemon. Season to taste, then use in our  papdi chaat recipe, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/44.jpg"
  },
  {
    "id": "45",
    "title": "Smoky chipotle tofu with tomatoes and avocado",
    "difficulty": "Easy",
    "portion": "Serves 2-3",
    "time": "Hands-on time 15 min. Simmering time 7-8 min",
    "description": "Pair warm, intensely smoky, chipotle tofu with soothing smashed avocado. This vegan combo is incredible on toast or in breakfast tacos.",
    "ingredients": [
      "2 tbsp olive oil",
      "225g block smoked firm tofu, cut into small cubes",
      "3 tbsp chipotles in adobo",
      "½ tsp sea salt",
      "3 spring onions, finely sliced",
      "150g cherry tomatoes, halved",
      "Tacos or toast to serve",
      "1 large avocado",
      "Grated zest and juice 1 lime",
      "Garlic cloves",
      "Chilli oil or Korean chilli flakes",
      "Chopped coriander, chervil, tarragon, basil or dill",
      "Drizzle of tahini"
    ],
    "method": [
      {
        "Step 1": "For the smashed avocado, cut the avocado in half and discard the stone. Mash the garlic, if using, with ½ tsp salt using a knife or pestle and mortar. Mash with the avocado, then add the lime zest and juice (and, if using, the chilli oil/flakes, herbs and tahini). Season to taste."
      },
      {
        "Step 2": "Heat a frying pan over a medium-high heat and, when hot, add the olive oil, then the tofu. Fry for a few minutes until crisp, then add the chipotles. Stir-fry for a few minutes, seasoning with the sea salt, then add the spring onions and tomatoes. Turn the heat to medium and cook for 7-8 minutes until the tomatoes begin to break down. Taste and adjust the seasoning, then serve with the smashed avocado, in tacos or on toast."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/45.jpg"
  },
  {
    "id": "46",
    "title": "José Pizarro’s carajamandanga (chilled tomato soup)",
    "difficulty": "Easy",
    "portion": "Serves 6-8",
    "time": "Hands-on time 30 min, plus 3 hours chilling",
    "description": "Chef José Pizarro shares his recipe for carajamandanga, a chilled tomato, pepper and courgette soup which is similar to gazpacho. Perfect for a hot day or night.",
    "ingredients": [
      "100g stale white bread, torn",
      "2 garlic cloves",
      "800g tomatoes, chopped",
      "2 tsp agridulce pimentón de La Vera (bittersweet smoked paprika – see Know How)",
      "1 tbsp cider vinegar",
      "1 red pepper, chopped",
      "1 courgette, chopped",
      "½ cucumber, peeled, deseeded and chopped",
      "120g pitted black olives, roughly chopped",
      "2 tbsp snipped chives",
      "Extra-virgin olive oil for drizzling"
    ],
    "method": [
      {
        "Step 1": "Put the bread and garlic in a food processor with 600ml water and whizz together to form a smooth mixture with the consistency of single (light) cream. Add two thirds of the tomatoes, along with the paprika and vinegar. Season well, then whizz again until smooth. You can add a splash of water if it’s a little too thick."
      },
      {
        "Step 2": "Pour the mixture into a large bowl and add the remaining tomatoes. Reserve a couple of spoonfuls each of the pepper, courgette and cucumber for the garnish, then add the rest to the bowl. Check the seasoning, then chill for at least 3 hours."
      },
      {
        "Step 3": "To serve, scatter with the olives, vegetable garnish and chives, then drizzle with extra-virgin olive oil. Season with plenty of freshly ground black pepper and enjoy."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/46.jpg"
  },
  {
    "id": "47",
    "title": "Jackfruit pickle (Kathal achaar)",
    "difficulty": "Easy",
    "portion": "Makes about 550g",
    "time": "Hands-on time 10 min, plus cooling time. Simmering time 15 min",
    "description": "Romy Gill shares her recipe for tangy jackfruit pickle (Kathal achaar). Serve this versatile vegan condiment alongside Indian dishes.",
    "ingredients": [
      "500g tinned jackfruit chunks, halved and well drained (leave in the colander so any excess water drains away)",
      "2 tsp chilli flakes or chilli powder",
      "1 tsp turmeric",
      "2 tsp panch phoran (see Know How)",
      "½ tsp asafoetida powder",
      "2 tsp ground coriander",
      "1 tsp salt",
      "75ml rapeseed oil",
      "1 litre sterlised glass jar or a selection of smaller glass jars with lid(s)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/gas 4, put the drained jackfruit chunks on a baking tray and cook for 10-12 minutes to dry out. Set aside when done."
      },
      {
        "Step 2": "In a large bowl, combine the jackfruit with the rest of the ingredients except the oil."
      },
      {
        "Step 3": "Heat the oil in a pan, then add the hot oil to the bowl and mix again with a metal spoon. Put in the sterilised jar(s) and seal."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/47.jpg"
  },
  {
    "id": "48",
    "title": "Shchi (cabbage and caraway soup)",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 25 min. Simmering time 1 hour.",
    "description": "This simple cabbage soup may be frugal but has big flavours thanks to the smoked paprika and caraway. “It’s wonderfully satisfying,” says Georgina Hayden.",
    "ingredients": [
      "2 onions",
      "4 garlic cloves",
      "1 leek",
      "2 carrots",
      "400g waxy potatoes",
      "500g white cabbage",
      "4 tbsp sunflower oil",
      "2 tbsp tomato purée",
      "1 tsp caraway seeds",
      "¼ tsp sweet smoked paprika",
      "1.5 litres vegetable stock",
      "2 bay leaves",
      "½ bunch dill",
      "Rye bread to serve"
    ],
    "method": [
      {
        "Step 1": "Peel and finely chop the onions and garlic. Trim and finely slice the leek, then rinse it well in a colander to get rid of any dirt. Peel the carrots and potatoes, then chop them into 2cm pieces, keeping them separate. Halve the cabbage, remove the core, then finely shred the leaves."
      },
      {
        "Step 2": "Put the sunflower oil in a large casserole or saucepan over a low-medium heat. Add the onions, garlic, leek and carrots and fry for 15 minutes until softened and sticky. Stir in the tomato purée, caraway seeds and paprika then, after a minute, add the shredded cabbage, chopped potatoes, veg stock and bay leaves. Turn up the heat and bring to the boil. Season generously, then reduce the heat to a simmer. Cook on a low heat for 1 hour until the vegetables are tender and the broth is rich."
      },
      {
        "Step 3": "Taste the soup and tweak the seasoning, then leave to rest for 10 minutes before serving. Roughly chop the dill, then ladle the soup into bowls and serve scattered with dill, with a slice of rye bread on the side."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/48.jpg"
  },
  {
    "id": "49",
    "title": "Lime pickle",
    "difficulty": "Easy",
    "portion": "Makes about 800g",
    "time": "Hands-on time 30 min, plus 1 week pickling ",
    "description": "Chef Romy Gill shares her easy recipe for lime pickle. Serve this classic condiment alongside an array of Indian dishes.",
    "ingredients": [
      "1 tsp ground coriander",
      "2 tsp ajwain seeds",
      "3 tsp cumin seeds",
      "6 cloves",
      "10 black peppercorns",
      "2-3 tsp chilli powder",
      "1 tsp ground ginger",
      "1 tsp black salt (kala namak) or fine sea salt",
      "700g limes (8-9), washed, dried and cut into small chunks – about 5mm",
      "100ml rapeseed oil",
      "Spice grinder or pestle and mortar",
      "Large (1 litre) glass jar or a selection of smaller glass jars with lid(s); sterilised"
    ],
    "method": [
      {
        "Step 1": "Use a spice grinder/pestle and mortar to grind the whole spices with the chilli powder, ground ginger and salt until blended."
      },
      {
        "Step 2": "Put the lime chunks in a large bowl with the spice blend and oil, then mix well and immediately put into the sterilised jar(s). Seal and set aside in a cool, dark place for 1 week, shaking daily to make sure the lime stays well coated in the spiced oil before using."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/49.jpg"
  },
  {
    "id": "50",
    "title": "Mango chutney (Aam ki meethi chutney)",
    "difficulty": "Easy",
    "portion": "Makes about 600g ",
    "time": "Hands-on time 15 min, plus resting and cooling. Simmering time 25 min",
    "description": "Romy Gill believes making homemade pickles and chutneys is good for the soul. Try her family recipe for fragrant mango chutney, and serve with all kinds of Indian dishes.",
    "ingredients": [
      "500g unripe mangoes (about 2), peeled and stones removed, diced into 1cm cubes",
      "20g fresh ginger, grated",
      "1 tsp fennel seeds, crushed in a pestle and mortar",
      "½ tsp nigella seeds",
      "1 tsp chilli flakes",
      "½ tsp salt",
      "1 tbsp rapeseed oil",
      "75g demerara sugar",
      "50ml white wine vinegar",
      "Large (1 litre) glass jar or a selection of smaller glass jars with lid(s)"
    ],
    "method": [
      {
        "Step 1": "In a large bowl mix the diced mangoes with the grated ginger, seeds, chilli flakes and salt, then leave to rest for 15 minutes."
      },
      {
        "Step 2": "Heat the oil in a pan, then add the mango mixture. Cook for few minutes, then add the sugar and vinegar, mix and cook for 10 minutes on a low heat, stirring occasionally so the mangoes don’t stick to the pan."
      },
      {
        "Step 3": "After 10 minutes mash the mixture roughly, cover the pan and cook for another 10 minutes on a low heat. Take off the heat."
      },
      {
        "Step 4": "Pour the hot chutney into the warm, sterilised airtight jar(s). Enjoy with Indian food or simply a slice of toast."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/50.jpg"
  },
  {
    "id": "51",
    "title": "Warmed asparagus and lettuce",
    "difficulty": "Easy",
    "portion": "Serves 4 as a light starter or side dish",
    "time": "Hands-on time 20 min ",
    "description": "Simmer lettuce and asparagus in mushroom stock for a deeply savoury and satisfying vegan starter or side dish. Serve with crusty bread. Recipe from Your Daily Veg: Modern, Fuss-free Vegetarian Food by Joe Woodhouse (Kyle Books  £22).",
    "ingredients": [
      "3 tbsp olive oil",
      "2 small onions, cut into eighths and separated into petals",
      "500g asparagus, woody ends snapped off, sliced 1cm thick diagonally",
      "1 mushroom stock cube, dissolved in 200ml hot water (or mushroom soaking water from 10g dried mushrooms – or vegetable stock)",
      "4 little gem lettuces, quartered lengthways",
      "5g mint (about ¼ supermarket bunch), leaves picked, finely chopped"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large, deep frying pan over a medium heat. Add the onions and cook for 8-10 minutes, stirring often, until they soften. They should still hold their integrity in the final dish, so don’t cook them until collapsing."
      },
      {
        "Step 2": "Add the sliced asparagus to the pan and toss well to combine. Keep stirring for 1 minute, then add the stock. Simmer for 3 minutes."
      },
      {
        "Step 3": "Once the asparagus is tender, remove from the heat and add the lettuce, turning to coat with the cooking liquid and wilt the leaves. Season to taste. Finally, stir in the mint and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/51.jpg"
  },
  {
    "id": "52",
    "title": "Prebranac (caramelised-onion baked beans)",
    "difficulty": "Easy",
    "portion": "Serves 8",
    "time": "Hands-on time 30 min (plus 12 hours soaking for dried beans). Simmering time 30 min (2 hours for dried beans)",
    "description": "Georgina Hayden’s prebranac recipe – a traditional Serbian dish of slow-cooked butter beans with caramelised onions – takes homemade baked beans to the next level. Serve with crusty bread for a filling vegan lunch or dinner.",
    "ingredients": [
      "500g dried butter beans or 4 x 400g jars/tins butter beans, drained and liquid reserved",
      "1 bay leaf",
      "100ml sunflower or olive oil",
      "6 onions",
      " 8 garlic cloves",
      "1 tbsp sweet paprika",
      "A few flatleaf parsley sprigs (optional)",
      "Crusty bread to serve"
    ],
    "method": [
      {
        "Step 1": "If you’re cooking the beans from scratch, soak the dried beans for about 12 hours in plenty of cold water, then drain the beans and put them in a large saucepan with the bay leaf. Cover with three times as much water and put the pan over a high heat. Bring to the boil, then reduce the heat and simmer for about 1½ hours or until the beans are tender. Don’t let them boil dry. Drain the cooked beans, reserving the cooking liquid."
      },
      {
        "Step 2": "Heat the oven to 180°C fan/ gas 6. While the beans are cooking, peel and finely slice the onions and garlic. Put the oil in a large flameproof casserole or ovenproof pan and add the sliced onions. Fry the onions slowly over a low medium heat for about 30 minutes until golden and sticky. If the onionsstart to catch, add a splash of water. Add the sliced garlic and paprika for the final 10 minutes."
      },
      {
        "Step 3": "Stir in the drained beans and 750ml of the cooking liquid (or liquid from the bean jars/tins) and season generously. If you need to, make up the amount of liquid with just-boiled water from a kettle. Put the uncovered casserole in the oven and cook for around 1-1½ hours. Check the beans a couple of times during cooking and add a splash more cooking liquid (or water from the kettle) if the dish looks like it’s drying out. The end result should be golden on top, with soft and oozy beans underneath. Remove the casserole from the oven and set aside to let the beans cool, to serve warm or at room temperature. Finish by roughly chopping the parsley, if using, and scattering over the top, then serve with crusty bread. The beans are even better reheated the next day or the day after."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/52.jpg"
  },
  {
    "id": "53",
    "title": "Pomegranate fattoush",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 15 min, plus cooling. Oven time 12-15 min.",
    "description": "Serve up a big platter of Georgina Hayden’s sweet, sour and juicy pomegranate fattoush as a colourful vegan main or side dish.",
    "ingredients": [
      "2 pitta breads",
      "2 tbsp extra-virgin olive oil, plus extra to drizzle",
      "1 tsp dried oregano",
      "1 tbsp pomegranate molasses",
      "1 lemon",
      "1 garlic clove",
      "½ pomegranate",
      "500g ripe, mixed-colour tomatoes",
      "1 small or ½ large cucumber",
      "6 spring onions",
      "1 bunch flatleaf parsley",
      "6 radishes",
      "1 cos lettuce or 2 little gem lettuces",
      "1 tsp sumac"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/ gas 4. Open out the pitta breads like a book and drizzle with olive oil, sprinkle over the oregano and season a little. Pop in the oven for 12–15 minutes until lightly golden and crisp. Leave to cool for 10 minutes, then break them up into pieces."
      },
      {
        "Step 2": "While the pitta are in the oven, make the dressing. Whisk or shake together the 2 tbsp oil, the pomegranate molasses and the juice of the lemon. Peel and crush the garlic clove with the flat of your knife and add it to the dressing. Season generously with salt and pepper, whisk together, then leave to one side. Pick out the seeds from the pomegranate and set aside."
      },
      {
        "Step 3": "Roughly chop the tomatoes, then trim and chop the cucumber (if you’re using a large cucumber, halve it lengthways and scoop out the middle). Trim and finely slice the spring onions. Pick the parsley leaves and finely chop. Trim and thinly slice the radishes. Trim and roughly chop the cos or little gems. Toss everything together with the dressing (discarding the garlic) and spread out on  a platter. Scatter over the toasted pitta and the pomegranate seeds, sprinkle over the sumac. Serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/53.jpg"
  },
  {
    "id": "54",
    "title": "Platinum Jubilee gin punch",
    "difficulty": "Easy",
    "portion": "Serves 10; makes about 2 litres",
    "time": "10 minutes hands-on time, plus 30 minutes steeping.",
    "description": "A knockout punch to celebrate the Queen’s unprecedented reign. This summery cocktail is made with gin, an easy Earl Grey syrup, elderflower and nectarine. Cheers, your Majesty!",
    "ingredients": [
      "200g caster sugar",
      "300ml water",
      "4 Earl Grey tea bags",
      "500ml gin",
      "75ml elderflower cordial",
      "1 litre soda water",
      "Juice of 3 lemons",
      "1-2 tsp Angostura bitters",
      "1 lemon, cut into wedges",
      "4 nectarines, cored and sliced",
      "Edible flowers (to serve)"
    ],
    "method": [
      {
        "Step 1": "Heat the sugar and 300ml water in a pan, stirring, until the sugar dissolves. Bring to the boil, take off the heat, add the Earl Grey tea bags, then steep for 30 minutes. Squeeze the bags, then discard"
      },
      {
        "Step 2": "Pour the cooled syrup into a bowl with the gin, elderflower cordial, soda water, lemon juice and Angostura bitters to taste. Stir in the lemon wedges, sliced nectarines and lots of ice. Adjust to taste and scatter with edible flowers before serving."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/54.jpg"
  },
  {
    "id": "55",
    "title": "Prassinopita (celebration of greens pie)",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 40 min, plus salting and proving. Oven time 25-30 min.",
    "description": "Georgina Hayden’s prassinopita is her vegan take on Greek spanakopita. This celebration of greens pie is crammed with courgette and spinach and topped with sesame.",
    "ingredients": [
      "400g strong white bread flour, plus extra to dust",
      "2 tsp fine sea salt",
      "1 tbsp caster sugar",
      "½ x 7g sachet fast-action dried yeast",
      "4 tbsp olive oil, plus extra to grease",
      "1 medium courgette (around 200g)",
      "1 leek",
      "4 spring onions",
      "200g baby leaf spinach",
      "¼ tsp fennel seeds",
      "Bunch dill",
      "Bunch flatleaf parsley",
      "1 tsp freshly ground white pepper",
      "1 lemon",
      "2 tbsp sesame seeds",
      "3 tbsp honey (or agave syrup, if you need the recipe to be vegan)"
    ],
    "method": [
      {
        "Step 1": "Put the flour in a large mixing bowl (or the bowl of a stand mixer) and mix in 1 tsp of the sea salt. In a jug, mix the sugar and yeast with 225ml warm water. Leave for a few minutes. Use your fingers to rub the olive oil into the flour (or use a dough hook), then make a well in the middle. Mix in the yeast water, adding a few more tablespoons of water if the dough needs it to come together – you don’t want it to be dry. Turn out the dough onto a lightly floured surface, then knead for 8–10 minutes until smooth and elastic. Alternatively, use a stand mixer with a dough hook Transfer the kneaded dough to a clean, lightly oiled bowl and leave to prove for 1 hour."
      },
      {
        "Step 2": "While the dough is proving, prepare the filling. Trim and slice the courgette lengthways, then finely slice each half. Trim and slice the leek the same, then put in a colander and rinse thoroughly to remove any grit. Finely slice the spring onions. Put them all in a large colander with the baby leaf spinach and scrunch in the remaining 1 tsp salt, really turning the vegetables. Leave the colander in the sink for 30 minutes, scrunching it all together again halfway through."
      },
      {
        "Step 3": "Heat your oven to 200°C fan/gas 7. Grind the fennel seeds using a pestle and mortar. Finely chop the dill and flatleaf parsley. Scrunch the filling in the colander one last time and really squeeze out the excess liquid – it should look as if the greens have been wilted down. Transfer to a large mixing bowl. Add the chopped dill and parsley, the white pepper and the juice from the lemon, the mix into the greens by hand."
      },
      {
        "Step 4": "Turn the dough out onto a lightly floured worktop and pat into a ball. Roll or push it out into a circle about 35cm diameter, then heap the salted greens in the middle of the dough. Bring up the sides over the filling and join them together in the middle so you have a big pie."
      },
      {
        "Step 5": "Drizzle a little oil into a 24cm ovenproof frying pan. Carefully flip the pie into it (so it’s seam-side down), patting and easing it in. Drizzle the top of the pie with a little more olive oil, then pat on the sesame seeds and ground fennel seeds. Put the pan over a medium heat and cook for 2-3 minutes until the pie starts to sizzle, then transfer the pan to the oven. Bake for 25-30 minutes until golden all over. Remove the pie from the oven and drizzle with the honey/agave. Leave for 5 minutes before serving warm – or serve at room temperature."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/55.jpg"
  },
  {
    "id": "56",
    "title": "Orange, fennel and pea shoot salad with walnuts",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 10 min",
    "description": "This zesty orange, fennel and pea shoot salad makes a vibrant spring side dish. Add grilled prawns or halloumi to transform it into a main.",
    "ingredients": [
      "1 fennel bulb, finely sliced",
      "3 small oranges, skin and pith cut away with a sharp knife, sliced into rounds",
      "100g walnuts, toasted in a dry frying pan",
      "80g bag pea shoots",
      "Handful mixed salad leaves or soft herbs",
      "Juice 1 lemon",
      "4 tbsp extra-virgin olive oil, plus a glug",
      "1 tsp hibiscus powder (from Waitrose or Amazon – or buy dried hibiscus from a health food shop and grind it)",
      "1 tsp balsamic vinegar",
      "1 tsp dijon mustard"
    ],
    "method": [
      {
        "Step 1": "Toss the fennel in a little of the lemon juice for the dressing and a glug of oil so it doesn’t discolour."
      },
      {
        "Step 2": "Combine all the ingredients for the dressing in a small glass or jar, then whisk with a fork or shake until emulsified."
      },
      {
        "Step 3": "Arrange the salad ingredients on a platter, then drizzle with the dressing to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/56.jpg"
  },
  {
    "id": "57",
    "title": "Rhubarb gin",
    "difficulty": "Easy",
    "portion": "Makes 1 litre",
    "time": "Hands-on time 10 min, plus 1 week steeping.",
    "description": "This gloriously pink rhubarb gin is a cinch to make. It tastes great on its own over ice or in a cocktail. Have a go with our easy recipe – we’ve even got a clever tip for using up the gin-soaked fruit.",
    "ingredients": [
      "500g rhubarb, sliced",
      "150g caster sugar",
      "A few pared strips lime zest",
      "1 vanilla pod",
      "6 juniper berries",
      "70cl bottle gin",
      "Sterilised 1.5 litre glass jar with an airtight seal, such as a Kilner jar",
      "Sterilised 1 litre glass bottle with a top",
      "Square of muslin/clean J-cloth"
    ],
    "method": [
      {
        "Step 1": "Put the rhubarb in your sterilised jar. Add the caster sugar, lime zest, vanilla pod, juniper and gin. Seal and store in a dark cupboard for 1 week, turning or gently shaking every now and then to dissolve the sugar and mix up the rhubarb."
      },
      {
        "Step 2": "Strain the gin through a square of muslin or a new J-cloth, then transfer to the sterilised glass bottle and seal (see Make Ahead). Keep the fruit to make  rhubarb and blueberry jam (see tips)."
      },
      {
        "Step 3": "To serve, shake rhubarb gin and vodka with ice, then strain into a martini glass with a pared slice of shocking-pink rhubarb."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/57.jpg"
  },
  {
    "id": "58",
    "title": "Hibiscus and kombucha sparkling mocktail",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 10 min",
    "description": "Stir up a refreshing kombucha mocktail with our easy recipe. This sparkling concoction has a gorgeous pink hue, thanks to the hibiscus.",
    "ingredients": [
      "3 tbsp simple syrup (buy Monin or see Know-how)",
      "2 tbsp hibiscus powder (from Waitrose or Amazon – or buy dried hibiscus from a health food shop and grind it)",
      "Juice 3 limes, plus slices to garnish",
      "Juice 2 ruby grapefruit, plus thin wedges to garnish",
      "Chunky ice cubes to serve",
      "2 x 275ml bottles kombucha, tonic or non-alcoholic fizz"
    ],
    "method": [
      {
        "Step 1": "Combine the syrup, hibiscus powder, lime and grapefruit juice in a jug. Pour into tumblers over ice, then top up with kombucha (or other fizz) and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/58.jpg"
  },
  {
    "id": "59",
    "title": "Almond and cranberry granola bars",
    "difficulty": "Easy",
    "portion": "Makes 12",
    "time": "Hands-on time 15 min, plus cooling. Oven time 30 min.",
    "description": "These delicious homemade granola bars are packed with creamy almonds and tangy dried cranberries. Perfect for snacks, picnics and lunchboxes.",
    "ingredients": [
      "140g blanched skinless almonds",
      "150g gluten-free rolled oats, half whizzed in a blender to make a flour",
      "200g dried cranberries",
      "2 tsp ground coriander",
      "¾ tsp fine sea salt",
      "150ml maple syrup (check it’s vegan if it needs to be)",
      "150ml golden syrup",
      "Sugar thermometer"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C fan/ gas 6. Line a 20cm x 20cm baking tin with baking paper. Spread the almonds on a baking sheet and roast for 7-8 minutes until golden, set aside to cool, then roughly chop. Put the almonds in a bowl with the oats, oat flour, cranberries, coriander and salt. Turn down the oven to 160°C fan/gas 4."
      },
      {
        "Step 2": "Pour the syrups into a deep pan (they’ll bubble up a lot) and simmer until the temperature reaches 122°C on a sugar thermometer (about 4 minutes once they’re simmering rapidly)."
      },
      {
        "Step 3": "Quickly pour the syrup over the oat mixture, then stir with a spatula until fully combined. Tip into the prepared tin, pressing down gently with damp hands to form an even layer."
      },
      {
        "Step 4": "Bake for 15-20 minutes until golden. Leave in the tin to cool, then cut into bars/triangles."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/59.jpg"
  },
  {
    "id": "60",
    "title": "Vegan chocolate cake",
    "difficulty": "Easy",
    "portion": "Serves 12",
    "time": "Hands-on time 40 min, plus cooling and a few hours firming; Oven time 1 hour 5-10 min",
    "description": "Our vegan chocolate cake is dairy-free and egg-free and comes with a vegan buttercream, amaretto and jam filling, and is covered in a gorgeously silky ganache. It’s stop-you-in-your-tracks good!",
    "ingredients": [
      "300ml unsweetened soy milk",
      "1 tbsp finely ground/milled chia seeds",
      "1 tbsp lemon juice",
      "1 tsp instant coffee powder",
      "2 tsp vanilla extract",
      "150g vegan spread, such as Vitalite or Flora 100% Natural, melted",
      "3 tbsp agave nectar",
      "175g caster sugar",
      "35g cocoa powder",
      "300g self-raising flour",
      "200g dairy-free dark chocolate (about 45% cocoa solids)",
      "250ml plant-based double cream alternative – we used Elmlea Plant",
      "1 tbsp agave nectar",
      "90g vegan spread",
      "1 tsp vanilla extract",
      "1 tbsp unsweetened soy milk",
      "2 1⁄2 tbsp cocoa, sifted",
      "180g icing sugar, sifted",
      "4-8 tbsp vegan amaretto",
      "6 tbsp good quality black cherry jam (see Tips)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/ gas 4. Line the base and sides of the cake tin. In a large jug, whisk together the soy milk, chia, lemon juice, coffee powder, vanilla, melted spread and agave nectar. Set aside for 5 minutes (don’t worry if it looks curdled)."
      },
      {
        "Step 2": "Sift the sugar, cocoa and flour into a large bowl. Pour in the wet mix, whisk with a balloon whisk until smooth, then spoon into the prepared tin, smoothing the top. Bake for 45 minutes, then cover loosely with foil and cook for 25-30 minutes until springy to the touch and a skewer pushed into the centre comes out clean. Transfer to a cooling rack for an hour, then remove from the tin and leave to cool completely (see Make Ahead)."
      },
      {
        "Step 3": "For the ganache, put all the ingredients in a bowl set over a pan of barely simmering water. Stir occasionally until melted (or microwave on a medium heat for about 3 minutes). Remove from the heat and leave somewhere cool until it begins to firm up – this may take a few hours. To cool it faster, put the bowl in a larger bowl filled with iced water. Stir every minute or so to ensure it doesn’t get too firm – when you lift out the spoon and gently let a little ganache fall back onto the mix, it should briefly form a visible line (ribbon) on top."
      },
      {
        "Step 4": "For the buttercream, use an electric mixer to beat the spread until pale. Whisk in the vanilla and soy milk to combine. Add the cocoa and icing sugar, then beat until pale and fluffy."
      },
      {
        "Step 5": "To assemble, use a sharpknife to cut the cooled cake into 3 layers. Drizzle the cut side of each layer with 1-2 tbsp amaretto. (If you have time, put the drizzled layers in the freezer for an hour to firm up and make assembling/decorating easier.)"
      },
      {
        "Step 6": "Spread the top of the bottom and middle layers with half the buttercream each, then add half the jam to each, spreading thinly until about 1cm from the edge. Stack the cake layers using the undecorated one as the top, then transfer to a serving plate."
      },
      {
        "Step 7": "Use a palette knife to spread the ganache on the sides so they’re well covered, then pile and swirl the rest on top. Leave the cake in a cool place for a few hours until firm enough to cut."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/60.jpg"
  },
  {
    "id": "61",
    "title": "Spiced rice and lentils with roast squash",
    "difficulty": "Easy",
    "portion": "Serves 4 ",
    "time": "Hands-on time 40 min",
    "description": "This is a filling vegan dinner for four people. It takes its inspiration from centuries-old kitchari or khichdi, which is a traditionally Indian dish of slow-cooked rice and lentils. We’ve added roast squash, coconut yogurt and a squeeze of lime to this comforting dish.",
    "ingredients": [
      "500g butternut squash or pumpkin, cut into wedges",
      "3 tbsp olive oil",
      "130g basmati rice",
      "200g split red lentils",
      "1 onion, finely chopped",
      "1 thumb-size piece ginger, grated",
      "2 garlic cloves, crushed",
      "2 tsp turmeric",
      "2 tsp ground coriander",
      "2 tsp cumin seeds",
      "1-2 tsp medium chilli powder (to taste)",
      "1.2 litres vegetable stock (gluten free if need be)",
      "200g spinach leaves",
      "Yogurt, chilli flakes and lime wedges to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180ºC fan/gas 6. Toss the squash on a baking tray with 1 tbsp of the oil and some salt. Roast for 20-25 minutes or until tender."
      },
      {
        "Step 2": "Meanwhile, tip the rice and lentils into a sieve and rinse under cold water for a few minutes or until the water turns from cloudy to clear."
      },
      {
        "Step 3": "Heat the remaining oil in a saucepan, add the onion and a pinch of salt and fry over a medium heat for 8-10 minutes. Add the ginger, garlic and spices, then cook for 1 minute. Stir in the lentils, rice and stock. Bring to a simmer and cook over a low-medium heat, covered, for 25 minutes, stirring regularly. Add a splash more water if it starts to thicken too much."
      },
      {
        "Step 4": "Stir the spinach into the rice and let it wilt for a couple of minutes. Season to taste, then share among bowls, top with the squash/pumpkin and, if you like, serve with yogurt, chilli flakes and lime wedges for squeezing"
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/61.jpg"
  },
  {
    "id": "62",
    "title": "Garlic and chilli purple sprouting broccoli",
    "difficulty": "Easy",
    "portion": "Serves 4 as a side",
    "time": "Hands-on time 10 min",
    "description": "Stir-fried purple sprouting broccoli with crispy garlic and shallots is a quick vegan side dish that packs a big flavour punch. Serve with lamb, chicken or tofu.",
    "ingredients": [
      "150ml vegetable oil for frying",
      "2 banana shallots, finely sliced",
      "4 large garlic cloves, finely sliced",
      "2 tsp sesame oil",
      "5cm piece ginger, finely sliced into matchsticks",
      "1 small chilli, finely chopped (optional)",
      "300g purple sprouting broccoli, larger stems halved",
      "2 tbsp fermented black bean paste (see Know How)",
      "1 tbsp light soy sauce",
      "1 tbsp chinese rice wine (optional)",
      "Finely grated zest and juice ½ small orange"
    ],
    "method": [
      {
        "Step 1": "Put the vegetable oil and shallots in a wok over a medium heat. Bring to a simmer, moving the shallots around for 2-3 minutes until golden. Use a slotted spoon to remove the shallots and set aside on kitchen paper to drain and cool (they’ll crisp up as they cool). Add the garlic slices to the oil and fry for 2-3 minutes until light golden (don’t let them get too much colour as they’ll continue to brown a little out of the oil). Remove the garlic and drain. Set aside with the shallots."
      },
      {
        "Step 2": "Carefully pour off most of the vegetable oil, leaving about 1 tsp behind (save the flavoured oil for future frying). Increase the heat to high, then add the sesame oil, ginger and chilli (if using) to the wok. Stir-fry for 1 minute, then add the broccoli and cook, stirring and tossing, for 3-4 minutes until slightly softened and charring in places."
      },
      {
        "Step 3": "Whisk together the black bean paste, soy, rice wine (if using), orange zest and juice. Add the sauce to the wok and continue to cook the broccoli for a further 2-3 minutes until just tender and the sauce is slightly reduced. Serve straightaway, scattered with the crispy shallots and garlic."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/62.jpg"
  },
  {
    "id": "63",
    "title": "Jodhpuri mirchi vada (spiced chilli fritters)",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 1 hour ",
    "description": "Vivek Singh shares his recipe for jodphuri mirchi vada, fried chillies with spiced potato stuffing. This delicious snack is eaten at Holi.",
    "ingredients": [
      "400g mild banana chillies (or jalapeños)",
      "Oil for deep frying",
      "Tamarind chutney to serve (optional)",
      "250g floury potatoes (such as maris piper), unpeeled",
      "½ tsp fennel seeds, crushed",
      "½ tsp coriander seeds, crushed",
      "1 green chilli, finely chopped",
      "2 tbsp chopped fresh coriander leaves",
      "1 tsp dried mango powder (see tip) or juice ½ lemon",
      "½ tsp ground cumin",
      "½ tsp chilli powder",
      "Pinch ground asafoetida (see tip)",
      "120g chickpea (besan) flour",
      "¼ tsp chilli powder",
      "Pinch ground asafoetida (see tip)",
      "1 tsp carom seeds (see tip)",
      "½ tsp nigella seeds",
      "Pinch bicarbonate of soda (optional)",
      "1 tsp salt",
      "Digital probe thermometer",
      "Kitchen paper"
    ],
    "method": [
      {
        "Step 1": "For the stuffing, steam or boil the potatoes until tender. While still warm, peel, mash, then set aside."
      },
      {
        "Step 2": "Meanwhile, using the tip of a sharp knife, slit each chilli down one side, taking care to leave the stalk intact. Work from the stalk end and leave about 1cm uncut at the bottom to help the chilli hold its shape when stuffed. Remove the seeds with a teaspoon. Repeat for all the chillies."
      },
      {
        "Step 3": "Heat a glug of oil in a frying pan. Add the crushed fennel seeds and coriander seeds and sizzle for 30 seconds. Add the mashed potatoes, followed by the remaining stuffing ingredients. Season, mix well, then let the mixture cool to room temperature. Use the mixture to stuff the chillies (see Make Ahead)."
      },
      {
        "Step 4": "Fill a deep, heavy-based pan one-third full of oil and set it over a medium heat. For the batter, put the chickpea flour in a mixing bowl with the chilli powder, asafoetida, carom seeds, nigella seeds and bicarb (if using). Add the salt and 125-150ml water to make a thick batter."
      },
      {
        "Step 5": "Once the oil reaches 160°C-170°C on the digital probe (or a cube of bread turns brown in 40-50 seconds), dip the stuffed chillies in the batter to coat, then carefully add to the hot oil, working in batches."
      },
      {
        "Step 6": "Fry each batch for 5-6 minutes until golden and crisp, then use a slotted spoon to transfer the chillies to a plate lined with kitchen paper to drain. Serve hot with tamarind chutney, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/63.jpg"
  },
  {
    "id": "64",
    "title": "Vegan wild garlic lasagne",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 45 min, plus soaking. Oven time 30-40 min.",
    "description": "Plant-based foods can be pricey, but if you forage for the garlic, this vegan wild garlic lasagne recipe delivers punchy flavours and a moreish ‘cheese’ sauce.",
    "ingredients": [
      "200g wild garlic (see Easy Swaps)",
      "Pinch grated nutmeg",
      "10-12 lasagne sheets (egg free)",
      "100g vegan mozzarella (optional)",
      "2 tbsp olive oil",
      "1 onion, finely chopped",
      "1 celery stick, finely chopped",
      "1 small carrot, finely chopped",
      "1 garlic clove, finely chopped",
      "A few thyme, sage or rosemary sprigs",
      "1 bay leaf",
      "500g frozen vegan mince",
      "400g tin crushed tomatoes",
      "1 tbsp tomato purée",
      "1 tsp soy sauce",
      "2 tsp Marmite",
      "2 tbsp plant-based milk",
      "250g cashews, soaked in boiling water for 1 hour",
      "1 tbsp white wine vinegar or cider vinegar",
      "2 tbsp nutritional yeast (such as Engevita)",
      "¼ tsp celery salt (optional)",
      "¼ tsp paprika",
      "Splash hot chilli sauce",
      "Pinch mustard powder (optional)"
    ],
    "method": [
      {
        "Step 1": "For the ragù, heat the olive oil in a heavy-based pan, then add the onion, celery, carrot and a pinch of salt. Cook for 15 minutes to soften, then add the garlic and cook for 10 minutes until the veg start to caramelise. Add the herbs, bay leaf and plenty of black pepper."
      },
      {
        "Step 2": "Add the vegan mince to the pan and stir to defrost and brown it a bit. Mix in the tomatoes, tomato purée, soy sauce and Marmite."
      },
      {
        "Step 3": "For the ‘cheese’ sauce, blend the soaked and drained cashews, vinegar, nutritional yeast, celery salt (if using), paprika and 375ml water in a bullet blender/food processor for 2 minutes until smooth. Season with chilli sauce and, if using, mustard powder."
      },
      {
        "Step 4": "Cook (blanch) the wild garlic in a large pan of boiling water for 15-20 seconds, drain and leave to cool, then squeeze out any excess liquid and finely chop. Season with nutmeg and a good pinch of salt and pepper."
      },
      {
        "Step 5": "Heat the oven to 180ºC fan/ gas 6 and prepare the lasagne sheets according to the packet instructions. Spread a third of the ragù over the base of a baking dish (about 25cm x 35cm). Add a third of the ‘cheese’ sauce, then cover with a layer of pasta. Spread evenly with half the wild garlic mixture and a third of the mozzarella (if using), then repeat the layers and finish with layers of theremaining ragù, pasta, ‘cheese’ sauce and mozzarella (if using)."
      },
      {
        "Step 6": "Bake for 30-40 minutes until bubbling and golden. Rest for 10 minutes before serving."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/64.jpg"
  },
  {
    "id": "65",
    "title": "Aloo paratha (potato flatbreads)",
    "difficulty": "Easy",
    "portion": "Makes 4-6",
    "time": "Hands-on time 30 min",
    "description": "Chef Rohit Ghai shares his recipe for aloo paratha, potato-stuffed flatbreads. Delicious for breakfast, or as part of an Indian feast.",
    "ingredients": [
      "2 medium potatoes (about 300g), boiled and grated – see Know-how",
      "2 tbsp finely chopped coriander leaves",
      "1 green chilli, finely chopped",
      "¼ tsp toasted ground cumin",
      "¼ tsp garam masala",
      "¼ tsp dried mango powder (amchur)",
      "¼ tsp red chilli powder",
      "2 tbsp rapeseed oil for cooking",
      "250g wholemeal flour",
      "1 tsp rapeseed oil",
      "¼ tsp salt",
      "100-150ml water"
    ],
    "method": [
      {
        "Step 1": "First, make the dough. Mix the wholemeal flour, oil and salt in a bowl, then mix in the water a little at a time, kneading as you go, until it forms a smooth, soft dough. You may not need to add all the water. Cover with a clean tea towel and leave to rest for 15-20 minutes, then divide the dough into 4-6 equal balls."
      },
      {
        "Step 2": "To make the filling, put the grated potatoes in a bowl with the coriander, green chilli, toasted cumin, garam masala, dried mango powder, red chilli powder and some salt. Mix until everything is well combined."
      },
      {
        "Step 3": "To make the parathas, use a rolling pin to roll a dough ball into a circle about 8 10cm. Place 2-3 tbsp of the filling in the centre – don’t overfill it or it will be difficult to roll. Bring all the edges together and pinch to seal, then flatten the ball using your hands. Now roll the dough ball into a circle 18-20cm in diameter. The trick is to apply equal pressure while rolling – if you do this, your paratha will become round automatically."
      },
      {
        "Step 4": "Transfer the rolled paratha to a hot dry frying pan (or tawa). Cook for 1-2 minutes on each side, then oil the side that’s facing up and flip it again. Once again, oil the side that’s facing up so both sides have been oiled. Press with a spatula and cook the paratha until both sides have golden brown spots."
      },
      {
        "Step 5": "Repeat with the rest of the dough balls and serve the aloo paratha hot."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/65.jpg"
  },
  {
    "id": "66",
    "title": "Mushroom and truffle khichadi",
    "difficulty": "Easy",
    "portion": "Serves 4-6 as part of a spread",
    "time": "Hands-on time 45 min",
    "description": "Chef Rohit Ghai’s mushroom and truffle khichadi is his signature take on the classic Indian comfort food dish of rice and lentils.",
    "ingredients": [
      "200g basmati rice",
      "300g toor dal (yellow split peas)",
      "2 tbsp vegetable oil",
      "1 bay leaf",
      "½ tsp cumin seeds",
      "½ tsp grated ginger",
      "Pinch asafoetida",
      "100g onions, chopped",
      "1 green chilli, slit down one side",
      "100g (1-2) tomatoes, chopped",
      "Pinch ground turmeric",
      "2 tbsp vegetable oil",
      "500g mushrooms (mix of wild or cultivated), chopped",
      "1 tsp cumin seeds",
      "100g onions, finely chopped",
      "1 tbsp ginger-garlic paste",
      "1/4 tsp ground turmeric",
      "1 tbsp ground coriander",
      "1/2 tsp kashmiri chilli powder (or mild chilli powder/paprika)",
      "1/2 tsp garam masala",
      "100g tomatoes (1-2), chopped",
      "1 tsp truffle oil",
      "2 tsp fresh black truffle, shaved or grated (see Know-how)",
      "1 tbsp chopped coriander leaves"
    ],
    "method": [
      {
        "Step 1": "Wash the rice and lentils at least three times in fresh water, then drain well and set aside. Heat the oil in a large saucepan set on a medium heat and add the bay leaf and cumin seeds. Cook for 1 minute, then add the grated ginger and cook until fragrant. Add the asafoetida, followed by the onions and green chilli, and cook for about 5 minutes until the onions have started to soften."
      },
      {
        "Step 2": "Add the tomatoes, turmeric and a large pinch of salt and cook for 3-4 minutes. Add the drained rice and lentils and give it a good stir. Add 750ml water for a thick consistency, or, if you prefer a looser, porridge-like khichadi, add 1 litre water. Stir once, check for seasoning, then leave to simmer, covered, giving the mixture the occasional stir, while you cook the mushrooms. If the mixture begins to stick, add a little more water."
      },
      {
        "Step 3": "For the mushrooms, heat 1 tbsp of the oil in a non-stick pan over a medium heat. Add the mushrooms in batches with a large pinch of salt and cook until golden brown all over and most of the moisture has evaporated."
      },
      {
        "Step 4": "Meanwhile, put another frying pan over a medium heat and add the remaining 1 tbsp oil. Add the cumin seeds and, once they begin to crackle, turn up the heat to medium-high and add the onions, cooking until caramelised, crisp and golden brown – about 7-8 minutes. Add the ginger-garlic paste, cook for 2-3 minutes, then add the turmeric, coriander, chilli powder and garam masala. Cook gently for 4-5 minutes, then add the tomatoes and simmer for about 10 minutes until soft. Add the cooked mushrooms, give everything a good stir and remove from the heat."
      },
      {
        "Step 5": "By this time the khichadi should be ready – it should take 20-25 minutes. Taste a spoonful of the rice and lentils to ensure they’re cooked through."
      },
      {
        "Step 6": "Divide the khichadi among dishes and top with the mushroom mixture. Drizzle with truffle oil, generously cover with freshly shaved or grated truffle and garnish with coriander to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/66.jpg"
  },
  {
    "id": "67",
    "title": "Preserved lemons",
    "difficulty": "Easy",
    "portion": "Makes 1 large/a few smaller jars ",
    "time": "Hands-on time 10 min, plus 4-5 weeks fermenting",
    "description": "With only two basic ingredients and some imaginative flavourings, preserved lemons are storecupboard stars. Make a jar or two with our easy recipe.",
    "ingredients": [
      "12 small unwaxed lemons (about 1kg; see tips)",
      "200g pure salt",
      "8-10 mixed peppercorns",
      "2 fresh bay leaves",
      "1 chilli, halved (optional)",
      "1 large jar (around 1.5 litres) or a few smaller jars, washed and sterilised"
    ],
    "method": [
      {
        "Step 1": "Juice 4 of the lemons and set the juice aside. Cut the rest of the lemons lengthways into quarters, stopping three quarters of the way through so the wedges are still attached at one end."
      },
      {
        "Step 2": "Sprinkle about 2 tsp salt onto the cut sides of each lemon, then layer in the jar(s) with the peppercorns, bay, chilli (if using) and any remaining salt. Press the lemons to help them release their juice, then pour in the reserved juice to cover. (If necessary, top up with filtered or boiled-and-cooled water to ensure the lemons are fully covered.)"
      },
      {
        "Step 3": "Close the jar and set aside for 4-5 weeks in a cool spot, away from direct sunlight. Invert the jar every day for the first week or so to make sure the brine is evenly dispersed. The sealed jar(s) will keep for several months. Chill once opened and use within a couple of months."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/67.jpg"
  },
  {
    "id": "68",
    "title": "Spicy vegan omelette",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "Hands-on time 15 min",
    "description": "This spicy vegan ‘omelette’ recipe takes just 15 mins and one pan to make. Made with gram flour and potatoes,  it makes a filling lunch.",
    "ingredients": [
      "1 tbsp sunflower oil",
      "1-2 potatoes (about 170g), peeled, very thinly sliced on a box grater or mandoline",
      "¼ leek, thinly sliced",
      "50g gram flour (also known as chickpea flour or besan), sifted",
      "¼ tsp bicarbonate of soda",
      "¼ tsp ground turmeric",
      "1/2 tsp cumin seeds",
      "¼ tsp garam masala, plus a sprinkle to serve",
      "Pinch chilli powder (optional), plus extra to serve",
      "100ml plant-based milk, such as almond",
      "Squeeze lemon juice",
      "60g frozen peas, defrosted",
      "Handful coriander leaves, roughly chopped or baby salad leaves",
      "Sliced chilli, mango chutney and unsweetened coconut yogurt to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat half the oil in a medium non-stick frying pan over a high heat. Stir-fry the sliced potatoes for 1 minute, then reduce the heat to low-medium, cover and cook for 5 minutes, stirring 1-2 times. Add the leek and continue to cook, covered, for 3 minutes or until the potatoes are tender and the leek has softened."
      },
      {
        "Step 2": "Meanwhile mix the gram flour, bicarb, spices and some salt and pepper in a medium bowl. Gradually mix in the plant-based milk, followed by the lemon juice. Add the potato and leek mixture, then toss to coat."
      },
      {
        "Step 3": "Heat the remaining oil in the pan over a medium heat. Tip in the ‘omelette’ mixture and roughly spread to the edges of the pan. Cook for 1 minute, then cover and cook for 2-3 minutes more. Loosen the edges and underneath with a palette knife, then slide onto a chopping board. Invert the pan and put it over the omelette, then flip the board and pan over to drop the omelette back into the pan. Cook for another 1-2 minutes. Alternatively, cook the top under a hot grill for 2-3 minutes until golden (only if the handle won’t burn). Sprinkle with more garam masala and/or chilli powder, and serve with coriander/salad, fresh chilli and mango chutney or dairy-free yogurt, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/68.jpg"
  },
  {
    "id": "69",
    "title": "Veggie steak slice",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 25 min, plus cooling, chilling and resting. Oven time 40-45 min.",
    "description": "Our mushroom ‘steak’ slice is a vegan take on a bakery fave. An umami-rich mushroom and smoked tofu filling is wrapped in golden pastry.",
    "ingredients": [
      "2 tbsp olive oil",
      "1 onion, very finely chopped",
      "250g chestnut mushrooms, roughly chopped",
      "100g smoked tofu, finely chopped",
      "½ tbsp tomato purée",
      "1 tbsp mushroom ketchup",
      "½ tbsp brown rice miso",
      "¼ tsp ground black pepper",
      "150ml veg stock (not hot)",
      "2 tbsp cornflour",
      "500g block puff pastry (see Know How)",
      "50ml plant-based milk or 1 large egg (for vegetarians/meat eaters), lightly beaten",
      "Mustard, peas and chunky chips to serve (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a frying pan. Add the onion and a pinch of salt and fry over a low-medium heat for 10 minutes or until softened. Whizz half the mushrooms in a food processor until very finely chopped – or finely chop by hand. Add to the pan with the rest of the mushrooms and fry for a further 10 minutes."
      },
      {
        "Step 2": "Add the tofu to the pan, fry for 5 minutes, then stir in the tomato purée, mushroom ketchup, miso and black pepper and cook for 1 minute. Mix 50ml of the veg stock with the cornflour in a cup. Add the remaining stock to the mushrooms and bring to a simmer, then swiftly stir in the cornflour mixture to thicken. Simmer uncovered for 5 minutes, then season to taste and set aside to cool completely."
      },
      {
        "Step 3": "Heat the oven to 180ºC fan/ gas 6. Lightly dust your work surface and roll out the pastry to the thickness of a £1 coin. Cut out eight 12cm x 15cm rectangles, re-rolling the trimmings as needed. Put 4 of the rectangles on a large lined baking sheet and divide the mushroom mix among them, leaving a border all round. Brush the exposed pastry with the milk/ egg. Top with another pastry rectangle, then seal the edges, crimping with a fork. Score a criss-cross pattern on top of each parcel, then chill for 30 minutes."
      },
      {
        "Step 4": "Brush the remaining milk/egg over each slice. Bake for 40-45 minutes or until golden brown and puffed. Rest for 10 minutes, then serve with mustard, chunky chips and peas, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/69.jpg"
  },
  {
    "id": "70",
    "title": "Vegan jackfruit masala",
    "difficulty": "Easy",
    "portion": "Serves 4-6 as part of a spread",
    "time": "Hands-on time 40 min ",
    "description": "Rustle up a rich and filling vegan curry with our jackfruit masala recipe. Chef Rohit Ghai shares his aromatic masala recipe for four.",
    "ingredients": [
      "500g unripe jackfruit (see Know How)",
      "2 tbsp rapeseed oil",
      "250g onions, chopped",
      "1 tbsp ginger-garlic paste (see Easy Swaps)",
      "¼ tsp ground turmeric",
      "1 tsp red chilli powder",
      "½ tsp kashmiri chilli powder (or mild chilli powder/paprika)",
      "1 tsp amchur (dried mango powder)",
      "1 tbsp ground coriander",
      "150g (2-3) tomatoes, chopped",
      "1 green chilli, deseeded and chopped",
      "1 tbsp chopped fresh ginger",
      "1 tsp garam masala",
      "Handful coriander leaves"
    ],
    "method": [
      {
        "Step 1": "If using tinned jackfruit, wash it under running cold water and leave it in a colander to drain. If you’re using raw whole jackfruit, first grease your fingers well with vegetable or rapeseed oil,or mustard oil if you have it – the oil prevents the jackfruit fibres from sticking to your hand. Place a bowl of oil next to you while cutting the jackfruit, as you’ll need to smear your palms with oil from time to time. With a sharp knife, remove the skin of the jackfruit and cut out any thick stem in the centre. Cut the jackfruit flesh into small pieces – don’t wash it."
      },
      {
        "Step 2": "Heat the oil in a kadai or frying pan over a medium heat. Once it starts smoking, add the jackfruit in small batches and shallow-fry until light brown. Remove from the pan, then put in a colander and set aside."
      },
      {
        "Step 3": "Add the onions to the pan and fry until golden brown (about 10 minutes). Add the ginger-garlic paste and cook for 4-5 minutes until the raw aroma disappears, then add the turmeric, red chilli powder, kashmiri/mild chilli powder/paprika, dried mango powder, ground coriander and a pinch of salt. Add the tomatoes, green chilli and ginger and cook until the oil separates from the mixture. This usually takes 5-10 minutes over a low heat."
      },
      {
        "Step 4": "Add the jackfruit and stir to coat the pieces evenly with the spice mix. Cover with a lid and let the mixture cook over a low heat for 3-4 minutes, stirring occasionally. During this time the jackfruit pieces will absorb the flavour of the spices and the sauce should become dry. Sprinkle with the garam masala and scatter over the coriander leaves to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/70.jpg"
  },
  {
    "id": "71",
    "title": "Vegan chocolate chip oat bars",
    "difficulty": "Easy",
    "portion": "Makes 12 bars",
    "time": "Hands-on time 15 min, plus oven time 40-55 min",
    "description": "These better-for-you vegan bars are made with roasted pumpkin, oats and dark choc chips. Cut into slices ready for lunchboxes and snacks.",
    "ingredients": [
      "420g pumpkin or squash (peeled and de-seeded weight), cut into 2cm cubes",
      "1 tsp sunflower oil",
      "100g dairy-free spread (such as Pure) or coconut oil",
      "50g light soft brown sugar",
      "75g soft dates, roughly chopped (stoned weight; medjool or Persian dates give the best stickiest results)",
      "175g jumbo oats",
      "90g plain wholemeal flour (we used spelt)",
      "½ tsp baking powder",
      "90g nuts (we used almonds), roughly chopped",
      "60g dark chocolate chunks (at least 70% cocoa solids)",
      "30g cocoa nibs",
      " 20cm x 20cm square baking tin, greased and base-lined"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180ºC fan/gas 6. Spread the squash in a roasting tin, toss with the sunflower oil and roast for 20-25 minutes until softened and golden. Set aside and reduce the oven to 160ºC fan/gas 4."
      },
      {
        "Step 2": "Meanwhile, melt the spread/oil and sugar with the dates in a small pan over a low heat. Remove from the heat. Add the roasted squash while still hot, then blend until smooth with a stick blender/food processor."
      },
      {
        "Step 3": "Mix the oats, flour, baking powder and a pinch of salt in a large bowl. Add the roasted squash mixture, then mix using a table knife (as you’d mix scones), being careful not to overwork the mixture. When almost combined, stir in the nuts, chocolate chunks and cocoa nibs. Transfer the mixture to the prepared tin, pushing it into the corners to evenly distribute, but be gentle – try not to press it down and flatten the top too much. Bake for 30-40 minutes until golden on top. Leave to cool completely, then cut into 12 fingers."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/71.jpg"
  },
  {
    "id": "72",
    "title": "Veggie sausage casserole with apples and cider",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 20 min, plus oven time 40 min ",
    "description": "Rustle up a delicious veggie sausage casserole with apples, cider and tarragon in just 1 hour. Serve with mash for vegan comfort food at its finest.",
    "ingredients": [
      "3 tbsp olive oil",
      "8 vegan sausages",
      "2 large onions, thinly sliced",
      "3 tbsp plain flour",
      "200ml dry cider",
      "800ml vegetable stock (check it’s vegan, if needs be)",
      "1 tbsp wholegrain mustard",
      "1 bay leaf",
      "½ bunch thyme, tied with kitchen string",
      "2-3 English apples, quartered (cox or pippin work well)",
      "½ bunch tarragon, finely chopped",
      "Mashed potatoes and green veg to serve"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160ºC fan/ gas 4. Heat 1 tbsp of olive oil in a large casserole. Add the sausages and brown for 5 minutes, turning regularly. Set the sausages aside."
      },
      {
        "Step 2": "Heat the remaining oil in the casserole. Add the onions and a pinch of salt and fry over a low-medium heat for 15 minutes or until golden and sticky."
      },
      {
        "Step 3": "Once the onions are cooked, stir in the flour and cook for 1 minute. Add the cider and bring to the simmer, then stir in the veg stock, mustard, bay and thyme. Return the sausages to the pan along with the apples, then cover with a lid or foil. Transfer to the oven for 40 minutes. Once cooked, remove the thyme and serve with mashed potatoes and steamed green veg alongside."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/72.jpg"
  },
  {
    "id": "73",
    "title": "Smoky vegan chilli",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 20 min, plus simmering time 30 min",
    "description": "Serve up a smoky vegan chilli with our easy recipe. This plant-based chilli is packed with aubergine and black beans plus a hint of chipotle.",
    "ingredients": [
      "1 large aubergine",
      "2 tbsp olive oil",
      "1 red onion, sliced",
      "2 red peppers, thinly sliced",
      "1 large garlic clove, crushed",
      "2 tsp ground cumin",
      "1 tsp ground coriander",
      "1 tsp sweet smoked paprika",
      "2-3 tbsp chipotle chilli paste",
      "400g tin chopped tomatoes",
      "2 x 400g tins black beans, rinsed and drained",
      "1 tsp white wine vinegar",
      "300ml veg stock",
      "50g dark chocolate",
      "Nachos/rice, avocado and sliced pink pickled onions (shop-bought is fine) to serve"
    ],
    "method": [
      {
        "Step 1": "Cook the aubergine under a hot grill for 15-20 minutes, turning every 5 minutes until blackened and softened. Leave to cool a little."
      },
      {
        "Step 2": "Meanwhile, heat the oil in a large, non-stick casserole. Add the onion and peppers and fry over a medium heat for 10 minutes. Stir in the garlic and ground spices and cook for 2 more minutes. Add the chilli paste, tomatoes, black beans, vinegar and stock, then season."
      },
      {
        "Step 3": "Use a spoon to scoop the aubergine flesh out of its skin in nuggets, then add them to the pan. Stir, then cook uncovered over a low heat for 30 minutes. Stir in the chocolate and season to taste with salt."
      },
      {
        "Step 4": "Serve the chilli with nachos or rice, topped with avocado andpickled onions, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/73.jpg"
  },
  {
    "id": "74",
    "title": "Sherry spritz",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "Hands-on time 5 min",
    "description": "Rustle up a fragrant Christmas cocktail with our easy sherry spritz recipe. Combine creamy sherry and ginger syrup, then top with cava.",
    "ingredients": [
      "3 tbsp cream sherry",
      "1 tbsp ginger syrup",
      "Ice",
      "Twist of orange",
      "Cava (to top up)"
    ],
    "method": [
      {
        "Step 1": "Put the cream sherry (vegan if you need it to be) and 1 tbsp ginger syrup in an ice-filled glass, then stir to chill. Add a twist of orange, then top up with cava."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/74.jpg"
  },
  {
    "id": "75",
    "title": "Garlic roast potatoes with bay leaves",
    "difficulty": "Easy",
    "portion": "Serves 6-8",
    "time": "Hands-on time 20 min, plus 1 hour oven/simmering time",
    "description": "Looking for a roast potatoes recipe that won’t let you down? Our garlic and bay roast potatoes are crisp and golden with soft fluffy insides.",
    "ingredients": [
      "2 kg floury potatoes (we recommend maris piper)",
      "75ml vegetable oil",
      "Garlic bulb, halved horizontally",
      "2-3 bay leaves",
      "1 tsp pink peppercorns, lightly crushed (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C fan/gas 6. Peel the potatoes and chop into large even chunks (about 5cm). Put in a large saucepan and cover with cold water. Add a generous pinch of salt, then set over a high heat and bring to the boil. Adjust the heat and simmer for 5-6 minutes (a bit longer if you dare) until the potatoes are tender around the edges but still firm in the middle."
      },
      {
        "Step 2": "Drain the potatoes well, then return to the pan, put on the lid and give the pan a good shake to rough up the edges. Remove the lid and leave the potatoes to steam dry in the pan for a few minutes."
      },
      {
        "Step 3": "Meanwhile, pour the oil in to a large roasting tin and put in the oven to heat up. Use a pair of tongs to carefully transfer the potatoes one by one to the hot fat, turning each one to coat it on all sides as you go. Add the garlic halves and bay leaves."
      },
      {
        "Step 4": "Roast for 45-55 minutes, turning once or twice during cooking. Season with salt and the pepper, if using,(or black pepper) and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/75.jpg"
  },
  {
    "id": "76",
    "title": "Nut roast balls, onion gravy and greens",
    "difficulty": "Easy",
    "portion": "Serves 2-3",
    "time": "Hands-on time 30 min, plus 10-12 min simmering time and 10 min oven time",
    "description": "Clodagh McKenna’s nut roast balls with rich onion gravy and greens makes a fantastic vegan alternative to roast dinner or a simple Christmas lunch. Recipe from In Minutes by Clodagh McKenna (Kyle Books £20).",
    "ingredients": [
      "150g mixed nuts, such as peanuts, almonds or hazelnuts",
      "2 tbsp olive oil, plus a drizzle",
      "½ small red onion, finely chopped",
      "1 garlic clove, crushed",
      "1 celery stick, chopped",
      "1 small carrot, grated",
      "75g chestnut mushrooms, finely chopped",
      "1 tsp thyme leaves",
      "50g ground almonds",
      "50g panko breadcrumbs",
      "1 tbsp smooth peanut butter",
      "3 tbsp chickpea (gram) flour",
      "6 tbsp vegetable oil",
      "150g leafy greens such as spring greens or kale to serve",
      "2 tbsp olive oil",
      "1 medium onion, very finely sliced",
      "1 small garlic clove, crushed",
      "1 tbsp plain flour",
      "250ml hot vegetable stock",
      "1½ tsp dark soy sauce",
      "1 tsp yeast extract (eg Marmite)",
      "1 rosemary sprig"
    ],
    "method": [
      {
        "Step 1": "For the gravy, heat the oil in a medium saucepan over a medium heat. Add the onion and garlic and fry for 10-12 minutes until starting to caramelise."
      },
      {
        "Step 2": "Meanwhile, make the nut roast balls. Put the mixed nuts in a heatproof bowl and cover with boiling water. Leave for 2 minutes before draining."
      },
      {
        "Step 3": "Meanwhile, heat the olive oil in a large frying pan over a medium heat. Add the red onion, garlic, celery, carrot, mushrooms and thyme. Fry for 5-10 minutes until everything has softened and the onion and mushrooms have caramelised a little."
      },
      {
        "Step 4": "Add the drained nuts to the pan. Stir well and season before transferring to a food processor. Add the ground almonds, breadcrumbs, peanut butter, chickpea flour and some salt and pepper, then pulse until combined; you want some texture, but the mix should be a bit sticky. Divide into 10-12 balls."
      },
      {
        "Step 5": "Heat the oven to 180°C/gas 4. Heat the veg oil in a large non-stick frying pan over a medium heat. Fry the balls for 5 minutes, turning them so they brown all over. Transfer to a lined baking tray and roast in the oven for 10 minutes."
      },
      {
        "Step 6": "While the nut balls are in the oven, finish the gravy. Stir the flour into the caramelised onions in the pan and cook for 2 minutes until the flour smells nutty. Pour over the hot veg stock and stir in the soy sauce and yeast extract, then add the rosemary sprig. Bring to the boil, then reduce the heat and simmer for 5 minutes or until the gravy reaches a nice consistency. Remove the rosemary sprig before serving."
      },
      {
        "Step 7": "Steam the leafy greens for 3-5 minutes until tender. Drizzle over some extra virgin olive oil and sprinkle with salt. Serve the nut roast balls ona bed of greens with the onion gravy poured over."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/76.jpg"
  },
  {
    "id": "77",
    "title": "Vodka-infused cranberry sauce",
    "difficulty": "Easy",
    "portion": "Serves 8",
    "time": "Hands-on time 10 min, plus cooling",
    "description": "Give classic cranberry sauce a boozy kick. Our vodka-infused cranberry sauce takes 10 mins to make and will keep for a week in the fridge.",
    "ingredients": [
      "450g fresh or frozen cranberries",
      "Finely grated zest and juice 1 clementine",
      "4 tbsp vodka",
      "75g caster sugar (or to taste)"
    ],
    "method": [
      {
        "Step 1": "Put the cranberries, clementine zest and juice in a pan along with the vodka. Bring to the boil and simmer for 5 minutes, stirring, until the cranberries begin to burst. Stir in the sugar, then set aside to cool. Serve at room temperature or chill until needed."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/77.jpg"
  },
  {
    "id": "78",
    "title": "Salt-baked celeriac with tahini",
    "difficulty": "Easy",
    "portion": "Serves 4-6",
    "time": "Hands-on time 30 min",
    "description": "Salt-baked celeriac makes an easy but impressive vegan centrepiece. Serve on a colourful lentil and pomegranate salad with tahini sauce and zhoug.",
    "ingredients": [
      "1 large whole celeriac, trimmed and cleaned",
      "1 tbsp zhoug paste (see Know How)",
      "1 tbsp Belazu Tahini",
      "500g plain flour",
      "170g fine sea salt",
      "Large handful herbs, leaves picked – we used rosemary, thyme, marjoram and oregano",
      "2 tbsp cumin seeds",
      "3 tbsp zhoug paste (see Know How), plus extra to serve",
      "Glug olive oil",
      "80g mixed baby salad leaves (we used rocket and sorrel)",
      "2-3 spring onions, finely chopped",
      "Small bunch each mint, dill (or coriander) and flatleaf parsley, leaves picked",
      "3-4 tbsp pomegranate seeds",
      "Lemon wedges to serve (optional)",
      "4 tbsp Belazu Tahini",
      "Juice of 1 lemon",
      "1 small garlic clove, crushed",
      "2 tsp olive oil"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/gas 4. Rub the celeriac with the 1 tbsp each zhoug and tahini. Combine the flour, salt, herbs and cumin seeds in a food processor and whizz until the herbs are finely chopped. With the motor running, pour in enough cold water to form a firm dough (about 200ml). Briefly knead the salt dough on a work surface, then roll out into a disc large enough to fully wrap the celeriac. (To make the dough by hand, finely chop the herbs, then mix in a large bowl with the flour, salt and cumin seeds. Add the water and mix until the dough comes together.)"
      },
      {
        "Step 2": "Wrap the celeriac in the salt dough, pinching the dough together underneath to fully enclose it. Put on a baking tray, then bake for 2 hours."
      },
      {
        "Step 3": "Meanwhile, make the tahini dressing. Put all the ingredients in a small bowl, then whisk to combine. Add enough cold water to thin the sauce to a drizzling consistency, then season with salt and more lemon to taste. Cover and set aside."
      },
      {
        "Step 4": "For the lentil salad, mix the lentils and zhoug in a large bowl with a good glug of olive oil. Toss the leaves, spring onions, herbs and pomegranate seeds with the lentils and set aside until ready to serve."
      },
      {
        "Step 5": "Remove the celeriac from the oven and use a serrated knife to cut away the salt dough (use oven gloves as it will be hot). Discard the dough, then slice the celeriac into wedges and serve with the lentil salad, tahini dressing, a squeeze of lemon and, if you like, more zhoug."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/78.jpg"
  },
  {
    "id": "79",
    "title": "Stir-fried red cabbage with pear and five spice",
    "difficulty": "Easy",
    "portion": "Serves 4-6 as a side",
    "time": "Hands-on time 15 min",
    "description": "Stir-fried red cabbage with pear and five-spice is a quick and versatile side dish. Serve it as a midweek side or even with Christmas turkey.",
    "ingredients": [
      "2 tbsp vegetable oil",
      "1 large red onion, finely sliced",
      "3cm piece fresh ginger, finely chopped",
      "1 small red cabbage, shredded",
      "2 firm pears, cored and thinly sliced",
      "3 tbsp rice vinegar (or cider vinegar)",
      "2 tbsp soy sauce",
      "1 tbsp soft light brown sugar",
      "1½ tsp chinese five-spice",
      "Juice 1 orange, plus 1 tsp finely grated zest",
      "Sesame seeds, toasted in a dry pan, to serve"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a wok or large frying pan over a high heat. Add the onion and ginger and stir-fry for 1-2 minutes until the onion has softened and the ginger is taking on a little colour. Add the red cabbage and a pinch of salt, then continue to cook, tossing the cabbage regularly, for about 3-4 minutes until softened."
      },
      {
        "Step 2": "Turn the heat to medium, then add the rest of the ingredients except the sesame seeds. Continue to cook, stir-frying, until the red cabbage is tender and glossy (about 4-5 minutes)."
      },
      {
        "Step 3": "Taste and season with a pinch more salt and/or vinegar if you like, then sprinkle with sesame seeds to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/79.jpg"
  },
  {
    "id": "80",
    "title": "Whole roasted satay cauliflower",
    "difficulty": "Easy",
    "portion": "Serves 4 as a main or 6 as a side",
    "time": "Hands-on time 15 min, plus 1 hour oven time",
    "description": "Marcus Wareing’s whole roasted satay cauliflower elevates the humble veg to star ingredient. The moreish satay marinade works with many dishes – it’s great with chicken. This recipe is from Marcus’ Kitchen by Marcus Wareing (Harper Collins £22).",
    "ingredients": [
      "1 large cauliflower, outer leaves removed and stalk trimmed",
      "50g unsalted peanuts, toasted in a dry pan, then chopped",
      "¼ bunch coriander, leaves and tender stems chopped",
      "3 garlic cloves, peeled",
      "Thumb-size piece fresh ginger, peeled",
      "1 red onion, roughly chopped",
      "1 tsp salt",
      "1 tbsp ground cumin",
      "1 tbsp ground coriander",
      "1 tbsp ground turmeric",
      "1 tbsp garam masala",
      "½ tsp hot chilli powder (or to taste)",
      "3 tbsp kecap manis (sweet soy sauce)",
      "100g chunky peanut butter",
      "400ml tin coconut milk",
      "1 tbsp soy sauce",
      "1 tbsp rice wine vinegar"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/gas 4. First, make the satay marinade. Put the garlic, ginger, onion and salt in a food processor and whizz to a coarse paste. Add the rest of the ingredients for the marinade and whizz until smooth."
      },
      {
        "Step 2": "Make sure the cauliflower can sit flat on its stalk, then place it in a large, deep casserole. Pour the satay marinade over the cauliflower and cover the dish with the lid or foil. Put in the oven and bake for 1 hour, basting it regularly during the cooking. Halfway through cooking, add 100ml water to ensure it doesn’t dry out."
      },
      {
        "Step 3": "Once baked, the cauliflower should be soft. Check it by piercing it with a knife – there should be no resistance. If the cauliflower isn’t quite ready, pop it back in the oven for 10 minutes and check again."
      },
      {
        "Step 4": "To finish the cauliflower, sprinkle it with the chopped toasted peanuts and coriander and serve it from the casserole (or transfer it to a serving plate if you prefer, sprinkling it with the peanuts and coriander once it’s on the plate)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/80.jpg"
  },
  {
    "id": "81",
    "title": "Gennaro Contaldo’s limoncello",
    "difficulty": "Easy",
    "portion": "Makes Around 1.25 litres",
    "time": "Hands-on time 30 min, plus 17 days infusing and maturing",
    "description": "Gennaro Contaldo shares his recipe for traditional limoncello, made with the zest of Amalfi lemons. Serve cold or use in desserts.",
    "ingredients": [
      "3 unwaxed lemons (use organic lemons if you can, preferably from Amalfi)",
      "500ml pure grain alcohol (see Know How)",
      "750ml water",
      "400g sugar",
      "Glass bottle(s) with at least 1.25 litres total capacity, sterilised",
      "Funnel"
    ],
    "method": [
      {
        "Step 1": "Wash the lemons in cold water and dry well. Use a peeler to pare off the rind, avoiding the white pith. Put the rind in a large jar, pour over the alcohol and seal – it should be airtight. Set in a cool, dry place for 7 days."
      },
      {
        "Step 2": "Seven days later, put the water in a pan and bring to the boil. Add the sugar and stir until it dissolves. Remove the syrup from the heat and allow to cool."
      },
      {
        "Step 3": "Open the jar and strain the alcohol through a sieve into a large jug, discarding the peel. Add the alcohol to the sugar syrup and mix well. Pour into clean, dry bottles. Seal and store in a cool, dark place for at least 10 days."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/81.jpg"
  },
  {
    "id": "82",
    "title": "Cherry mincemeat",
    "difficulty": "Easy",
    "portion": "Makes around 1.7kg",
    "time": "Hands-on time 20 min, plus macerating and cooling time",
    "description": "Debora Robertson’s cherry mincemeat makes a zesty, fruity mince pie filling and is vegan-friendly to boot. Perfect for Christmas food gifts.",
    "ingredients": [
      "1.2kg bramley apples (about 5), peeled, cored and cut roughly into 2cm pieces",
      "Juice and zest 3 oranges (weigh the dried fruit and zest the oranges directly onto it, so you don’t lose any fragrant oils)",
      "500g crisp eating apples (about 3), such as russets or braeburns, peeled, cored and cut into 1cm cubes",
      "400g jar good cherries in syrup – use the precious syrup too, don’t discard it, pour it in there with the rest",
      "200g currants",
      "200g raisins",
      "200g sultanas",
      "150g blanched almonds, roughly chopped",
      "120g good cherry jam  (we used Bonne Maman Black Cherry Conserve)",
      "125g demerara sugar",
      "125g light muscovado sugar",
      "Juice 2 lemons",
      "2 tbsp ground ginger",
      "½ nutmeg, grated",
      "½ tsp salt",
      "½ tsp ground cardamom",
      "½ tsp ground cloves",
      "150ml kirsch",
      "Sterilised jars with lids"
    ],
    "method": [
      {
        "Step 1": "Tip the bramley apple pieces into a pan with the orange juice and cook gently for 15 minutes until they form a silky purée with a few small pieces left in it. Pour the purée into a bowl and stir in the rest of the ingredients except for the booze. Cover and leave everything to macerate for 12 hours – I start it off the day before I want to make the mincemeat."
      },
      {
        "Step 2": "Heat the oven to 110ºC fan/gas 1. Put the mincemeat on a large baking tray and cook for 2 hours 10 minutes to 2 hours 20 minutes, stirring once or twice. The fruit should look luscious and the mixture slightly loose – it will firm up as it cools. Stir in the kirsch and spoon into warm sterilised jars. Seal and store in dark, cool place until Christmas. Use within 12 months."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/82.jpg"
  },
  {
    "id": "83",
    "title": "Roast sprouts, cranberries and kale",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 15 min",
    "description": "The award for most useful Christmas side goes to this easy 3-in-one dish of festive classics. Our roast sprouts with cranberries and kale is vegan and gluten-free to boot.",
    "ingredients": [
      "500g sprouts, halved if large",
      "2 tbsp olive oil",
      "2 large handfuls sliced kale",
      "100g fresh cranberries",
      "50g pecans, roughly broken",
      "1 tbsp maple syrup",
      "1 tbsp balsamic vinegar"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180ºC fan/gas 6. Toss the sprouts with the oil on a lipped baking tray, then season with salt and freshly ground black pepper. Roast for 15 minutes, then add the kale, cranberries and nuts to the tray and continue roasting for a further 10 minutes."
      },
      {
        "Step 2": "Drizzle the maple syrup and vinegar over the roasted veg, add a little extra seasoning to taste, then toss everything together and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/83.jpg"
  },
  {
    "id": "84",
    "title": "Quince jelly",
    "difficulty": "Easy",
    "portion": "Makes about 500ml",
    "time": "Hands-on time 20 min, plus overnight straining and cooling",
    "description": "Make the most of quince’s short autumn season by stirring up a batch of delicious quince jelly. Try with roast game or simply spread on toast.",
    "ingredients": [
      "1.5kg quinces (7-8), peeled and roughly chopped into 3-4cm pieces (leave in the cores/pips and reserve the peel)",
      "800g-1.2kg caster sugar",
      "10g fresh ginger (about a 5cm piece), peeled and thinly sliced",
      "½ vanilla pod, seeds scraped",
      "8 tbsp lemon juice",
      "Large jelly bag or sieve lined with 3-4 layers of muslin",
      "Large wide saucepan",
      "Sterilised glass jars and lids"
    ],
    "method": [
      {
        "Step 1": "Put the quinces, their peel and 2 litres water in a large pan. Bring to the boil, then cover and reduce to a simmer. Cook for 2 hours or until the fruit is very soft. Spoon the quinces and liquid into a jelly bag/muslin set over a large pan. Set aside to strain for at least 12 hours or overnight. Don’t be tempted to squeeze it or the jelly will be cloudy."
      },
      {
        "Step 2": "Once strained, measure the juice and pour into a large, wide saucepan – you should have about 1½ litres (see Don’t Waste It). Add 800g sugar per litre of juice to the pan along with the ginger, vanilla pod and seeds, and lemon juice. Set the pan over a medium heat, stirring until the sugar dissolves. Put a small plate in the freezer."
      },
      {
        "Step 3": "Increase the heat to high and bring the liquid to a rapid boil. Cook for 30-40 minutes until the jelly is reduced and thickened. To test if it’s ready (at setting point), spoon a little liquid onto the cold plate. The jelly should set right away and wrinkle when you push it. If it doesn’t, cook for 10 minutes more, then test again."
      },
      {
        "Step 4": "Remove the ginger and vanilla (see Don’t Waste It), then pour the jelly into hot, sterilised jars. Wipe the rims with a sterilised damp cloth, then close tightly with sterilised lids. Put the jars upside down on a tea towel for 1 hour to seal, then turn upright and leave to cool."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/84.jpg"
  },
  {
    "id": "85",
    "title": "Membrillo (quince paste)",
    "difficulty": "Easy",
    "portion": "Makes about 64 squares",
    "time": "Hands-on time 50-60 min, plus cooling and overnight setting",
    "description": "Learn how to make membrillo, the Spanish quince paste. It’s traditionally served with manchego cheese, but also delightful spread on toast.",
    "ingredients": [
      "1kg quinces (4-5), washed to remove any fuzz, then cored and quartered",
      "7 tbsp lemon juice",
      "800g caster sugar",
      "Fine sieve lined with 2-3 layers of muslin",
      "Blender or food processor",
      "20cm x 20cm tin lined with compostable baking paper"
    ],
    "method": [
      {
        "Step 1": "Put the quinces, lemon juice and 1 litre cold water in a large pan (one with a lid). Bring to the boil, then reduce to a simmer. Put on the lid and cook for 45-50 minutes until the quinces are very soft. Strain the fruit through a fine muslin lined sieve (see Don’t Waste It)."
      },
      {
        "Step 2": "Whizz the strained quinces to a fine purée in a blender or food processor. Pour into a large pan and stir in the sugar. Put the pan over a low-medium heat and cook, stirring regularly to make sure it doesn’t catch on the bottom, for 40-50 minutes until reduced and thickened. The quince paste is done when it doesn’t fall back on itself when stirred"
      },
      {
        "Step 3": "Spread the quince paste inside the prepared tin. Smooth the surface, then press a sheet of compostable baking paper over the top. Leave to cool and set for at least 24 hours. Cut into 2.5cm x 2.5cm squares to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/85.jpg"
  },
  {
    "id": "86",
    "title": "Easy overnight oats",
    "difficulty": "Easy",
    "portion": "Serves 1 (but easily scaled up)",
    "time": "Hands-on time 5 min, plus overnight soaking ",
    "description": "Our vegan overnight oats recipe takes 5 minutes to whizz up the night before. Blend almond or oat milk, oats, pumpkin seeds and vanilla for a healthy breakfast.",
    "ingredients": [
      "1 tsp pumpkin seeds",
      "50ml almond milk",
      "Drop vanilla extract",
      "30g rolled oats (gluten free if need be)",
      "80g mixed berries, bigger ones halved or quartered",
      "Blender or small food processor"
    ],
    "method": [
      {
        "Step 1": "In a blender or small food processor roughly whizz the pumpkin seeds with the almond milk, vanilla and 50ml water. Put in a small container with the oats and mix well. Cover and refrigerate overnight."
      },
      {
        "Step 2": "In the morning, remove the oats from the fridge about 30 minutes before serving. Transfer to a small bowl and top with the berries to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/86.jpg"
  },
  {
    "id": "87",
    "title": "Roasted rainbow carrot salad",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 15 min",
    "description": "Roast rainbow carrots then tumble together with pomegranate, pumpkin seeds, herbs and lemony dressing for an easy, colourful warm salad.",
    "ingredients": [
      "1 tbsp clear honey (or maple syrup if vegan)",
      "Grated zest and juice 1 lemon",
      "5 tbsp extra-virgin olive oil",
      "1.5kg mixed heirloom or rainbow carrots, trimmed (or use regular)",
      "1 red onion, sliced into thin wedges",
      "Handful salad leaves",
      "30g pumpkin seeds, toasted in a dry pan",
      "80g pomegranate seeds",
      "2 tbsp each chopped parsley, coriander and mint",
      "Large roasting tin lined with compostable baking paper"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180ºC fan/gas 6. Whisk together the honey/syrup, lemon zest, 1 tbsp of the oil and a little seasoning."
      },
      {
        "Step 2": "Halve the carrots lengthways and put them in the prepared roasting tin with the onion wedges. Add the oil mixture and stir well so all the carrots are lightly glazed. Spread out the veg in a single layer and roast for 30-40 minutes or until tender, stirring several times."
      },
      {
        "Step 3": "Whisk the lemon juice, remaining oil and some salt and pepper. Arrange the carrots and some salad leaves on a large platter. Top with the pumpkin seeds, pomegranate seeds and herbs, then drizzle over the dressing and serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/87.jpg"
  },
  {
    "id": "88",
    "title": "Griddled za’atar flatbreads",
    "difficulty": "Easy",
    "portion": "Makes 8",
    "time": "Hands on time 35-40 min, plus proving ",
    "description": "These simple za’atar flatbreads are really easy to make. Just 30 minutes proving, then they’re ready to griddle in a hot pan. Serve with tagines, houmous or slow-roast lamb.",
    "ingredients": [
      "½ tsp fast-action dried yeast",
      "180ml lukewarm water",
      "300g white bread flour, plus extra to dust",
      "1 tsp salt",
      "1 tbsp olive oil",
      "2 tsp za’atar spice mix",
      "2-3 large baking trays dusted with flour",
      "Large heavy-based frying pan or griddle pan",
      "1-2 clean tea towels"
    ],
    "method": [
      {
        "Step 1": "Whisk the yeast, warm water and a spoonful of the flour in a bowl until the yeast dissolves. Leave the bowl in a warm place for a few minutes until frothy."
      },
      {
        "Step 2": "Put the remaining flour and salt in a large bowl. Make a well in the centre, pour in the yeast mixture and olive oil and combine to form a soft dough. Knead for 5 minutes until smooth and elastic. Cover the bowl with a clean tea towel and set aside for 30 minutes."
      },
      {
        "Step 3": "Divide the dough into 8 equal pieces and shape each into a ball. Flour the work surface, take a ball and flatten it with your hands to form a round. Using a rolling pin, roll out the dough to form a thin round about 20cm across. Scatter with a little za’atar and roll again to press it into the dough. Set aside on a lightly floured tray while you shape the remaining flatbreads."
      },
      {
        "Step 4": "Heat the frying/griddle pan over a high heat. Cook the flatbreads one at a time, for about 1 minute on each side, until puffed and golden. Wrap in a clean tea towel and keep warm (see Make Ahead) until ready to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/88.jpg"
  },
  {
    "id": "89",
    "title": "Root vegetable and lentil tagine",
    "difficulty": "Easy",
    "portion": "Serves 6",
    "time": "Hands-on time 20 min, simmering time 20-25 min",
    "description": "Our take on a Moroccan tagine is packed with warming spices, seasonal veg and fibre-rich lentils for a healthy, vegan midweek meal. ",
    "ingredients": [
      "1 tbsp light olive oil",
      "About 900g mixed root veg (see tip)",
      "3 tbsp dried harissa",
      "Large handful fresh parsley, stalks and leaves chopped separately ",
      "200g dried green lentils",
      "2 x 400g tins cherry tomatoes",
      "700ml gluten-free vegetable stock",
      "Grated zest and juice 1 lemon",
      "6 prunes, stoned and quartered",
      "1 small cauliflower, cut into florets, any small leaves reserved",
      "Unsweetened coconut yogurt to serve",
      "Cooked rice or couscous to serve"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a large heavy-based flameproof casserole (with a lid) over a medium heat. Add the root veg and fry for 10 minutes, stirring occasionally, until beginning to soften. Stir in the harissa paste, parsley stalks and lentils."
      },
      {
        "Step 2": "Add the tomatoes and stock, then stir in the preserved lemon and prunes. Bring to a simmer, then cover and cook for 20-25 minutes, stirring occasionally, until the lentils are tender."
      },
      {
        "Step 3": "Stir in the cauliflower, then bring back to a simmer. Season, then cook for 3-4 minutes, uncovered, until the cauliflower is starting to become tender. Add the cauliflower leaves, then cook for 2 minutes more. Serve with coconut yogurt and the parsley leaves scattered over the top, with rice or couscous."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/89.jpg"
  },
  {
    "id": "90",
    "title": "Pickled peaches",
    "difficulty": "Easy",
    "portion": "Makes 1.5kg (about 10 servings)",
    "time": "Hands-on time 20 mins",
    "description": "New to pickling? Grab a sterilised jar and have a go at Debora Robertson’s easy recipe for pickled peaches. They’ll go with everything…especially cheese.",
    "ingredients": [
      "1.2kg just ripe but still firm peaches (about 10)",
      "Thinly pared zest and juice from an unwaxed lemon – use a sharp peeler and avoid the bitter white pith – you want thin strips about 2cm by 5cm",
      "1 litre white wine vinegar",
      "550g granulated sugar",
      "6 pink or black peppercorns",
      "3 thinnish peeled ginger slices",
      "4 cloves",
      "1 cinnamon stick",
      "½ tsp yellow mustard seeds",
      " Large Kilner-type jar, about 1.5 litres"
    ],
    "method": [
      {
        "Step 1": "First, scrub your jar in soapy water, rinse it well and put it in a low oven to stay warm. Cut a small cross in the skin at the base of each peach, then plunge them into boiling water, a few at a time, for 10 seconds. After this, plunge them into a bowl of iced water – the skins should now come away easily. Cut them in half, discard the stones and toss them in the lemon juice."
      },
      {
        "Step 2": "To make the pickling liquid, put everything else bar the peaches in a large stainless steel or enamel pan (no aluminium – it doesn’t get on with vinegar) over a low heat and stir until the sugar dissolves. Now raise the heat and boil for 5 minutes, then lower the heat, add the fruit and simmer for 5 to 10 minutes. You want the peaches to be just soft when you pierce them with a sharp knife."
      },
      {
        "Step 3": "Use a slotted spoon to lower the peaches into the warm jar, then simmer the pickling liquid until it’s slightly syrupy. Strain it over the peaches to cover (or leave the spices in) and seal the jar."
      },
      {
        "Step 4": "They’re good to eat after a few hours, very good after 2 days and best after about 6 weeks. Try them with good bread and brie. Keep chilled once opened."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/90.jpg"
  },
  {
    "id": "91",
    "title": "Vegan pesto spaghetti with lemon and courgettes",
    "difficulty": "Easy",
    "portion": "Serves 2",
    "time": "Hands-on time 10 min",
    "description": "Give vegan pesto spaghetti a summertime twist with lemon zest, broad beans and courgettes. This easy dinner for 2 is all made in one pan, does it get any better?!",
    "ingredients": [
      "2 tbsp extra-virgin olive oil, plus extra to serve",
      "1 small onion, finely chopped",
      "2 garlic cloves, finely chopped",
      "1 medium courgette, thinly sliced",
      "400ml vegetable stock",
      "150g spaghetti",
      "50g broad beans, podded",
      "50g runner beans, cut into 2-3cm pieces",
      "1 lemon, zest and juice of ½, the rest cut into wedges",
      "50g green olives",
      "130g vegan basil pesto – we used Saclà",
      "Parmesan-style vegan cheese and basil leaves to serve (optional)",
      " Medium saucepan or deep-sided sauté pan with a lid"
    ],
    "method": [
      {
        "Step 1": "Heat 1 tbsp of the oil in a large pan over a medium heat. Add the chopped onion and cook for 5 minutes until softening. Add the garlic and cook for a further minute."
      },
      {
        "Step 2": "Add the remaining 1 tbsp oil to the pan, then stir in the courgette and fry for 5 minutes until the edges are charred and the courgette slices are lightly coloured."
      },
      {
        "Step 3": "Pour in the stock, stirring to combine, then bring to a simmer and add the spaghetti, broad beans, runner beans and lemon wedges. Simmer on a medium-high heat for 10 minutes or until the pasta is tender (al denté)."
      },
      {
        "Step 4": "Once the pasta has cooked and the stock has reduced, add the green olives and pesto, tossing everything together gently to combine. Serve with the lemon zest and juice, an extra drizzle of olive oil and, if you like, vegan parmesan and basil leaves."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/91.jpg"
  },
  {
    "id": "92",
    "title": "Chetna Makan’s tamarind aubergine curry (imli baigan curry)",
    "difficulty": "Easy",
    "portion": "Serves 4 as part of sharing menu or 2 as a main dish with rice",
    "time": "Hands-on time 20 min",
    "description": "Chetna Makan’s imli baigan is a quick aubergine curry recipe with bags of flavour: fried onions and aubergine, fennel and a tamarind tang.",
    "ingredients": [
      "1 large aubergine, cut into 5-7.5cm long strips",
      "3-4 tbsp sunflower oil",
      "Pinch asafoetida",
      "2 onions, thinly sliced",
      "1 tbsp fennel seeds",
      "1 tsp chilli powder",
      "1 tsp ground ginger",
      "1 tsp sugar",
      "1 tsp tamarind paste",
      "Pestle and mortar"
    ],
    "method": [
      {
        "Step 1": "To prepare the aubergine, put it on a plate, sprinkle with a pinch of salt and set aside for 10 minutes. Meanwhile, heat 1 tbsp oil in a pan, add the asafoetida and sizzle for a few seconds. Add the onions and cook over a medium heat for 10 minutes until golden."
      },
      {
        "Step 2": "Heat the remaining oil in a large frying pan. Pat the aubergine fingers dry, add them to the hot oil and cook over a high heat for 2 minutes until golden."
      },
      {
        "Step 3": "While the aubergine is cooking, heat a small frying pan, add the fennel seeds and toast for 1 minute, then use a pestle and mortar to crush them."
      },
      {
        "Step 4": "Add the crushed fennel seeds to the onion pan and cook for a minute, then stir in the ground spices. Add the fried aubergine with 200ml water and cook over a low heat for 10 minutes."
      },
      {
        "Step 5": "Stir in the sugar and tamarind and cook over a high heat for 5 minutes until the sauce thickens, then serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/92.jpg"
  },
  {
    "id": "93",
    "title": "Pickle-spiced chickpeas (aachari chole)",
    "difficulty": "Easy",
    "portion": "Serves 4 or 6 as part of a sharing menu",
    "time": "Hands-on time 15 min",
    "description": "Chetna Makan’s easy spiced chickpeas (aachari chole) can be served as a side or vegan main. Simmer chickpeas with tomatoes and spices until tender.",
    "ingredients": [
      "4 tbsp edible mustard oil or sunflower oil (see intro)",
      "2 tsp fennel seeds",
      "2 tsp nigella seeds",
      "1 tsp black mustard seeds",
      "1 tsp fenugreek seeds",
      "1 tsp cumin seeds",
      "4 dried red chillies",
      "2 onions, finely chopped",
      "2 garlic cloves, grated",
      "1 tsp salt",
      "1 tsp chilli powder",
      "1 tsp ground turmeric",
      "1 tsp amchur (mango powder)",
      "1 tsp garam masala",
      "1 tsp sugar",
      "400g tin chopped tomatoes",
      "2 x 400g tins chickpeas, drained and rinsed"
    ],
    "method": [
      {
        "Step 1": "Heat the oil in a pan. Once it’s hot and smoky, add all the spice seeds and the chillies, then cook over a medium heat for a few seconds until they’re all sizzling."
      },
      {
        "Step 2": "Add the onions and cook over a medium heat for 8-10 minutes until golden, then add the garlic and cook for 1 minute."
      },
      {
        "Step 3": "Stir in all the remaining ingredients with 200ml water, then bring to the boil. Cover and cook over a low-medium heat for 15 minutes, then serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/93.jpg"
  },
  {
    "id": "94",
    "title": "Peanut butter sweet potato and spinach curry",
    "difficulty": "Easy",
    "portion": "Serves 3-4",
    "time": "Hands-on time 15 min",
    "description": "Dale Pinnock’s filling curry is packed with peanut butter, sweet potatoes and spinach. Make vegan curry from scratch with just 15 mins prep.",
    "ingredients": [
      "1 large red onion, chopped",
      "4 garlic cloves, finely chopped",
      "1 red chilli, deseeded and finely chopped",
      "Thumb-size piece fresh ginger, finely chopped",
      "Olive oil for frying",
      "1 tsp ground cumin",
      "1 tsp ground coriander",
      "1 tsp garam masala",
      "1 tsp ground turmeric",
      "½ tsp ground cinnamon",
      "2-3 sweet potatoes (about 600g), skin on, chopped into roughly 3cm chunks",
      "500ml vegan vegetable stock (you may not need all of this)",
      "1 heaped tbsp crunchy peanut butter",
      "4 handfuls baby leaf spinach"
    ],
    "method": [
      {
        "Step 1": "In a large heavy-based pan set over a medium heat, fry the onion, garlic, chilli and ginger in a little oil with a good pinch of salt for 10 minutes until softened."
      },
      {
        "Step 2": "Add the cumin, coriander, garam masala, turmeric and cinnamon, then fry for 2-3 minutes more until aromatic."
      },
      {
        "Step 3": "Add the sweet potatoes and enough vegetable stock to cover the contents of the pan by about two thirds. Simmer over a medium heat for 30-45 minutes, stirring often, until the liquid has reduced right down and the starch has leached from the sweet potatoes to create a thick sauce. It may seem like it’s taking a while but be patient."
      },
      {
        "Step 4": "Once the sauce has thickened, stir in the peanut butter. Take the pan off the heat and stir in the spinach until it wilts, then serve with wholegrain rice, if you’re hungry."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/94.jpg"
  },
  {
    "id": "95",
    "title": "Caponata with couscous",
    "difficulty": "Easy",
    "portion": "Serves 2-3",
    "time": "Hands-on time 45 min",
    "description": "Dale Pinnock’s easy vegan caponata is packed with aubergine, courgette, tomatoes and olives. Serve with wholegrain couscous.",
    "ingredients": [
      "Olive oil for frying",
      "1 large red onion, halved and sliced",
      "2 garlic cloves, finely chopped",
      "1 large aubergine, chopped",
      "1 large courgette, chopped 3-4 large tomatoes, quartered",
      "1 heaped tbsp capers",
      "2 tbsp pitted green or black olives",
      "200ml tinned chopped tomatoes",
      "2 tbsp red wine vinegar",
      "1 tsp dried mixed herbs",
      "120g wholewheat couscous",
      "175ml boiling water"
    ],
    "method": [
      {
        "Step 1": "Heat a little olive oil in a large heavy-based frying pan set over a medium heat, then fry the onion and garlic with a good pinch of salt for about 10 minutes until softened."
      },
      {
        "Step 2": "Add the aubergine and continue to fry for 10 minutes."
      },
      {
        "Step 3": "Add the courgette, fresh tomatoes, capers, olives and about half the chopped tomatoes. Stir thoroughly and bring to a simmer. Cook for 10 minutes until the sauce has reduced and the mixture is becoming dry."
      },
      {
        "Step 4": "Add the rest of the chopped tomatoes, plus the red wine vinegar and dried mixed herbs, then simmer for another 10 minutes until the sauce has reduced again and the flavours have concentrated."
      },
      {
        "Step 5": "Meanwhile, put the couscous in a bowl, add the boiling water and cover for 10 minutes. Fluff up with a fork."
      },
      {
        "Step 6": "To serve, divide the couscous between 2 plates and add a generous portion of the caponata alongside."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/95.jpg"
  },
  {
    "id": "96",
    "title": "Vegan hot dogs",
    "difficulty": "Easy",
    "portion": "Serves 4",
    "time": "Hands-on time 30 min",
    "description": "Serve up the ultimate meat-free BBQ feast with our easy vegan hot dogs recipe. Load hot dog buns with vegan sausages and chargrilled veg.",
    "ingredients": [
      "3 tbsp olive oil",
      "1 bushy rosemary sprig, leaves picked and chopped",
      "3-4 medium carrots, halved (or 6-8 baby carrots, whole)",
      "4 spring onions or 1 red onion, cut into 4 thick rings",
      "4 vegan hot dogs or 8 vegan chipolatas (we used Moving Mountains plant based hot dogs, from Sainsbury’s and Waitrose)",
      "2 corn cobs",
      "4 tbsp tomato chutney",
      "Handful basil leaves, mostly torn, plus a few extra whole to serve",
      "4 sub rolls",
      "Mayonnaise (optional – vegan if it needs to be), gherkins and mixed salad leaves to serve",
      "Barbecue with a lid (or ridged griddle pan)"
    ],
    "method": [
      {
        "Step 1": "Heat/light the barbecue and spread the coals in an even layer. Mix the oil with the rosemary and salt and pepper in a bowl, then brush over the carrots, spring onions, vegan hot dogs and corn. Put the carrots on the grill and cook with the lid down for 10 minutes, turning from time to time. Add the corn cobs, onions and sausages, then cook for 15 minutes, turning occasionally, until everything is tender."
      },
      {
        "Step 2": "Using a sharp knife, slice the corn off the cobs, then mix in a bowl with the tomato chutney and the torn basil. Season to taste. Put the sub rolls on the barbecue to warm, then split down the middle and add some sweetcorn relish and mayo (if using)."
      },
      {
        "Step 3": "Fill each roll with the hotdogs and grilled veg, then top with more sweetcorn relish and some extra basil leaves. Serve with gherkins, extra mayo and salad leaves."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/96.jpg"
  },
  {
    "id": "97",
    "title": "Barbecued vegetables with tahini dressing",
    "difficulty": "Easy",
    "portion": "Serves 3-4",
    "time": "Hands-on time 15 min, plus tending to the grill",
    "description": "Barbecue aubergine, peppers, courgettes, padron peppers and runner beans for an easy vegan feast. Serve the barbecued veg with a herby shallot and tahini dressing.",
    "ingredients": [
      "2 medium courgettes (or 6 baby courgettes)",
      "4 salad onions",
      "4 medium shallots, unpeeled",
      "8 large runner or helda beans",
      "1 large aubergine",
      "3 sweet peppers (red, orange or yellow)",
      "100g padrón peppers",
      "50g pine nuts",
      "Vegetable oil for brushing",
      "2 tbsp snipped chives",
      "Handful coriander or flatleaf parsley (or a bit of both), roughly chopped",
      "2 mint sprigs, leaves picked",
      "Handful basil leaves",
      "Small handful baby spinach leaves",
      "1 tbsp tahini",
      "1 tsp pomegranate molasses, plus extra to serve",
      "½-1 large green chilli, chopped (optional)",
      "4 tbsp extra-virgin olive oil",
      "Juice ½-1 lemon",
      "Barbecue (with a lid)",
      "Food processor or blender (small is fine)",
      "Heavy-based ovenproof frying pan"
    ],
    "method": [
      {
        "Step 1": "Heat/light the barbecue for indirect grilling (the hot coals should be banked to one side). Once ready, brush the vegetables lightly with oil and add to the grill (not over the coals). Put the lid on and cook for 45 minutes, checking the coals and turning the veg every 15-20 minutes. Have a feel of the veg and remove the peppers, courgettes, onions, shallots and beans if they feel soft and tender – keep everything warm and covered. Slice the courgettes at this point and return them briefly to the grill, flesh side down, to give them char lines."
      },
      {
        "Step 2": "Stoke the barbecue (add more fuel if needed to get a flame going), then move the aubergine over the heat to char and blacken the skin. The aubergine needs to be very soft inside and should be turned regularly. It will take another 10-15 minutes or so."
      },
      {
        "Step 3": "Once the shallots are tender, make the dressing. Peel away and discard the skin from the shallots and add the bulbs to a food processor/blender along with the herbs, spinach, tahini, pomegranate molasses, chilli (if using) and oil. Whizz until smooth, then season to taste with the lemon juice and salt and black pepper. Set aside."
      },
      {
        "Step 4": "When the aubergine is nearly done, put your pan on the barbecue over the heat. Toss the padrón peppers in oil and sprinkle with salt, then add them to the pan to cook – they should take 6-8 minutes if the barbecue is hot. Add the pine nuts to the pan to toast gently near the end of cooking (watch them like a hawk as they burn easily)."
      },
      {
        "Step 5": "Arrange the veg on a platter and ‘carve’ them for easy serving: split open the aubergine to reveal the soft flesh inside and slice the peppers, releasing their juices. Arrange the courgettes, onions and beans around them on the plate. Spoon the dressing inside the aubergine and over the other veg, then scatter with the padrón peppers and pine nuts and drizzle with more pomegranate molasses."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/97.jpg"
  },
  {
    "id": "98",
    "title": "Orzo with roasted veg sauce",
    "difficulty": "Easy",
    "portion": "Serves 2-3",
    "time": "Hands-on time 15 min ",
    "description": "Dale Pinnock’s orzo with roasted veg sauce is the ultimate vegan comfort food for busy nights. Blitz roasted onions, tomatoes and peppers and simmer with orzo for a super easy dinner. The Medicinal Chef: Plant-Based Diet is out now.",
    "ingredients": [
      "1 large red onion, sliced",
      "1 large red pepper, deseeded and sliced",
      "1 large yellow pepper, deseeded and sliced",
      "4 large garlic cloves, finely chopped",
      "Olive oil for drizzling",
      "4-5 large plum tomatoes, quartered",
      "1 tbsp balsamic vinegar",
      "100g orzo",
      "200ml vegan vegetable stock",
      "Small handful basil leaves to garnish",
      "Food processor"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C fan/gas 6. Put the onion, peppers and garlic in a roasting tin, drizzle with a little olive oil and add a good pinch of salt. Roast for about 20 minutes. Add the tomatoes and balsamic vinegar and stir. Return the vegetables to the oven and roast for a further 25-30 minutes."
      },
      {
        "Step 2": "At this stage there should be a lovely concentrated sauce in the bottom of the roasting tin. Transfer everything to a food processor and whizz."
      },
      {
        "Step 3": "Pour the sauce into a saucepan, add the orzo and simmer gently for about 10 minutes until the sauce has thickened and reduced and the orzo is starting to soften. Add the vegetable stock in small increments – you probably won’t need all of it. What you’re aiming for is a risotto-like texture, where the orzo is cooked al dente and the sauce is thick and rich. Garnish with basil leaves before serving."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/98.jpg"
  },
  {
    "id": "99",
    "title": "Easy homemade bagels",
    "difficulty": "Medium",
    "portion": "Makes 6 bagels",
    "time": "Hands-on time 20 min, plus resting/proving/overnight proving, oven time 20 min",
    "description": "Bake Off champion David Atherton shows you how to get that crucial chewy texture (and the correct sized hole) when you make the New York deli favourites. Scroll on down to watch a video showing you how to make the bagels.",
    "ingredients": [
      "1 tbsp malt extract",
      "50g prunes",
      "225g warm water",
      "350g strong white bread flour",
      "50g strong wholemeal bread flour",
      "4g fast action yeast",
      "6g fine salt",
      "20g poppy seeds",
      "1 tsp vegetable oil",
      "2 tbsp malt extract",
      "1/2 tsp bicarbonate of soda",
      "Caraway seeds, for scattering on top",
      "Sesame seeds, for scattering on top",
      "Blender or food processor",
      "Large baking tray lined with compostable baking paper",
      "Compostable cling film"
    ],
    "method": [
      {
        "Step 1": "Blend together the malt extract, prunes and warm water until fully combined and smooth."
      },
      {
        "Step 2": "Put the flours, yeast, salt and poppy seeds into a large mixing bowl, add the wet mixture and mix to form a dough. Knead for 5 minutes in the bowl, adding a little more flour if the dough is very sticky, then leave, covered with a tea towel, for 30 minutes."
      },
      {
        "Step 3": "Divide the dough into 6 pieces (each about 110g). Shape each piece into a tight ball. Shape your bagel by sticking your finger through the middle and stretch it outwards (you want it to be twice as wide as you would like the final hole, as it will rise when baked)."
      },
      {
        "Step 4": "Put the bagels on the prepared baking tray, leaving enough room around them to rise. Pour the vegetable oil into a reusable proving bag. Now cover the bagels with this and place in the fridge for about 10 hours or overnight."
      },
      {
        "Step 5": "The next morning heat the oven to 180°C fan/gas 6."
      },
      {
        "Step 6": "Fill a large saucepan with 2 litres of water, add the malt extract and bring to the boil. Reduce to a simmer then add the bicarbonate of soda (make sure the heat is low as the bicarb will make the water foam and overflow if it is still boiling)."
      },
      {
        "Step 7": "Gently drop in each bagel and poach for 45 seconds on each side. Place [Put] the poached bagels back onto the baking tray and sprinkle with the caraway and sesame seeds. Bake for 18 minutes until golden."
      },
      {
        "Step 8": "Place the bagels on a wire rack to cool. Store in an airtight container for up to 2 days, or slice in half and freeze."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/99.jpg"
  },
  {
    "id": "100",
    "title": "Mushroom burger",
    "difficulty": "Easy",
    "portion": "Serves 1",
    "time": "Hands-on time 15 min",
    "description": "Assemble a tasty mushroom burger in just 15 minutes. Top our quick mushroom burger with red pesto, rocket and vegan aioli. Delicious.",
    "ingredients": [
      "2 tbsp avocado or olive oil",
      "1 tbsp finely chopped soft herbs (we used parsley, basil and oregano – see Easy Swaps)",
      "1 small garlic clove, crushed",
      "1 large or 2-3 small portobello mushrooms, stalks trimmed",
      "Juice ½ lemon",
      "1 ciabatta bun, halved",
      "2 tbsp red pesto (make sure it’s vegan if you need it to be)",
      "2 tbsp vegan garlic aioli (we like Leon’s version)",
      "Small handful rocket leaves",
      "Griddle pan"
    ],
    "method": [
      {
        "Step 1": "Heat a griddle pan (or the BBQ) over a medium-high heat. Whisk the oil, herbs and garlic in a small bowl with a pinch of salt and pepper. Brush the mushroom(s) with some herb oil and cook for 4-5 minutes on each side until lightly charred. Squeeze over the lemon juice."
      },
      {
        "Step 2": "Brush the cut sides of the ciabatta with a little more herb oil, then griddle, cut-side down, for 1-2 minutes until lightly toasted."
      },
      {
        "Step 3": "Spread the bun base with pesto, then top with the rocket, mushrooms and any remaining oil. Spread the burger lid with the aioli, sandwich together and eat – with a napkin for those drips of garlicky oil."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/vegan_api/100.jpg"
  }
]